{
  "Cosrx Salicylic Acid Daily Gentle Cleanser": {
    "product_name": "Cosrx Salicylic Acid Daily Gentle Cleanser",
    "product_type": "Cleanser",
    "posts": [
      {
        "post_id": "dbs0kk",
        "post_author": "rr0596",
        "post_score": 6,
        "post_created_utc": 1569929442.0,
        "post_title": "Anyone here experienced breakout using COSRX Salicylic Acid Daily Gentle Cleanser?",
        "post_url": "https://reddit.com/r/beautytalkph/comments/dbs0kk/anyone_here_experienced_breakout_using_cosrx/",
        "post_selftext": "I've been using this product for almost 2 months already, and I noticed I have several cystic bumps especially on my right cheek. I'm afraid I'm having a breakout and lowkey wishing this is just purging. I want this to be my HG since a lot of people say this product made their skin free from pimples and less oily.",
        "match_confidence": 0.9500000000000001,
        "skin_type": [],
        "price_size": null,
        "status": "HG (Holy Grail)",
        "availability": null
      }
    ],
    "megathread_comments": [
      {
        "comment_id": "l7o5i1r",
        "comment_author": "toorusgf",
        "comment_score": 13,
        "comment_created_utc": 1717851801.0,
        "comment": "Skin Type: Oily / Combi\nProduct Name: Cosrx Salicylic Acid Daily Gentle Cleanser\nType: Foam\nPrice/Quantity: Varies but less than ₱300 for 150ml when you get it on discount (online)!\nEffect/experience: Have been using this for around 4-5 years and this helped remove excess sebum talaga. Controlled my oil, helped with breakouts, gentle and very low % of salicylic so for everyday talaga. This is a very well known product that I assume has been tried by many, but still want to recommend it because it’s that effective. My first korean product and I still love it to this day! Disclaimer: this is more for oily/combi skin. Dry skin is not hiyang with this I think.\nStatus: HG!!!!! 🩷🩷🩷",
        "skin_type": [
          "Oily",
          "Combination"
        ],
        "price_size": "Varies but less than ₱300 for 150ml when you get it on discount (online)!",
        "effects": "Have been using this for around 4-5 years and this helped remove excess sebum talaga. Controlled my oil, helped with breakouts, gentle and very low % of salicylic so for everyday talaga. This is a very well known product that I assume has been tried by many, but still want to recommend it because it’s that effective. My first korean product and I still love it to this day! Disclaimer: this is more for oily/combi skin. Dry skin is not hiyang with this I think.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 1.0,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "l7ogmiu",
        "comment_author": "Kz_Mafuyu",
        "comment_score": 4,
        "comment_created_utc": 1717856668.0,
        "comment": "Skin Type: Oily/ Acne Prone\nProduct name: Cosrx Salicylic Acid Daily Gentle Cleanser\nOrder: Second\nType: Liquid\nPrice: 220 (small)\nEffect: Unfortunately, this did not work for me. Too drying for my face and may stinging sensation whenever I use this. Hindi lang talaga siguro ako hiyang.\nStatus: Will not repurchase",
        "skin_type": [
          "Oily",
          "Acne Prone"
        ],
        "price_size": "220 (small)",
        "effects": "Unfortunately, this did not work for me. Too drying for my face and may stinging sensation whenever I use this. Hindi lang talaga siguro ako hiyang.",
        "status": "WNR (Will Not Repurchase)",
        "availability": null,
        "match_confidence": 1.0,
        "product_type": "Cleanser"
      }
    ],
    "posts_count": 1,
    "comments_count": 2
  },
  "Pyunkang Yul Acne Facial Cleanser": {
    "product_name": "Pyunkang Yul Acne Facial Cleanser",
    "product_type": "Cleanser",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "l7s1tl2",
        "comment_author": null,
        "comment_score": 13,
        "comment_created_utc": 1717912133.0,
        "comment": "Skin Type: combination, oily and acne-prone\nProduct Name: Pyunkang Yul Acne Facial Cleanser\nOrder: First\nType: gel\nPrice/Quantity: 250 pesos/one 120 mL\nEffect/experience: I think this is my fave gentle cleanser na pasok sa budget ko. It’s not stripping and i still feel my natural oils retained after washing with it. It’s best used lalo na after oil cleansing and right before using tretinoin because safe siya sa barrier ko. I love it lol.\nStatus: WR\n———————————————\nProduct Name: PanOxyl 10% Benzoyl Peroxide Acne foaming wash\nOrder: First\nType: cream\nPrice/Quantity: 950 pesos/156 mL\nEffect/experience: My mistake buying the 10% right off the bat 💀💀. I borrowed my mom’s 10% panoxyl benzoyl p. wash before and now that I moved out i ordered my own and bought the 10% na agad figuring that i can tolerate it naman na. When it arrived, that’s when i realized na fake pala gamit ng nanay ko and damn this stings so muchhh.\nI tried applying it every other day the first few weeks and minsan parang spot treatment lang, like ibababad ko one thick layer of wash sa active pimple ko for 1-3 mins bc i felt like the rest of my face couldn’t take the whole product. It works SO FAST. Literal parang kusa na lang nagpupush out yung pus palabas as i’m washing it off. Then I slap a pimple patch pag di pa completely natanggal yung pus. Perfect combination.\nNow I use it once a day and apply it to the T-zone since dun lang naman ako tinitigyawat at pansin ko ang galing din niya magexfoliate. Even more effective than the two salicylic products i bought from Cosrx and Skintific. So now I don’t use them anymore, just this panoxyl wash na lang.\nSo yeah siguro advice ko na lang na stick to the 4% concentration if mild-mod acne lang naman and it would work just as well. Otherwise, this product is so good, it killed all my active pimples, prevented future breakouts and works as an exfoliator for me din. HG MATERIAL 👑👑👑\nStatus: HG 👑😩😩",
        "skin_type": [
          "Combination",
          "Oily",
          "Acne Prone"
        ],
        "price_size": "950 pesos/156 mL",
        "effects": "My mistake buying the 10% right off the bat 💀💀. I borrowed my mom’s 10% panoxyl benzoyl p. wash before and now that I moved out i ordered my own and bought the 10% na agad figuring that i can tolerate it naman na. When it arrived, that’s when i realized na fake pala gamit ng nanay ko and damn this stings so muchhh. I tried applying it every other day the first few weeks and minsan parang spot treatment lang, like ibababad ko one thick layer of wash sa active pimple ko for 1-3 mins bc i felt like the rest of my face couldn’t take the whole product. It works SO FAST. Literal parang kusa na lang nagpupush out yung pus palabas as i’m washing it off. Then I slap a pimple patch pag di pa completely natanggal yung pus. Perfect combination. Now I use it once a day and apply it to the T-zone since dun lang naman ako tinitigyawat at pansin ko ang galing din niya magexfoliate. Even more effective than the two salicylic products i bought from Cosrx and Skintific. So now I don’t use them anymore, just this panoxyl wash na lang. So yeah siguro advice ko na lang na stick to the 4% concentration if mild-mod acne lang naman and it would work just as well. Otherwise, this product is so good, it killed all my active pimples, prevented future breakouts and works as an exfoliator for me din. HG MATERIAL 👑👑👑",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 1.0,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "k8y3r9l",
        "comment_author": "xiaodaze",
        "comment_score": 6,
        "comment_created_utc": 1699808273.0,
        "comment": "**Skin Type:** oily, acne prone\n**Product Name:** pyunkang yul acne facial cleanser\n**Price and Size:** 301 for 120ml\n**Where to buy:** bought mine from mybeautystory during the time it was out of stock in their official store but there are stocks again\n**Effects/Experience:** it's probably the mildest cleanser i've tried so far and it's also scent-free. ig the only downside is hindi siya ganon kabula.\n**Status:** WR",
        "skin_type": [
          "Oily",
          "Acne Prone"
        ],
        "price_size": "** 301 for 120ml",
        "effects": "** it's probably the mildest cleanser i've tried so far and it's also scent-free. ig the only downside is hindi siya ganon kabula.",
        "status": "WR (Will Repurchase)",
        "availability": "** bought mine from mybeautystory during the time it was out of stock in their official store but there are stocks again",
        "match_confidence": 1.0,
        "product_type": "Cleanser"
      }
    ],
    "posts_count": 0,
    "comments_count": 2
  },
  "Cetaphil Gentle Skin Cleanser": {
    "product_name": "Cetaphil Gentle Skin Cleanser",
    "product_type": "Cleanser",
    "posts": [
      {
        "post_id": "1i048ay",
        "post_author": "Sapphirie",
        "post_score": 22,
        "post_created_utc": 1736736715.0,
        "post_title": "Review and Experience - SKIN1004, Cetaphil, Benzac, Glow Glass Beauty, and Aestura",
        "post_url": "https://reddit.com/r/beautytalkph/comments/1i048ay/review_and_experience_skin1004_cetaphil_benzac/",
        "post_selftext": "Let me preface this by saying that it took a lot to get to where I am now. I am sure many people with similar concerns have gone through a comparable journey. Finding the right products can be tiring and overwhelming at times.\n\nI come bearing good news for myself and hope to share my experience with anyone who might be facing similar struggles.\n\n**November 2024**\n\nIt was around this time that my skin kept breaking out and felt overworked. It’s already January 2025 as I write this, so it’s a bit hard to describe the feeling exactly—but I felt like my skin was being over-cleansed.\n\n**Previous Routine:**\n\n**AM**\n\n* SKIN1004 Tea-Trica BHA Foam Cleanser\n   * Great daily exfoliant but dried me out too much.\n   * Works well for my mom and daughter.\n* SKIN1004 Madagascar Centella Ampoule\n   * Feels like your skin is drinking water—absolutely love this one!\n* SKIN1004 Madagascar Centella Tea-Trica BS Cream\n   * Feels like a skin balm.\n   * The hyaluronic acid in this formula didn’t work well for me. My skin felt stuck between being moisturized and dry, as the HA kept pulling moisture from my skin instead of locking it in.\n   * I briefly used it over Aveeno Oat Gel (mentioned below) to give the HA something to draw moisture from. That worked, but feels too heavy on the skin.\n* SKIN1004 Madagascar Centella Hyalu-Cica Water-Fit Sun Serum SPF50+ PA++++\n   * A great sunscreen, but since it contains HA, I need to layer it over something hydrating without additional HA.\n\n**PM**\n\n* SKIN1004 Madagascar Centella Light Cleansing Oil\n   * Still using this for makeup removal or when I need a deeper cleanse.\n* SKIN1004 Tea-Trica BHA Foam Cleanser\n* SKIN1004 Madagascar Centella Tea-Trica Purifying Toner\n   * Still a good toner, but it no longer fits my current routine (it doesn’t contain HA).\n* SKIN1004 Madagascar Centella Ampoule\n* SKIN1004 Madagascar Centella Tea-Trica BS Cream\n\nThe SKIN1004 line worked well for me initially. However, after about a year and a half, I noticed my skin’s needs changed—likely due to aging. Here are the products I’ve used since late November and my thoughts on them:\n\n**Product Reviews & Discoveries**\n\n* Cetaphil Gentle Skin Cleanser for Sensitive Skin\n   * Great when my skin feels overworked or over-cleansed.\n   * Not so great at getting all the amount of gunk I put on my face (skincare, I don't wear makeup unless there's an occasion).\n* Cetaphil Moisturizing Lotion with Avocado Oil\n   * This is when I realized that any oil-based moisturizer breaks me out or causes cystic acne.\n* Benzac Benzoyl Peroxide Spot Treatment Gel (5%)\n   * Effective spot treatment.\n   * I apply a thick layer to the affected area and cover it with tissue to keep the ointment in place and protect the spot from sun exposure when used in the morning. The tissue also helps prevent the product from transferring to your clothes or anything.\n* Benzac Microbiome Equaliser\n   * Made my face sting and didn’t provide enough moisture. I now use it on my underarms to avoid wasting it.\n* LUXE ORGANIX Retinol + Bakuchiol Overnight Glow Gentle Treatment Cream Moisturizer\n   * Great as a beginner retinol.\n   * Started with applications every 10 days, then moved to every 7 days, and now use it twice a week.\n   * I use the sandwich method with pea-sized amounts, gradually increasing the application as my skin tolerated it.\n* Glow Glass Ceramide Moisturizer (Cera Glow Healthy Gel Cream)\n   * Previously used this brand and returned to it.\n   * Contains niacinamide, ceramides, and no hyaluronic acid—a good detox moisturizer when I wanted to simplify my routine.\n   * Feels nice but isn’t quite enough for the colder season.\n* Glow Glass AHA BHA Renewing Serum\n   * Repurchased as an exfoliant for my current routine.\n   * Feels great on initial application—didn’t dry me out.\n   * Sometimes causes small breakouts, possibly due to its concentration.\n* Aveeno Calm + Restore Oat Gel Moisturizer\n   * Bought hoping it would be more hydrating.\n   * Good moisturizer but not quite enough for Philippine cold season, LOL.\n* Cetaphil Hydrating Foaming Cream Cleanser\n   * Combines gentleness and cleansing power perfectly—my daily cleanser now.\n   * I alternate with Cetaphil Gentle Skin Cleanser on sensitive days.\n* Aestura AtoBarrier 365 Cream\n   * Holy Grail moisturizer!\n   * A little goes a long way—just a small amount covers my entire face and neck.\n   * Provides amazing hydration and has helped repair my skin barrier. Maybe due to using it in tandem with the SKIN1004 Ampoule too.\n   * I ordered the lighter version (AtoBarrier 365 Lotion) for warmer months and will update after testing.\n\n**Current Routine (Finally Balanced!)**\n\nMy routine alternates between exfoliation, retinol, and moisturizing:\n\n**AM (Daily)**\n\n* Cetaphil Hydrating Foaming Cream Cleanser\n* SKIN1004 Madagascar Centella Ampoule\n* Aestura AtoBarrier 365 Cream\n* SKIN1004 Madagascar Centella Hyalu-Cica Water-Fit Sun Serum SPF50+ PA++++\n\n**PM (Exfoliate)**\n\n* Cetaphil Hydrating Foaming Cream Cleanser\n* SKIN1004 Madagascar Centella Ampoule\n* Glow Glass AHA BHA Renewing Serum\n* Aestura AtoBarrier 365 Cream\n\n**PM (Retinol)**\n\n* Cetaphil Hydrating Foaming Cream Cleanser\n* Glow Glass Ceramide Moisturizer\n* LUXE ORGANIX Retinol + Bakuchiol Overnight Glow Treatment\n* Aestura AtoBarrier 365 Cream\n\n**PM (Moisturize)**\n\n* Cetaphil Hydrating Foaming Cream Cleanser\n* SKIN1004 Madagascar Centella Ampoule\n* Aestura AtoBarrier 365 Cream\n\nOnce I’m confident in this routine, I plan to add Vitamin C after the SKIN1004 Madagascar Centella Ampoule in the mornings.",
        "match_confidence": 0.85,
        "skin_type": [],
        "price_size": null,
        "status": "HG (Holy Grail)",
        "availability": null
      }
    ],
    "megathread_comments": [
      {
        "comment_id": "l7obmt9",
        "comment_author": "smpllivingthrowaway",
        "comment_score": 3,
        "comment_created_utc": 1717854582.0,
        "comment": "Skin Type: oily combo sa pinas. Dry combo colder climates. No acne / clear skin, occasional pimples lang once in a blue moon.\nProduct Name: Cetaphil Gentle Skin cleanser (blue cap)\nOrder: Second if I use an oil cleanser. OK sya as only cleanser if you don't wear makeup.\nType: liquid\nPrice/Quantity: smallest is around 300 for 118mls, or around 500 for 250 mls.\nEffect/experience: i used to only use Cerave but it's hard to source. Found Cetaphil and it suits me just fine plus it's way cheaper. This cleanser is mild and inoffensive. Perfect especially if like me you use actives in other parts of your routine (vit c, acids, retinol). This doesn't overwhelm my skin, not drying.\nStatus: WR, HG",
        "skin_type": [
          "Dry",
          "Oily",
          "Acne Prone"
        ],
        "price_size": "smallest is around 300 for 118mls, or around 500 for 250 mls.",
        "effects": "i used to only use Cerave but it's hard to source. Found Cetaphil and it suits me just fine plus it's way cheaper. This cleanser is mild and inoffensive. Perfect especially if like me you use actives in other parts of your routine (vit c, acids, retinol). This doesn't overwhelm my skin, not drying.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.8656716417910447,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "l7ohlcw",
        "comment_author": "Kz_Mafuyu",
        "comment_score": 3,
        "comment_created_utc": 1717857059.0,
        "comment": "Skin Type: Oily/ Acne Prone\nProduct name: Cetaphil Gentle Skin Cleanser\nOrder: Second\nType: Liquid\nPrice: 170 (60 ml)\nEffect: Super mild on face and hindi nakaka-trigger ng acne. Medyo pricey lang pero worth it.\nStatus: HG",
        "skin_type": [
          "Oily",
          "Acne Prone"
        ],
        "price_size": "Super mild on face and hindi nakaka-trigger ng acne. Medyo pricey lang pero worth it.",
        "effects": null,
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 1.0,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "l7omiho",
        "comment_author": "sullenaya1",
        "comment_score": 3,
        "comment_created_utc": 1717859019.0,
        "comment": "Skin Type: Normal skin\nProduct name: Cetaphil Gentle Skin Cleanser\nOrder: Third\nType: Liquid\nPrice: 500+ (250 ml)\nEffect: Soft ang feeling sa skin at di nakaka dry. Bihira lang ako magka acne so di ko alam if okay pa rin to gamitin.\nStatus: HG, WR",
        "skin_type": [
          "Normal"
        ],
        "price_size": "500+ (250 ml)",
        "effects": "Soft ang feeling sa skin at di nakaka dry. Bihira lang ako magka acne so di ko alam if okay pa rin to gamitin.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 1.0,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "k8wfktp",
        "comment_author": "kikayisthename",
        "comment_score": 3,
        "comment_created_utc": 1699772634.0,
        "comment": "skin type: sensitive & dry\nproduct name: cetaphil gentle cleanser\nprice and size: ₱1, 700 ata yung 1L, idk kung magkano kasi pinapadalhan lang ako ng sister ko from Canada\nwhere to buy: watsons, supermarkets\neffects and experience: I've been using cetaphil since 2019 and I could say na eto talaga holy grail ko kasi ang lala ng pimps ko before like meron sa pisngi ganon pero dahil sa cetaphil kahit papano di na ko nagkakaron masyado ng pimps, siguro pag before, during or after na ng mens ko ako nagkakapimps tas paisa isa na lang. Yung boyfriend ko rin cetaphil na rin gamit nya, ganon din umokay din yung mukha nya hehe\nstatus: HG & WR 💯",
        "skin_type": [
          "Dry",
          "Sensitive"
        ],
        "price_size": "₱1, 700 ata yung 1L, idk kung magkano kasi pinapadalhan lang ako ng sister ko from Canada",
        "effects": "I've been using cetaphil since 2019 and I could say na eto talaga holy grail ko kasi ang lala ng pimps ko before like meron sa pisngi ganon pero dahil sa cetaphil kahit papano di na ko nagkakaron masyado ng pimps, siguro pag before, during or after na ng mens ko ako nagkakapimps tas paisa isa na lang. Yung boyfriend ko rin cetaphil na rin gamit nya, ganon din umokay din yung mukha nya hehe",
        "status": "HG (Holy Grail)",
        "availability": "watsons, supermarkets",
        "match_confidence": 0.9056603773584906,
        "product_type": "Cleanser"
      }
    ],
    "posts_count": 1,
    "comments_count": 4
  },
  "Luxe Organix's Aqua Lock hydrogel cleanser": {
    "product_name": "Luxe Organix's Aqua Lock hydrogel cleanser",
    "product_type": "Cleanser",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "lenxmpo",
        "comment_author": "Acceptable_Winner628",
        "comment_score": 2,
        "comment_created_utc": 1721798265.0,
        "comment": "Skintype: combination\nProduct name: Luxe Organix's Aqua Lock hydrogel cleanser\nOrder: 1st\nType: Gel\nPrice: 122php for 20mL (repackaged yung naorder ko cause it seems to be discontinued. details below)\nEffect: just a bit of context. i tried to search up on youtube some anti-aging regimen recommendations and ito yung narecommend ni Jan Angelo from YT. so far I've used a 20mL variant and it's been great. It's gentle on the skin and has a nice soothing effect. very relaxing and its reminiscent of the milk cleanser from DermaBlend i used to use.\nStatus: WR\nps.\nmuch appreciated if anyone can chime in for alternative recommendations cause this product seems obscure nowadays (in 2024). with same anti aging properties, gel-type, low pH and has NO sodium lauryl sulfate)",
        "skin_type": [],
        "price_size": "122php for 20mL (repackaged yung naorder ko cause it seems to be discontinued. details below)",
        "effects": "just a bit of context. i tried to search up on youtube some anti-aging regimen recommendations and ito yung narecommend ni Jan Angelo from YT. so far I've used a 20mL variant and it's been great. It's gentle on the skin and has a nice soothing effect. very relaxing and its reminiscent of the milk cleanser from DermaBlend i used to use.",
        "status": "WR (Will Repurchase)",
        "availability": null,
        "match_confidence": 1.0,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "lentdzd",
        "comment_author": "Acceptable_Winner628",
        "comment_score": 1,
        "comment_created_utc": 1721795987.0,
        "comment": "Skintype: combination\nProduct name: Luxe Organix's Aqua Lock hydrogel cleanser\nOrder: 1st\nType: Gel\nPrice: 122php for 20mL (repackaged yung naorder ko cause it seems to be discontinued. details below)\nEffect: just a bit of context. i tried to search up on youtube some anti-aging regimen recommendations and ito yung narecommend ni Jan Angelo from YT. so far I've used a 20mL variant and it's been great. It's gentle on the skin and has a nice soothing effect. very relaxing and its reminiscent of the milk cleanser from DermaBlend i used to use.\nStatus: WR\nps.\nAnyone here who uses this product?\nI was scouring the internet and even tried to post here sa sub and ask for its whereabouts cause it seems to be obscure nowadays. looking for alternative recommendations (anti aging properties and same specs as it na gel-type, low pH and has NO sodium lauryl sulfate)\nTIA",
        "skin_type": [],
        "price_size": "122php for 20mL (repackaged yung naorder ko cause it seems to be discontinued. details below)",
        "effects": "just a bit of context. i tried to search up on youtube some anti-aging regimen recommendations and ito yung narecommend ni Jan Angelo from YT. so far I've used a 20mL variant and it's been great. It's gentle on the skin and has a nice soothing effect. very relaxing and its reminiscent of the milk cleanser from DermaBlend i used to use.",
        "status": "WR (Will Repurchase)",
        "availability": null,
        "match_confidence": 1.0,
        "product_type": "Cleanser"
      }
    ],
    "posts_count": 0,
    "comments_count": 2
  },
  "Cerave Hydrating Cream-to-Foam Cleanser": {
    "product_name": "Cerave Hydrating Cream-to-Foam Cleanser",
    "product_type": "Cleanser",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "k8v3za7",
        "comment_author": "Impossible_Ad421",
        "comment_score": 9,
        "comment_created_utc": 1699748654.0,
        "comment": "Skin Type: Normal/Dry Combination\nProduct Name: Cerave Hydrating Cream-to-Foam Cleanser\nPrice and Size: Available in different sizes but I prefer buying the biggest size which is 19floz kasi madami kami gumagamit sa house.\nWhere to buy: Nagpapasabuy lang me sa family sa US. Pero madami naman legit na resellers sa Shopee.\nEffects/Experience: Hydrating and hindi drying sa face. Not sure if it removes makeup since I always double cleanse if I’m wearing makeup or anything with spf. Everyone in the house uses this cleanser kahit yung tita ko na oily/combination skin at yung tita ko na may rosacea. And it works for them, too.\nStatus: HG!!! ❤️ 3 years ko na tong ginagamit. I can’t imagine using another cleanser.",
        "skin_type": [
          "Normal",
          "Dry",
          "Combination"
        ],
        "price_size": "Available in different sizes but I prefer buying the biggest size which is 19floz kasi madami kami gumagamit sa house.",
        "effects": "Hydrating and hindi drying sa face. Not sure if it removes makeup since I always double cleanse if I’m wearing makeup or anything with spf. Everyone in the house uses this cleanser kahit yung tita ko na oily/combination skin at yung tita ko na may rosacea. And it works for them, too.",
        "status": "HG (Holy Grail)",
        "availability": "Nagpapasabuy lang me sa family sa US. Pero madami naman legit na resellers sa Shopee.",
        "match_confidence": 1.0,
        "product_type": "Cleanser"
      }
    ],
    "posts_count": 0,
    "comments_count": 1
  },
  "COSRX Low pH Good Morning Gel Cleanser": {
    "product_name": "COSRX Low pH Good Morning Gel Cleanser",
    "product_type": "Cleanser",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "k8sjhm9",
        "comment_author": "Hot_Foundation_448",
        "comment_score": 10,
        "comment_created_utc": 1699715771.0,
        "comment": "Skin Type: combination, oily. Sensitive, prone to acne breakouts pag hindi hiyang\nProduct Name: CosRX Low ph Good Morning Cleanser\nPrice and Size: 150ml, 284\nWhere to buy: shopee/lazada. I buy mine from Some More KBeauty store\nEffects/Experience: doesnt feel like it’s stripping my face with oil and it doesnt make my skin feel taut after. Just enough na i feel it’s clean\nStatus: HG / WR. This is my 2nd tube already and i’m either getting this one or if i find my favorite favorite facial wash from Face Republic. Baka kasi phased out na sya",
        "skin_type": [
          "Combination",
          "Oily",
          "Sensitive",
          "Acne Prone"
        ],
        "price_size": "150ml, 284",
        "effects": "doesnt feel like it’s stripping my face with oil and it doesnt make my skin feel taut after. Just enough na i feel it’s clean",
        "status": "HG (Holy Grail)",
        "availability": "shopee/lazada. I buy mine from Some More KBeauty store",
        "match_confidence": 0.9444444444444444,
        "product_type": "Cleanser"
      }
    ],
    "posts_count": 0,
    "comments_count": 1
  },
  "Belo Dewy Essence Sunscreen": {
    "product_name": "Belo Dewy Essence Sunscreen",
    "product_type": "Sunscreen",
    "posts": [
      {
        "post_id": "1g28qyp",
        "post_author": "nabannugen",
        "post_score": 5,
        "post_created_utc": 1728763949.0,
        "post_title": "Belo SunExpert Sunspritz and Belo SunExpert Transparent Mist have denatured ethyl alcohol as main ingredient that causes skin dehydration and damage",
        "post_url": "https://reddit.com/r/beautytalkph/comments/1g28qyp/belo_sunexpert_sunspritz_and_belo_sunexpert/",
        "post_selftext": "I learned from my mistake of not checking the ingredients before buying and using the mentioned products. I am sharing this so u may learn as well, without committing the same mistake 🫶🏽\n[Long post ahead]\n\nI was looking for a spray-on sunscreens for face and body bec i was thinking na it may be more hygienic and convenient to use vs the cream ones that i have to apply by hand esp when I'm outdoors.\n\nHiyang ako sa Belo Dewy Essence sunscreen kaya i thought their spray-on sunscreens would also be good for me so i bought and tried it.\n\nI decided to use the sunspritz first and reserve the Transparent Mist for when the first would be finished. When i used the sunspritz, it has a plastic-y smell, was oily, may stingy feeling sa mukha that i thought might just be the cooling menthol effect i read in one review in a blog, at medyo may hapdi sa mata kahit nakapikit naman ako pag-spray. Inulit kong gamitin with more awareness sa effects nya, thinking that the effects i felt before were just because my skin is just not yet used to the product. Pagka-spray ko, ganon pa rin yung experience like the first time; it made me nervous pa to inhale after spraying kasi medyo may tapang yung amoy.\n\nNapa-isip na ako kung itutuloy ko pa bang gamitin yung sunspritz. It was just then that i looked at the ingredients and compared it to the Dewy Essence to see why it has different effects on my skin (see pics 2 & 3). (The ingredients are listed on the product packagings but i attached ss from belo and watsons sites for clearer images)\n\n DENATURED ETHYL ALCOHOL is listed as the main ingredient in the Sunspritz, but it is not included in the Dewy Essence, plus i generally know that alcohol is not good for the face so i researched some more abt it and its effects (see pics 4-8).\n\nAlarmed abt these findings, i checked the ingredients for the Transparent Mist and found denat ethyl alc as its main ingredient as well! (See pic 9). I also found a tiktok vid abt this product and read the comments that say same things as what i experienced with the Sunspritz: https://vt.tiktok.com/ZS2TEGfuE/\n\nIt is trust-breaking and concerning to find that the products made and advertised by an established beauty line as ones that would \"[deliver] instant freshness and hydration...\" is using an unsafe alcohol that gives off the \"cooling menthol-ly effect\" and is just too oily to cover up the reality that it is dehydrating your skin.\n\nAgain, I already learned from my mistake of not checking the ingredients before buying and using the mentioned products. I hope my fellow beauty-product-users will take this as a lesson to check the product's ingredients first before purchasing.\n\nFor more info abt other facial products that contain denat ethyl alcohol, you may want to chech this out:\nhttps://incidecoder.com/ingredients/alcohol-denat#details\n\nThat's all. Love lots 🩷",
        "match_confidence": 0.85,
        "skin_type": [],
        "price_size": null,
        "status": null,
        "availability": "Watsons"
      }
    ],
    "megathread_comments": [
      {
        "comment_id": "j9s46wy",
        "comment_author": "alienbanana0902",
        "comment_score": 16,
        "comment_created_utc": 1677211059.0,
        "comment": "SKIN TYPE: Normal (But sweats quickly)\nPRODUCT NAME: Belo Dewy Essence Sunscreen\nPRICE AND SIZE: ₱400/ 50ml *[they also sell a 10ml version for ₱100 in their online stores]\nEFFECTS AND EXPERIENCE: I was trying to find this item for a while as it became viral online at some point. I got lucky spotting one in SM’s beauty section and bought it right away. Super lightweight and it absorbs into the skin quickly. Definitely is a dewy finish on me, but you can powder it down if you don’t want the dewy effect. No white cast, and if doesn’t sting your eyes even when you sweat a lot like I do. Reapplies nicely as well, suits our weather perfectly and is a great option for a beach trip sunscreen (Brought this to a 4D3N trip to LU). For its price, it’s one of the best local ones you can try!\nSTATUS: HG ❤️",
        "skin_type": [
          "Normal"
        ],
        "price_size": "I was trying to find this item for a while as it became viral online at some point. I got lucky spotting one in SM’s beauty section and bought it right away. Super lightweight and it absorbs into the skin quickly. Definitely is a dewy finish on me, but you can powder it down if you don’t want the dewy effect. No white cast, and if doesn’t sting your eyes even when you sweat a lot like I do. Reapplies nicely as well, suits our weather perfectly and is a great option for a beach trip sunscreen (Brought this to a 4D3N trip to LU). For its price, it’s one of the best local ones you can try!",
        "effects": null,
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 1.0,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "kvq0dlz",
        "comment_author": "Rationaly_tea",
        "comment_score": 24,
        "comment_created_utc": 1710937340.0,
        "comment": "Skin Type: normal to dry\nProduct Name: belo dewy essence sunscreen\nPrice and Size: ₱450 for 50ml of product (NOTE: since belo always offer b1t1, you can get 2 50ml bottles of sunscreen for ₱450)\nEffects/Experience: Highly moisturizing and zero white cast. I never felt the need to add in extra moisturizer and it is also great under make up.\nStatus: HG",
        "skin_type": [
          "Normal",
          "Dry"
        ],
        "price_size": "₱450 for 50ml of product (NOTE: since belo always offer b1t1, you can get 2 50ml bottles of sunscreen for ₱450)",
        "effects": "Highly moisturizing and zero white cast. I never felt the need to add in extra moisturizer and it is also great under make up.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 1.0,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrvq3ze",
        "comment_author": "kyliefever2002",
        "comment_score": 11,
        "comment_created_utc": 1747037826.0,
        "comment": "Skin Type : Combo skin, oily around nose\nProduct name: Belo Dewy Essence Sunscreen\nPrice: 500php for Buy1Take1\nExp:\nHaven't tried that many sunscreens in my life but this is my HG!!! No white cast, very smooth finish and super dewy looking. Lays amazing under makeup, there are times where I've skipped moisturizer before makeup and just used this. I prefer this one more over the regular whitening Belo sunscreen, that one is thicker, this one is thinner and truly makes ur skin look naturally dewy\nStatus: HG",
        "skin_type": [
          "Oily"
        ],
        "price_size": "500php for Buy1Take1",
        "effects": "Haven't tried that many sunscreens in my life but this is my HG!!! No white cast, very smooth finish and super dewy looking. Lays amazing under makeup, there are times where I've skipped moisturizer before makeup and just used this. I prefer this one more over the regular whitening Belo sunscreen, that one is thicker, this one is thinner and truly makes ur skin look naturally dewy",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 1.0,
        "product_type": "Sunscreen"
      }
    ],
    "posts_count": 1,
    "comments_count": 3
  },
  "Beauty of Joseon Relief Sun Sunscreen: Rice + Probiotics": {
    "product_name": "Beauty of Joseon Relief Sun Sunscreen: Rice + Probiotics",
    "product_type": "Sunscreen",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "j9rotfd",
        "comment_author": "ivanilla16",
        "comment_score": 8,
        "comment_created_utc": 1677203990.0,
        "comment": "**Skin Type:** Normal to oily (esp in t-zone), acne-prone\n**Product Name:** Beauty of Joseon Relief Sun: Rice + Probiotics\n**Price and Size**: 551 peso for 50 mL as of writing at Lazada under kbeautycafe\n**Effects/Experience:** I used Missha sunscreen pink cap for years already but now that I somehow controlled my oil production, I looked for a sunscreen that doesn't have that powdery finish or super matte. And this sunscreen is perfect for that. I've been using it for 3 weeks already and I can say that I would repurchase this forever. It sinks in beautifully into my skin. Very lightweight. It is quite moisturizing and I feel like oily peeps can use this in lieu of their moisturizer. It doesn't pill. Doesn't sting my eyes. There's a little bit of white cast for like a minute or so then disappears.\n**Status:** Prolly HG and WR.",
        "skin_type": [
          "Normal",
          "Oily",
          "Acne Prone"
        ],
        "price_size": "551 peso for 50 mL as of writing at Lazada under kbeautycafe",
        "effects": "** I used Missha sunscreen pink cap for years already but now that I somehow controlled my oil production, I looked for a sunscreen that doesn't have that powdery finish or super matte. And this sunscreen is perfect for that. I've been using it for 3 weeks already and I can say that I would repurchase this forever. It sinks in beautifully into my skin. Very lightweight. It is quite moisturizing and I feel like oily peeps can use this in lieu of their moisturizer. It doesn't pill. Doesn't sting my eyes. There's a little bit of white cast for like a minute or so then disappears.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.8888888888888888,
        "product_type": "Sunscreen"
      }
    ],
    "posts_count": 0,
    "comments_count": 1
  },
  "Anessa Perfect UV Sunscreen Skin Care Milk": {
    "product_name": "Anessa Perfect UV Sunscreen Skin Care Milk",
    "product_type": "Sunscreen",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "j9smghp",
        "comment_author": "thatonesaddude",
        "comment_score": 1,
        "comment_created_utc": 1677221951.0,
        "comment": "Skin Type: Normal/Oily (but very sweaty)\nProduct Name: Anessa Perfect UV Sunscreen Skincare Gel\nPrice and size: \\~1400PHP for 90g\nEffects/Experience: No white cast on moreno skin, kind of dewy finish but not super glowy. Reapplies okay, but the scent (while not strong and not unpleasant but def smells perfumey) isn't one I like smelling first thing in the morning. Kinda stings my eyes if it migrates into my eye but nothing crazy. Kinda expensive but it's a good sunscreen.\nStatus: Would repurchase (with reservations lol)",
        "skin_type": [
          "Normal",
          "Oily"
        ],
        "price_size": "\\~1400PHP for 90g",
        "effects": "No white cast on moreno skin, kind of dewy finish but not super glowy. Reapplies okay, but the scent (while not strong and not unpleasant but def smells perfumey) isn't one I like smelling first thing in the morning. Kinda stings my eyes if it migrates into my eye but nothing crazy. Kinda expensive but it's a good sunscreen.",
        "status": null,
        "availability": null,
        "match_confidence": 0.926829268292683,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "kvn58bh",
        "comment_author": "fritterest",
        "comment_score": 5,
        "comment_created_utc": 1710884761.0,
        "comment": "Skin Type: Oily\nProduct Name: ANESSA Perfect UV Sunscreen Skincare Gel\nPrice and Size: P1490 in Shopee 90g (I bought this much cheaper in yen)\nEffects/Experience: It has been my fave sunscreen so far! There’s no whitecast and it acts as a makeup primer. My skin instantly brigtens up whenever I put this, so I can just use this and wear lipstick if I go somewhere where I don’t need to use full make-up. Bought this last October and have yet to finish it.\nI love that there’s no sticky feeling unlike Biore, and I can layer it up when I know I’ll go somewhere with prolonged sun exposure. Also tried applying it over makeup, so long as I tap it unto my skin there’s no trace of reapplication.\nI’ve tried the UV milk and I like them both, but the Gel one just sits better on my oily skin imo. I also love that there’s a smaller sized pack, so I just refill the bottle when I’m traveling.\nBtw I’m using the old formula.\nStatus: Fave! It’s in the top with La Roche Posay in terms of formulation, but this one has better and more sustainable packaging so this wins. Yung tip ng LRP got easily damaged in my experience unfortunately.",
        "skin_type": [
          "Oily"
        ],
        "price_size": "P1490 in Shopee 90g (I bought this much cheaper in yen)",
        "effects": "Fave! It’s in the top with La Roche Posay in terms of formulation, but this one has better and more sustainable packaging so this wins. Yung tip ng LRP got easily damaged in my experience unfortunately.",
        "status": null,
        "availability": null,
        "match_confidence": 0.926829268292683,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrw34z0",
        "comment_author": "princesselphie28",
        "comment_score": 4,
        "comment_created_utc": 1747045999.0,
        "comment": "Skin Type: Dry\nProduct Name: Anessa Perfect UV Sunscreen Skin Care Milk SPF 50+\nPrice and Size: 1,407.04\nEffects and Experience: easy to apply, no white cast, not sticky, and no heavy feeling on the skin. Goes well with my moisturizer and cushion. I don't need to reapply during the day. Very wearable during the summer.\nStatus: HG, will definitely repurchase again and again and again😅",
        "skin_type": [
          "Dry"
        ],
        "price_size": "1,407.04",
        "effects": "easy to apply, no white cast, not sticky, and no heavy feeling on the skin. Goes well with my moisturizer and cushion. I don't need to reapply during the day. Very wearable during the summer.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.9230769230769231,
        "product_type": "Sunscreen"
      }
    ],
    "posts_count": 0,
    "comments_count": 3
  },
  "Biore UV Aqua Rich Watery Essence Sunscreen": {
    "product_name": "Biore UV Aqua Rich Watery Essence Sunscreen",
    "product_type": "Sunscreen",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "mrxmznv",
        "comment_author": "Constant_Shock6791",
        "comment_score": 19,
        "comment_created_utc": 1747066145.0,
        "comment": "Skin type: Normal to Oily\nProduct Name: Biore UV Aqua Rich Watery Essence\nPrice and Size: Php 483/70g\nEffects/Experience: Hydrating but not sticky and oily. Works well with my makeup, di nakakatunaw. I've tried many sunscreens kapalitan niyan throughout the years pero diyan talaga ko nabalik. No white cast din siya so di awkward tignan.\nStatus: HG ever since I tried it nung 2018!",
        "skin_type": [
          "Normal",
          "Oily"
        ],
        "price_size": "Php 483/70g",
        "effects": "Hydrating but not sticky and oily. Works well with my makeup, di nakakatunaw. I've tried many sunscreens kapalitan niyan throughout the years pero diyan talaga ko nabalik. No white cast din siya so di awkward tignan.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.868421052631579,
        "product_type": "Sunscreen"
      }
    ],
    "posts_count": 0,
    "comments_count": 1
  },
  "Skin Aqua UV Super Moisture Gel Gold Sunscreen": {
    "product_name": "Skin Aqua UV Super Moisture Gel Gold Sunscreen",
    "product_type": "Sunscreen",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "mrw2kt6",
        "comment_author": "somecityhermit",
        "comment_score": 7,
        "comment_created_utc": 1747045688.0,
        "comment": "Skin Type: Dry\nProduct Name: Skin Aqua Uv Super Moisture Gel Gold\nPrice and Size: Php 650 110g\nEffects and Experience: Creamy and watery. Easily blends under my makeup. I didn't get any outbreak when I use this. No whitecast but slightly greasy\nStatus: WR",
        "skin_type": [
          "Dry"
        ],
        "price_size": "Php 650 110g",
        "effects": "Creamy and watery. Easily blends under my makeup. I didn't get any outbreak when I use this. No whitecast but slightly greasy",
        "status": "WR (Will Repurchase)",
        "availability": null,
        "match_confidence": 0.8780487804878049,
        "product_type": "Sunscreen"
      }
    ],
    "posts_count": 0,
    "comments_count": 1
  },
  "Nivea Derma Skin Clear Deep Pore Cleanser": {
    "product_name": "Nivea Derma Skin Clear Deep Pore Cleanser",
    "product_type": "Cleanser",
    "posts": [
      {
        "post_id": "1j8tuxe",
        "post_author": "Brief-Bee-7315",
        "post_score": 244,
        "post_created_utc": 1741708032.0,
        "post_title": "Nivea Derma Skin Clear Deep Pore Cleanser - Removed my small cheek bumps that seemed like fungal acne",
        "post_url": "https://reddit.com/r/beautytalkph/comments/1j8tuxe/nivea_derma_skin_clear_deep_pore_cleanser_removed/",
        "post_selftext": "I have been using this for a month now. I have combination skin and my cheeks particularly have very small bumps that the facialist said were whiteheads. Every time i get a facial, it gets removed. However, it just comes back. After a month of using this, my cheek bumps are gone. \n\n(I used to use celeteque only)\n\nDefinitely try this!",
        "match_confidence": 0.9,
        "skin_type": [
          "Combination"
        ],
        "price_size": null,
        "status": null,
        "availability": null
      }
    ],
    "megathread_comments": [],
    "posts_count": 1,
    "comments_count": 0
  }
}