{
  "Cetaphil Gentle Skin Cleanser": {
    "product_name": "Cetaphil Gentle Skin Cleanser",
    "product_type": "Cleanser",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "l7nsy7v",
        "comment_author": "dear_llyyy",
        "comment_score": 11,
        "comment_created_utc": 1717844994.0,
        "comment": "Skin Type: Combination\nProduct Name: ✨Neutrogena Gentle Foaming Cleanser ✨\nPrice: P299 / 100ml\nExperience: This product has really made a difference for me. It has significantly improved my breakouts and has also helped to fade my pimple marks.\nI've been using this product for 5 years now and will never switch brands again. 🔛🔝\nStatus: HG!!!!",
        "skin_type": [
          "Combination"
        ],
        "price_size": "P299 / 100ml",
        "effects": "This product has really made a difference for me. It has significantly improved my breakouts and has also helped to fade my pimple marks. I've been using this product for 5 years now and will never switch brands again. 🔛🔝",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.6666666666666666,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "l7oombn",
        "comment_author": "telejubbies",
        "comment_score": 7,
        "comment_created_utc": 1717859838.0,
        "comment": "Skin Type: Oily and Sensitive (Acne-Prone)\nProduct Name: Cetaphil Cleanser\nI usually use it after cleaning with Micellar Water\nType: Liquid\nPrice: 990 for 591 ML (I always buy sa S&R kapag B1T1 sila so parang 445 each)\nEffect: Dito lang ako nahiyang kasi walang hapdi. Before I use The Face Shop B1T1 cleanser pero mas nahiyang talaga ako kay Cetaphil. Nag-ooil pa rin naman face ko pero hindi dugyot tignan. Plus hindi na ako nagbbreakout.\nStatus: HG",
        "skin_type": [
          "Oily",
          "Acne Prone",
          "Sensitive"
        ],
        "price_size": "990 for 591 ML (I always buy sa S&R kapag B1T1 sila so parang 445 each)",
        "effects": "Dito lang ako nahiyang kasi walang hapdi. Before I use The Face Shop B1T1 cleanser pero mas nahiyang talaga ako kay Cetaphil. Nag-ooil pa rin naman face ko pero hindi dugyot tignan. Plus hindi na ako nagbbreakout.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.7391304347826086,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "l7x3l7o",
        "comment_author": "minianing",
        "comment_score": 3,
        "comment_created_utc": 1717994286.0,
        "comment": "Skin Type: Combination / Oily and Sensitive (Acne-Prone)\nProduct Name: Cetaphil Cleanser\nType: Gel type\nPrice: 300+ for 118 ml\nEffect: Tried this kasi nag dry yung skin ko. Ever since ginamit ko to, nabawasan din yung pimples ko and little bumps sa buong mukha ko. I also noticed na lumambot din yung balat ko sa mukha.\nEvery morning ko lang to ginagamit kasi nag a-acne soap ako sa gabi\nStatus: HG ✨",
        "skin_type": [
          "Combination",
          "Oily",
          "Acne Prone",
          "Sensitive"
        ],
        "price_size": "300+ for 118 ml",
        "effects": "Tried this kasi nag dry yung skin ko. Ever since ginamit ko to, nabawasan din yung pimples ko and little bumps sa buong mukha ko. I also noticed na lumambot din yung balat ko sa mukha. Every morning ko lang to ginagamit kasi nag a-acne soap ako sa gabi",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.7391304347826086,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "k8s5d05",
        "comment_author": "meganeai",
        "comment_score": 14,
        "comment_created_utc": 1699709485.0,
        "comment": "Skin type: Oily, sensitive\nProduct name: Vanicream Gentle Facial Cleanser\nPrice and size: 237ml, $8.05 (roughly ₱480+ lang but expect high markup from resellers)\nWhere to buy: Amazon, Lazada & Shopee (resellers)\nEffects/experience: Ever since I started incorporating Tretinoin into my routine, this has been the only cleanser that doesn’t irritate my face. Most cleanser would sting me now, but this doesn’t. Very gentle, and non-stripping/drying. One bottle would last me at least 1.5 months since kaunti lang naman ako gumamit ng cleanser. This was also the first thing I bought when I went to the US a few months ago. I’m glad that Amazon is now directly shipping to PH, because I will surely buy and stock up on this again.\nStatus: HG, WRP until I d!e.",
        "skin_type": [
          "Oily",
          "Sensitive"
        ],
        "price_size": "237ml, $8.05 (roughly ₱480+ lang but expect high markup from resellers)",
        "effects": "Ever since I started incorporating Tretinoin into my routine, this has been the only cleanser that doesn’t irritate my face. Most cleanser would sting me now, but this doesn’t. Very gentle, and non-stripping/drying. One bottle would last me at least 1.5 months since kaunti lang naman ako gumamit ng cleanser. This was also the first thing I bought when I went to the US a few months ago. I’m glad that Amazon is now directly shipping to PH, because I will surely buy and stock up on this again.",
        "status": "HG (Holy Grail)",
        "availability": "Amazon, Lazada & Shopee (resellers)",
        "match_confidence": 0.6557377049180327,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "k8w51wa",
        "comment_author": "eseerine",
        "comment_score": 5,
        "comment_created_utc": 1699765852.0,
        "comment": "Skin Type: Sensitive\nProduct Name: Cetaphil Gentle Skin Cleanser (Not the Acne Prone one)\nPrice and Size: Around P500+ (I get it for P499 at a nearby Watsons, but some some stores I see have higher prices) for 250mL\nWhere to buy: Watsons/Deparment Stores/Online\nEffects/Experiences: I've tried a handful of facial cleansers that were sort of effective but not as effective as this cleanser. Grabe pagkasensitive ng skin ko kaya masyadong matapang most ng cleansers kaya, even if they do clean my face, my skin still gets irritated. Some are gentle enough na di magwawala skin ko pero parang feeling niya na wala namang effect. Cetaphil's is gentle enough that it doesn't irritate my skin but still gets the job done.\nStatus: HG",
        "skin_type": [
          "Sensitive"
        ],
        "price_size": "Around P500+ (I get it for P499 at a nearby Watsons, but some some stores I see have higher prices) for 250mL",
        "effects": "I've tried a handful of facial cleansers that were sort of effective but not as effective as this cleanser. Grabe pagkasensitive ng skin ko kaya masyadong matapang most ng cleansers kaya, even if they do clean my face, my skin still gets irritated. Some are gentle enough na di magwawala skin ko pero parang feeling niya na wala namang effect. Cetaphil's is gentle enough that it doesn't irritate my skin but still gets the job done.",
        "status": "HG (Holy Grail)",
        "availability": "Watsons/Deparment Stores/Online",
        "match_confidence": 0.8,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "k8s97b2",
        "comment_author": "MoonPowerTiare",
        "comment_score": 12,
        "comment_created_utc": 1699711341.0,
        "comment": "Skin type: Sensitive / combination\nProduct name: Hyalure Soap Free Skin Cleanser\nPrice & size: P264 / 250 mL\nWhere to buy: Hyalure_dermtech on Shopee\nEffects / experience: Skill feels hydrated and moisturized after use. It doesn’t cause tight or stinging sensation. It doesn’t cause breakouts and is mild enough for my sensitive skin.\nStatus: HG",
        "skin_type": [
          "Sensitive",
          "Combination"
        ],
        "price_size": "P264 / 250 mL",
        "effects": "Skill feels hydrated and moisturized after use. It doesn’t cause tight or stinging sensation. It doesn’t cause breakouts and is mild enough for my sensitive skin.",
        "status": "HG (Holy Grail)",
        "availability": "Hyalure_dermtech on Shopee",
        "match_confidence": 0.6666666666666666,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "k8s94nv",
        "comment_author": "Frosty_Interest_6740",
        "comment_score": 3,
        "comment_created_utc": 1699711306.0,
        "comment": "Skin type: Oily\nProduct name: Cetaphil\nPrice and size: 500ml for the big bottle and about P1,200\nWhere to buy: Watsons or any grocery store\nExperience: Due to my oily acne prone skin, I used to use super harsh cleansers like kojic acid, salicylic acid wash, etc. It worked when I was in college, now parang sensitive na ang skin ko so it needs a cleanser na walang active ingredients. So I switched over to cetaphil and it decreased all my pimples! Still a bit oily but it’s no problem. I double cleanse din and do my skincare.\nStatus: I don’t think it’s my HG but WR since it’s readily available anywhere.",
        "skin_type": [
          "Oily"
        ],
        "price_size": "500ml for the big bottle and about P1,200",
        "effects": "Due to my oily acne prone skin, I used to use super harsh cleansers like kojic acid, salicylic acid wash, etc. It worked when I was in college, now parang sensitive na ang skin ko so it needs a cleanser na walang active ingredients. So I switched over to cetaphil and it decreased all my pimples! Still a bit oily but it’s no problem. I double cleanse din and do my skincare.",
        "status": "HG (Holy Grail)",
        "availability": "Watsons or any grocery store",
        "match_confidence": 0.8,
        "product_type": "Cleanser"
      }
    ],
    "posts_count": 0,
    "comments_count": 7
  },
  "Cosrx Salicylic Acid Daily Gentle Cleanser": {
    "product_name": "Cosrx Salicylic Acid Daily Gentle Cleanser",
    "product_type": "Cleanser",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "l7nxm4y",
        "comment_author": "salty_mamimo",
        "comment_score": 3,
        "comment_created_utc": 1717847740.0,
        "comment": "Skin Type: Combination\nProduct Name: COSRC Salicylic Acid Cleanser\nPrice: 350\nType: Creamy\nEffect: Maganda sya for me. Got laid off and no work for 6 months so wala talagang budget for skincare. Textured skin, acne prone pa, sabayan pa ng stress so ayun ang dumi talaga ng mukha ko. Until I came across this product and has been using it for 1 week now and promising ang results; pimples nag dry na, dark spots starting to lighten.",
        "skin_type": [
          "Combination"
        ],
        "price_size": "350",
        "effects": "Maganda sya for me. Got laid off and no work for 6 months so wala talagang budget for skincare. Textured skin, acne prone pa, sabayan pa ng stress so ayun ang dumi talaga ng mukha ko. Until I came across this product and has been using it for 1 week now and promising ang results; pimples nag dry na, dark spots starting to lighten.",
        "status": null,
        "availability": null,
        "match_confidence": 0.7887323943661971,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "k97q4mn",
        "comment_author": "MundaneTwistedMind",
        "comment_score": 12,
        "comment_created_utc": 1699971568.0,
        "comment": "Skin Type: Oily/Combination, Sensitive Skin\nProduct Name: Cosrx Salicylic Acid Daily Gentle Cleanser & Cosrx Good Morning Facial Cleanser\nPrice and Size: Both 250 for 50ml\nWhere to buy: Piggies Shop sa orange app / Meron din sa Watsons Official Store ng orange app\nEffects/Experience: No itchiness, redness or any adverse reaction sa skin ko. Skin feels soft and clean talaga. Sa umaga ko ginagamit yung Good Morning Facial Cleanser and sa gabi yung Salicylic Acid. ☺️\nStatus: WR = will repurchase",
        "skin_type": [
          "Oily",
          "Combination",
          "Sensitive"
        ],
        "price_size": "Both 250 for 50ml",
        "effects": "No itchiness, redness or any adverse reaction sa skin ko. Skin feels soft and clean talaga. Sa umaga ko ginagamit yung Good Morning Facial Cleanser and sa gabi yung Salicylic Acid. ☺️",
        "status": "WR (Will Repurchase)",
        "availability": "Piggies Shop sa orange app / Meron din sa Watsons Official Store ng orange app",
        "match_confidence": 0.8,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "k8uqoeu",
        "comment_author": "YettersGonnaYeet",
        "comment_score": 11,
        "comment_created_utc": 1699743544.0,
        "comment": "Skin Type: Sensitive, Dry, and Oily on some areas\nProduct Name: COSRX Low pH Good Morning Gel Cleanser and COSRX Salicylic Acid Daily Gentle Cleanser\nPrice and Size: Good Morning Gel Cleanser= 299 php for 150ml ; Salicylic Acid 299 php for 150ml also (sale ngayon idk the og price)\nWhere to buy: Shopee, Tiktok Shop, Watsons (jusy make sure na sa official page kayo ng COSR bibili)\nEffects/Experience: My skin is already so sensitive and dry, but the Low pH and Salicylic Acid Cleansers doesn't make it worse.\nThe Low ph cleanser does wonders in drying out pimples and cleaning the face without any stripping. Sometimes, kapag nakakalimutan ko mag moisturize, gigising ako kinabukasan w/o any dry, flaky, and redness on any parts of my face.\nI only use the Salicylic Acid cleanser 2 or 3 times a week. Low lang concentration niya ng Salicylic Acid, pero its really helpful in removing white heads around the nose, chin, and forehead (just make sure to rub it thoroughly).\nStatus: HG and WR on both!!",
        "skin_type": [
          "Sensitive",
          "Dry",
          "Oily"
        ],
        "price_size": "Good Morning Gel Cleanser= 299 php for 150ml ; Salicylic Acid 299 php for 150ml also (sale ngayon idk the og price)",
        "effects": "My skin is already so sensitive and dry, but the Low pH and Salicylic Acid Cleansers doesn't make it worse. The Low ph cleanser does wonders in drying out pimples and cleaning the face without any stripping. Sometimes, kapag nakakalimutan ko mag moisturize, gigising ako kinabukasan w/o any dry, flaky, and redness on any parts of my face. I only use the Salicylic Acid cleanser 2 or 3 times a week. Low lang concentration niya ng Salicylic Acid, pero its really helpful in removing white heads around the nose, chin, and forehead (just make sure to rub it thoroughly).",
        "status": "HG (Holy Grail)",
        "availability": "Shopee, Tiktok Shop, Watsons (jusy make sure na sa official page kayo ng COSR bibili)",
        "match_confidence": 0.8,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "k8vezrt",
        "comment_author": "Charmeeleone",
        "comment_score": 10,
        "comment_created_utc": 1699753280.0,
        "comment": "Skin Type: Combination\nProduct Name: Klued - 2% Salicylic Acid Gentle Cleanser 120m|\nPrice and Size: ₱ 349 / 120 mL (bought mine at ₱192 during sale)\nWhere to buy: Official online stores (Shopee or Laz)\nEffects/Experience: Parang hindi nakaka wash ng face? But I guess ganun lang talaga yung effect since it’s advertised as a “gentle” cleanser. Second bottle ko na. I need cleansers with SA (salicylic acid) kasi these type of cleansers prevent huge pimples sa face ko. I went on a vacay so iniwan ko to and gosh nag break out ako. Before, COSRX Salicylic Acid Daily Gentle Cleanser (white and red variant) gamit ko but superrrr drying for me, so I switched to Klued.\nStatus: Will repurchase (already did).",
        "skin_type": [
          "Combination"
        ],
        "price_size": "₱ 349 / 120 mL (bought mine at ₱192 during sale)",
        "effects": "Parang hindi nakaka wash ng face? But I guess ganun lang talaga yung effect since it’s advertised as a “gentle” cleanser. Second bottle ko na. I need cleansers with SA (salicylic acid) kasi these type of cleansers prevent huge pimples sa face ko. I went on a vacay so iniwan ko to and gosh nag break out ako. Before, COSRX Salicylic Acid Daily Gentle Cleanser (white and red variant) gamit ko but superrrr drying for me, so I switched to Klued.",
        "status": "WR (Will Repurchase (ALREADY DID))",
        "availability": "Official online stores (Shopee or Laz)",
        "match_confidence": 0.7294117647058823,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "k8s0h1h",
        "comment_author": "Valuable-Switch-1159",
        "comment_score": 9,
        "comment_created_utc": 1699706966.0,
        "comment": "Skin Type: Oily, Acne-Prone\nProduct Name: CosRx Salicyclid Acid Cleanser\nPrice: 295php yata sa Shopee?\nWhere to buy: Lazada, Shopee, Watson’s\nExperience: Since 2020 ko ito gamit and around this time, super dami kong pimples 🥲 A friend recommended this to me at nahiyang ako, pero siya daw hindi hiyang HAHA i still get pimples pero hindi siya kasing bad compared sa dati hahaha. And mostly mabilis mawala kasi hormonal or diet naman ang cause.\nStatus: HG for me",
        "skin_type": [
          "Oily",
          "Acne Prone"
        ],
        "price_size": "295php yata sa Shopee?",
        "effects": "Since 2020 ko ito gamit and around this time, super dami kong pimples 🥲 A friend recommended this to me at nahiyang ako, pero siya daw hindi hiyang HAHA i still get pimples pero hindi siya kasing bad compared sa dati hahaha. And mostly mabilis mawala kasi hormonal or diet naman ang cause.",
        "status": "HG (Holy Grail)",
        "availability": "Lazada, Shopee, Watson’s",
        "match_confidence": 0.7777777777777778,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "k8y088m",
        "comment_author": "gipsy7",
        "comment_score": 6,
        "comment_created_utc": 1699806921.0,
        "comment": "**Skin Type:** combo and sensitive sa Pinas, dry and sensitive dito sa abroad\n**Product Name:** Inkey List Salicylic Acid Cleanser\n**Price and Size:** around 900\n**Where to buy:** Skincare PH on Lazada\n**Effects/Experience:** I have the occasional hormonal acne flare ups and this cleanser shuts it down. It's also not drying.\n**Status:** HG, will repurchase forever.\nCheaper alternative is Klenzit. It's around 500.",
        "skin_type": [
          "Sensitive",
          "Dry"
        ],
        "price_size": "** around 900",
        "effects": "** I have the occasional hormonal acne flare ups and this cleanser shuts it down. It's also not drying.",
        "status": "HG (Holy Grail)",
        "availability": "** Skincare PH on Lazada",
        "match_confidence": 0.6578947368421053,
        "product_type": "Cleanser"
      }
    ],
    "posts_count": 0,
    "comments_count": 6
  },
  "COSRX Low pH Good Morning Gel Cleanser": {
    "product_name": "COSRX Low pH Good Morning Gel Cleanser",
    "product_type": "Cleanser",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "k8uecrz",
        "comment_author": "chairo__",
        "comment_score": 8,
        "comment_created_utc": 1699739206.0,
        "comment": "Skin Type: oily combination\nProduct Name: COSRX Low pH Good Morning Gel Cleanser + Axis-Y Quinoa One-Step Balanced Gel Cleanser\nPrice and Size: COSRX 150ml (php 350), Axis-Y 180ml (php 565)\nWhere to buy: Shopee/Lazada\nExperience: COSRX’s gel cleanser has been a skincare staple for me since pre-pandemic times. There’s very little I can add into the array of rave reviews about it that already exist, but as always, it’s non-stripping, lathers nicely, and does everything a basic, no-frills AM cleanser should do.\nThe Axis-Y quinoa cleanser has a thinner and more watery consistency than COSRX, so I use this in the PM after cleansing with a balm (I use Heimish’s btw!). It lathers just enough to get rid of any residual makeup, sunscreen, and/or cleansing balm. And when I get out of the shower at night, my face doesn’t feel uncomfortably tight.\nJust a note: Both of these cleansers smell clean (somewhat botanical?) but aren’t fragranced to high heaven, so they’re perfect for someone like me who also happens to dislike strong perfume-y scents in skincare.\nStatus: COSRX HG, Axis-Y WR",
        "skin_type": [
          "Oily",
          "Combination"
        ],
        "price_size": "COSRX 150ml (php 350), Axis-Y 180ml (php 565)",
        "effects": "COSRX’s gel cleanser has been a skincare staple for me since pre-pandemic times. There’s very little I can add into the array of rave reviews about it that already exist, but as always, it’s non-stripping, lathers nicely, and does everything a basic, no-frills AM cleanser should do. The Axis-Y quinoa cleanser has a thinner and more watery consistency than COSRX, so I use this in the PM after cleansing with a balm (I use Heimish’s btw!). It lathers just enough to get rid of any residual makeup, sunscreen, and/or cleansing balm. And when I get out of the shower at night, my face doesn’t feel uncomfortably tight. Just a note: Both of these cleansers smell clean (somewhat botanical?) but aren’t fragranced to high heaven, so they’re perfect for someone like me who also happens to dislike strong perfume-y scents in skincare.",
        "status": "HG (Holy Grail)",
        "availability": "Shopee/Lazada",
        "match_confidence": 0.8,
        "product_type": "Cleanser"
      }
    ],
    "posts_count": 0,
    "comments_count": 1
  },
  "Cerave Hydrating Cream-to-Foam Cleanser": {
    "product_name": "Cerave Hydrating Cream-to-Foam Cleanser",
    "product_type": "Cleanser",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "k8s61og",
        "comment_author": "Kind_Context_1085",
        "comment_score": 6,
        "comment_created_utc": 1699709827.0,
        "comment": "Skin Type: Oily, sensitive\nProduct Name: Cerave Acne Control Cleanser\nPrice & Size: Around Php1K for 237mL\nWhere to buy: Shopee (Beautyteeps)\nStatus: WR",
        "skin_type": [
          "Oily",
          "Sensitive"
        ],
        "price_size": "Around Php1K for 237mL",
        "effects": null,
        "status": "WR (Will Repurchase)",
        "availability": "Shopee (Beautyteeps)",
        "match_confidence": 0.676923076923077,
        "product_type": "Cleanser"
      }
    ],
    "posts_count": 0,
    "comments_count": 1
  },
  "Pyunkang Yul Acne Facial Cleanser": {
    "product_name": "Pyunkang Yul Acne Facial Cleanser",
    "product_type": "Cleanser",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "k8s28tw",
        "comment_author": "rfranklin04401221",
        "comment_score": 5,
        "comment_created_utc": 1699707915.0,
        "comment": "Skin type: Normal to oily\nProduct name: Oxecure acne clear facial cleanser\nPrice and size: 199 pesos for 50 mL and 419 pesos for 120 mL\nWhere to buy: Drug stores, watsons, lazada, shopee\nEffects/experience: Ito lang yung effective sakin na cleanser na hindi ako nagddry, I used to love oxecure's pH 5.5 cleanser but nag-breakout na ako simula nung nagreformulate sila so I switched to this. Effective for me! But of course I won't say na this solely cleared my acne, but it helps me control them and di siya dumadagdag sa problema ko.\nMatipid siya for me! I think it's slightly expensive for its size but super tipid for me and ilang months an bago maubos, I usually buy pag sale so sulit.\nStatus: Holy grail, please sana di nila ireformulate to (I wasn't able to try the formula before the current formula so di ko macompare)",
        "skin_type": [
          "Normal",
          "Oily"
        ],
        "price_size": "199 pesos for 50 mL and 419 pesos for 120 mL",
        "effects": "Ito lang yung effective sakin na cleanser na hindi ako nagddry, I used to love oxecure's pH 5.5 cleanser but nag-breakout na ako simula nung nagreformulate sila so I switched to this. Effective for me! But of course I won't say na this solely cleared my acne, but it helps me control them and di siya dumadagdag sa problema ko. Matipid siya for me! I think it's slightly expensive for its size but super tipid for me and ilang months an bago maubos, I usually buy pag sale so sulit.",
        "status": "HG (Holy Grail)",
        "availability": "Drug stores, watsons, lazada, shopee",
        "match_confidence": 0.6567164179104478,
        "product_type": "Cleanser"
      }
    ],
    "posts_count": 0,
    "comments_count": 1
  },
  "Skin Aqua UV Super Moisture Gel Gold Sunscreen": {
    "product_name": "Skin Aqua UV Super Moisture Gel Gold Sunscreen",
    "product_type": "Sunscreen",
    "posts": [
      {
        "post_id": "1e9d1by",
        "post_author": "AtTheUngodlyHour",
        "post_score": 46,
        "post_created_utc": 1721651266.0,
        "post_title": "Kose Suncut UV Perfect Gel (2024 Reformulation) Review - Perfect for Oily Skin and Active Lifestyles! ",
        "post_url": "https://reddit.com/r/beautytalkph/comments/1e9d1by/kose_suncut_uv_perfect_gel_2024_reformulation/",
        "post_selftext": "Hi everyone!\n\nI wanted to share my thoughts on the Kose Suncut UV Perfect Gel (2024 reformulation). For some background, I have oily skin and use adapalene at night for acne. I’m diligent about my sunscreen use since 2015, as advised by my dermatologist, and I've tried numerous Western and Asian sunscreens over the years. Here’s my experience with the latest version of this sunscreen:\n\n\nWhat I Liked:\n\n1. True gel consistency: Just like the old version, this sunscreen has a true gel consistency that dries down with almost no greasy feeling. It dries down to a natural finish (not dewy, not matte).\n   \n2. Does not pill: One of the biggest issues I had with the previous version was that it would pill when I accidentally touch it while it dries. Also, the old formula pills when friction was applied. This new formulation has completely resolved that problem.\n\n3. Water resistance: As someone with an active lifestyle who sweats a lot, I always use a water resistant sunscreen when doing outdoor activities. When I tried this, I noticed that it stays on my face despite sweating and (lightly) wiping sweat a lot.\n\n4. Works well under makeup: I’ve tried this under my foundation, and it blends seamlessly. Unlike other water-resistant gel sunscreens like Skin Aqua Super Moisture Barrier UV Gel and Biore Aqua Rich Watery Essence, this one didn’t cause me to oil up throughout the day.\n\n5. Not drying or stinging: Even though it contains alcohol, it doesn’t feel drying or sting my skin. \n\n6. No white cast! \n\n7. No added fragrance: This has a bit of an alcohol smell but when it dries down, the scent fades.\n\n\nCons:\n\n1. Alcohol Ingredient: This may not be for those who are sensitive to alcohol. \n\n2. Not readily available in physical stores in the Philippines.",
        "match_confidence": 0.75,
        "skin_type": [
          "Oily"
        ],
        "price_size": null,
        "status": null,
        "availability": "Physical stores in the philippines"
      }
    ],
    "megathread_comments": [
      {
        "comment_id": "j9nh55r",
        "comment_author": "_luna21",
        "comment_score": 20,
        "comment_created_utc": 1677131396.0,
        "comment": "Skin Type: Oily\nProduct Name: Skin Aqua UV Super Moisture Gel\nPrice and Size: 110g | 450-550\nEffects and Experience: Been a Bioré girl ever since but nagoioil up ako sa biore so tried this one out and I’m currently on my 3 bottle na. Its suitable for oily gals since it is easily absorbed by the skin. No sticky feeling as well\nStatus: HG",
        "skin_type": [
          "Oily"
        ],
        "price_size": "110g | 450-550",
        "effects": "Been a Bioré girl ever since but nagoioil up ako sa biore so tried this one out and I’m currently on my 3 bottle na. Its suitable for oily gals since it is easily absorbed by the skin. No sticky feeling as well",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.8051948051948052,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "jbdf3lw",
        "comment_author": "Muffinlooove",
        "comment_score": 12,
        "comment_created_utc": 1678255935.0,
        "comment": "Skin Type: Sensitive, Oily & Acne Prone\nProduct Name: Skin Aqua UV Moisture Gold Gel SPF50+ PA++++\nPrice: Php550 for 110g\nEffects/Experience: finally found a sunscreen that works on my super arteng skin!! Very lightweight, easy to spread and doesn’t sting my eyes. I usually get closed comedones and pimples when using sunscreen pero sa product na ‘to wala. Very hiyang talaga ako dito and ganda din ng lapat nya sa make up. Fresh buong araw. Di ako mukang dugyot while using this sunscreen.\nStatus: HG & WR 💖💖💖💖",
        "skin_type": [
          "Sensitive",
          "Oily",
          "Acne Prone"
        ],
        "price_size": "Php550 for 110g",
        "effects": "finally found a sunscreen that works on my super arteng skin!! Very lightweight, easy to spread and doesn’t sting my eyes. I usually get closed comedones and pimples when using sunscreen pero sa product na ‘to wala. Very hiyang talaga ako dito and ganda din ng lapat nya sa make up. Fresh buong araw. Di ako mukang dugyot while using this sunscreen.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.6588235294117647,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "jpzvj9n",
        "comment_author": "lanwangjisus",
        "comment_score": 12,
        "comment_created_utc": 1688048358.0,
        "comment": "Skin Type: Snesitive, Oily, Acne-prone\nProduct Name: Skin Aqua UV Super Moisture Gel\nPrice and Size: 140g\nEffects and Experience: Really wanted to like this one pero unfortunately nagka-comedones ako dito. It's very dewy/shiny on my skin even when it sets. Mabilis din mag-oil up skin ko pag gamit ko to kahit lagyan ko ng setting powder.\nStatus: WNR",
        "skin_type": [
          "Oily",
          "Acne Prone"
        ],
        "price_size": "140g",
        "effects": "Really wanted to like this one pero unfortunately nagka-comedones ako dito. It's very dewy/shiny on my skin even when it sets. Mabilis din mag-oil up skin ko pag gamit ko to kahit lagyan ko ng setting powder.",
        "status": "WNR (Will Not Repurchase)",
        "availability": null,
        "match_confidence": 0.8051948051948052,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "jbdfuym",
        "comment_author": "makeupnskincareonly",
        "comment_score": 10,
        "comment_created_utc": 1678256471.0,
        "comment": "Skin Type: Normal-Dry\nProduct Name: [Skin Aqua UV Super Moisture Gel SPF50+ PA++++](https://shp.ee/acqfuty)\nPrice & Size: 110g for ₱450\nEffects/Experience: I alternate this with my Skin1004 Hyalu-Cica Water Fit Sun Serum. I use this on days my skin isn't feeling too dry or I'm not too lazy for moisturizer [it's not drying ah, I just really have dry skin most of the time since I use actives too kaya my skin requires the use of moisturizer]. Feels good on the skin, non-greasy, and no white cast! It's absorbed well on my skin + barely any drying time. The 110g lasts me soooo long despite using it every day [I reapply this when I'm at home since I'm barefaced lang naman]. No irritations whatsoever.\nStatus: WR [can't say it's my HG since I've only been using this for a little over 2 months and I think that's too soon for it to be called a holy grail]",
        "skin_type": [
          "Normal",
          "Dry"
        ],
        "price_size": "110g for ₱450",
        "effects": "I alternate this with my Skin1004 Hyalu-Cica Water Fit Sun Serum. I use this on days my skin isn't feeling too dry or I'm not too lazy for moisturizer [it's not drying ah, I just really have dry skin most of the time since I use actives too kaya my skin requires the use of moisturizer]. Feels good on the skin, non-greasy, and no white cast! It's absorbed well on my skin + barely any drying time. The 110g lasts me soooo long despite using it every day [I reapply this when I'm at home since I'm barefaced lang naman]. No irritations whatsoever.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.6990291262135923,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "j9oic0n",
        "comment_author": "hlthnwllnss",
        "comment_score": 5,
        "comment_created_utc": 1677158552.0,
        "comment": "Skin Type: Oily, acne-prone that may also be dehydrated. I notice that a lot of products that didn't really suited my skin took awhile to start showing bad effects and these effects were very slow to emerge so medyo pahirapan malaman kung alin ba yung issue sa mga pruoducts na gamit ko.\nI'm quite new to sunscreens so these would all be my \"first impressions\" of the products though I've already used most of these multiple times already.\nProduct Name: Skin Aqua UV Super Moisture Gel Gold SPF 50+ PA++++\nPrice and Size: 500-600 PHP / 110g\nEffects/Experience: Extremely nice, this one is lightweight and very easy to blend. It disappears on your skin and leaves it with a natural finish, maybe ever so slightly more glowy than before you applied but otherwise almost nothing. The feeling it leaves your skin is quite smooth and also pretty natural. It has alcohol but aside from the smell which disappears completely after a few seconds, I did not really experience any bad effects from this. This is neither moisturizing nor drying. Fragrance free and water resistant.\nStatus: HG probably, definitely\nProduct Name: Kose Suncut  UV Perfect Gel SPF 50+ PA++++\nPrice and Size: 500-600 PHP / 100g\nEffects/Experience: I would say that this is quite comparable to the Skin Aqua above but they have their differences. This feels a little silicone-y or idk. It's lightweight and zero whitecast but it dries very quickly on your skin that I'm still not done spreading it but it's already setting on my skin, will does cause it to pill a little, especially on my brows. Like the Skin Aqua, this has alcohol though I will say that my face doesn't look \"as good\" at the end of the day after using this compared to the skin aqua so this may be ever so slightly drying. Also I noticed multiple times that this was making my eyes a bit sensitive and feel cool. Fragrance free and water resistant.\nStatus: MRP\nProduct Name: OMI Menturm VERDIO UV Moisture Gel SPF 50+ PA++++\nPrice and Size: 350-499 PHP / 80g (also in 220g)\nEffects/Experience: This, compared to the other Japanese sunscreens is alcohol-free. Also fragrance-free, water resistant. This one seems to be advertised for those with sensitive skin as this also is advertised for kids. This is very milky/gloopy. Using this, you will notice that it doesn't set as quickly as the Skin Aqua but is still easy to spread and is definitely on the dewy, glowy, shiny side of sunscreens. Whether that is a good thing or a bad thing will depend on you. This is just like the other Korean sunscreens where if you want something moisturizing, dewy, and have other beneficial ingredients then you may want to try this.\nStatus: WRP, maybe HG for the type of sunscreen which has no alcohol and feels a little more like skincare and not just for protection.\nProduct Name: Benton Air Fit UV Defense Sun Cream\nPrice and Size: 500 PHP / 50ml\nEffects/Experience: I bought this together with the Beauty of Joseon and I will say that they are pretty comparable. The Benton has a green tint which doesn't really do anything as it turns watery once you start spreading it. This also have an essential oil which you can definitely smell. Like the Omi Menturm, this is shiny, dewy etc but is not water resistant. This also feels a little thicker on the skin once it dries down and it doesn't really sets or disappear like those really lightweight sunscreens.\nStatus: MRP, maybe not, not quite sure yet.\nProduct Name: Beauty of Joseon Relief Sun Rice + Probiotics SPF50+ PA++++\nPrice and Size: 500-600 PHP / 50ml\nEffects/Experience: This is similar to the Benton but without essential oil. I would say that this has a pretty different texture, parang kakaiba yung feel niya once you spread it, but the finish remains the same. I can't really say whether the Benton or the Beauty of Joseon is shinier, but both looks very reflective after applying but they do set into an acceptable finish. Same thoughts to Benton really, if you like one of them then you'll like the other. Also almost forgot to mention, both stings my fingers as I apply them though my face feels fine.\nStatus: MRP, maybe not, not quite sure yet.\nProduct Name: Etude House Sunprise Mild Watery Light SPF50+ PA++++\nPrice and Size: 400\\~ PHP / 50g\nEffects/Experience: This has a pretty strong fragrance. This is the new version which have PA++++ instead of 3 pluses. If I can verify that my face if fine with the fragrance and the sunscreen, then I'll definitely choose this over the Benton and Beauty of Joseon suncreens. This is just like them but lighter, faster to spread and goes completely clear on the skin. I heard that the BOJ may have a slight whitecast on deeper skin tones but this one will probably not have one. This is priced very nicely and is not as shiny or dewy as the above two.\nStatus: MRP",
        "skin_type": [
          "Oily",
          "Acne Prone"
        ],
        "price_size": "This has a pretty strong fragrance. This is the new version which have PA++++ instead of 3 pluses. If I can verify that my face if fine with the fragrance and the sunscreen, then I'll definitely choose this over the Benton and Beauty of Joseon suncreens. This is just like them but lighter, faster to spread and goes completely clear on the skin. I heard that the BOJ may have a slight whitecast on deeper skin tones but this one will probably not have one. This is priced very nicely and is not as shiny or dewy as the above two.",
        "effects": "This is similar to the Benton but without essential oil. I would say that this has a pretty different texture, parang kakaiba yung feel niya once you spread it, but the finish remains the same. I can't really say whether the Benton or the Beauty of Joseon is shinier, but both looks very reflective after applying but they do set into an acceptable finish. Same thoughts to Benton really, if you like one of them then you'll like the other. Also almost forgot to mention, both stings my fingers as I apply them though my face feels fine.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.8260869565217391,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "l9kkto9",
        "comment_author": "Complex_Week3697",
        "comment_score": 12,
        "comment_created_utc": 1718944347.0,
        "comment": "Skin type: oily skin\nProduct name: Skin Aqua  Super Moisture UV milk spf 50+\nPrice: 374 pesos, if you get it from this [direct from japan store](https://goeco.asia/eeZ576Bs). I got mine from japan but there’s a lot of direct from japan shops in 🍊app but this is the cheapest I could find\nEffects: Not only that it’s sweat and water resistant, it’s also alcohol and fragrance free! I bought this as an alternative to my much more expensive sunscreen and let me tell you it did not disappoint! It also didn’t irritate my skin compared to other sunscreens (i also have sensitive skin) It’s also in a  lighter finish!\nStatus: HG ✨",
        "skin_type": [
          "Oily"
        ],
        "price_size": "374 pesos, if you get it from this [direct from japan store](https://goeco.asia/eeZ576Bs). I got mine from japan but there’s a lot of direct from japan shops in 🍊app but this is the cheapest I could find",
        "effects": "Not only that it’s sweat and water resistant, it’s also alcohol and fragrance free! I bought this as an alternative to my much more expensive sunscreen and let me tell you it did not disappoint! It also didn’t irritate my skin compared to other sunscreens (i also have sensitive skin) It’s also in a  lighter finish!",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.6823529411764706,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "kvo3dk3",
        "comment_author": "blimeyyweasleyy",
        "comment_score": 10,
        "comment_created_utc": 1710897305.0,
        "comment": "**Skin Type:** Acne-prone, Oily\n**Product Name:** Skin Aqua Super Moisture Gel Gold SPF 50+ / PA ++++\n**Price and Size:** Ranges from Php 450-600 pesos sa blue and orange apps, 110ml bottle\n**Effects/Experience:** It is marketed for humid climates and is super effective on face and body given na I work on-site some days. Comes in a big bottle, moisturizing and leaves no white-cast. May subtle alcohol smell but fades easily. Big plus na it does not break me out. Also, may dewy finish but I usually powder my face din naman.\n**Status:** HG status!  \\*Would want to repurchase however I read somewhere it may be discontinued this year",
        "skin_type": [
          "Acne Prone",
          "Oily"
        ],
        "price_size": "** Ranges from Php 450-600 pesos sa blue and orange apps, 110ml bottle",
        "effects": "** It is marketed for humid climates and is super effective on face and body given na I work on-site some days. Comes in a big bottle, moisturizing and leaves no white-cast. May subtle alcohol smell but fades easily. Big plus na it does not break me out. Also, may dewy finish but I usually powder my face din naman.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.7865168539325843,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "l7vzgj2",
        "comment_author": "Effective-Love-4025",
        "comment_score": 3,
        "comment_created_utc": 1717976413.0,
        "comment": "Skin Type: combination\nProduct Name: Skin Aqua UV Super Moisture Gel\nPrice: 400-600 php 110g - 165g\nEffects/Experience: This is hands down my favorite sunscreen of all time it blends easily and sinks into the skin fast, even though chemical sunscreen siya it doesnt sting my eyes im just so sad that the 2024 version didnt work for me ;( off to hunt a similar sunscreen ig\nStatus: HG !",
        "skin_type": [
          "Combination"
        ],
        "price_size": "400-600 php 110g - 165g",
        "effects": "This is hands down my favorite sunscreen of all time it blends easily and sinks into the skin fast, even though chemical sunscreen siya it doesnt sting my eyes im just so sad that the 2024 version didnt work for me ;( off to hunt a similar sunscreen ig",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.8051948051948052,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mt8kjf4",
        "comment_author": "RambVines",
        "comment_score": 12,
        "comment_created_utc": 1747711534.0,
        "comment": "Skin Type: Combination/Oily\nProduct Name: Skin Aqua UV Super Moisture Gel\nPrice and Size: 380-400 for a 110g bottle (shopee)\nEffects and Experience:\nI've been using this for two weeks now (mostly outdoors) and this has to be one of my favorite sunscreens, yet. I have tanned skin and this leaves absolutely no whitecast on me. Also really easy to re-apply because of how easily it melts into my skin and feels like a light moisturizer.\nI'm often outdoors and with combination/oily skin, this does leave a bit of a dewy shine. It doesn't look greasy though. I used this on a hike and as someone who sweats a lot, the waterproof rating did seem to hold its ground. It smells strongly of alcohol on first application, but the scent goes away minutes after. It didn't sting my eyes even on hot, sweaty days.\nStatus: Potential HG. Will definitely repurchase!",
        "skin_type": [
          "Combination",
          "Oily"
        ],
        "price_size": "380-400 for a 110g bottle (shopee)",
        "effects": "I've been using this for two weeks now (mostly outdoors) and this has to be one of my favorite sunscreens, yet. I have tanned skin and this leaves absolutely no whitecast on me. Also really easy to re-apply because of how easily it melts into my skin and feels like a light moisturizer. I'm often outdoors and with combination/oily skin, this does leave a bit of a dewy shine. It doesn't look greasy though. I used this on a hike and as someone who sweats a lot, the waterproof rating did seem to hold its ground. It smells strongly of alcohol on first application, but the scent goes away minutes after. It didn't sting my eyes even on hot, sweaty days.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.8051948051948052,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrvkpdc",
        "comment_author": "Kiwi_pieeee",
        "comment_score": 6,
        "comment_created_utc": 1747034356.0,
        "comment": "Skin Type: Oily\nProduct Name: Skin Aqua UV Super Moisture Gel\nPrice & Size: 400+ Php, 50g\nEffects / Experience: it has thick & creamy consistency but feels lightweight once applied. Very moisturizing din siya at the same time kaya I don’t need to use a separate moisturizer na. Although it makes my face very shiny but I just dab some powder to remove shine. It doesn’t pill as well kaya winner siya for me.\nStatus: HG & WR",
        "skin_type": [
          "Oily"
        ],
        "price_size": "400+ Php, 50g",
        "effects": "it has thick & creamy consistency but feels lightweight once applied. Very moisturizing din siya at the same time kaya I don’t need to use a separate moisturizer na. Although it makes my face very shiny but I just dab some powder to remove shine. It doesn’t pill as well kaya winner siya for me.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.8051948051948052,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrvzqsn",
        "comment_author": "devonnemai",
        "comment_score": 5,
        "comment_created_utc": 1747044048.0,
        "comment": "**Skin Type**: Dry & Sensitive\n**Product Name**: Skin Aqua UV Super Moisture Milk SPF 50+ PA++++\n**Price and Size**: Php 545 // 40ml. I wish it came in a bigger size.\n**Effects/Experience**: This is a hybrid sunscreen (has both chemical and physical sun filters). I use Skinoren Azelaic Acid in the morning and this sunscreen doesn't aggravate the stinging sensation. If you use azelaic acid, usually physical sunscreen is recommended, but it has white cast. Chemical sunscreens doesn't, but it always stings. So this sunscreen is perfect. It has a runny milky consistency. It's smooth and very easy to blend. It dries down with a satin finish, perfect for a makeup base or on it's own.\n**Status**: HG!!! I WILL FOREVER REPURCHASE THIS. I've been using Beauty of Joseon for the longest time, but ever since I started azelaic acid I stopped. Idk if it's true that it was discontinued already 😭 I hope not. Hopefully not a reformulation too.",
        "skin_type": [
          "Dry",
          "Sensitive"
        ],
        "price_size": "Php 545 // 40ml. I wish it came in a bigger size.",
        "effects": "This is a hybrid sunscreen (has both chemical and physical sun filters). I use Skinoren Azelaic Acid in the morning and this sunscreen doesn't aggravate the stinging sensation. If you use azelaic acid, usually physical sunscreen is recommended, but it has white cast. Chemical sunscreens doesn't, but it always stings. So this sunscreen is perfect. It has a runny milky consistency. It's smooth and very easy to blend. It dries down with a satin finish, perfect for a makeup base or on it's own.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.7045454545454546,
        "product_type": "Sunscreen"
      }
    ],
    "posts_count": 1,
    "comments_count": 11
  },
  "Belo Dewy Essence Sunscreen": {
    "product_name": "Belo Dewy Essence Sunscreen",
    "product_type": "Sunscreen",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "j9o63mo",
        "comment_author": null,
        "comment_score": 11,
        "comment_created_utc": 1677150883.0,
        "comment": "Skin Type: Combination, dry-leaning with a tendency to get oily in the T-zone\nProduct Name: Belo SunExpert Dewy Essence Sunscreen SPF50 PA++++\nPrice and Size: 50ml, Php430.00\nEffects/Experience: I love this stuff. This is the most lightweight sunscreen I've ever used, though I prefer emollient sunscreens so take this with a grain of salt. For reference, the original SunExpert Face with SPF40 was lightweight for me, and Dewy Essence feels even more comfortable than that. Some people find that pretty heavy. I can layer this and use three fingers' worth of product without a problem, and it doesn't break me out. I don't really find this dewy or shiny. I tend to get oily throughout the day but this doesn't add to my usual amount of oiliness. This and the OG are great makeup primers, too.\nStatus: (HG for Holy Grail, WR for Will Repurchase, WNR for Will Not Repurchase) Probably my HG at this point",
        "skin_type": [
          "Combination",
          "Dry",
          "Oily"
        ],
        "price_size": "50ml, Php430.00",
        "effects": "I love this stuff. This is the most lightweight sunscreen I've ever used, though I prefer emollient sunscreens so take this with a grain of salt. For reference, the original SunExpert Face with SPF40 was lightweight for me, and Dewy Essence feels even more comfortable than that. Some people find that pretty heavy. I can layer this and use three fingers' worth of product without a problem, and it doesn't break me out. I don't really find this dewy or shiny. I tend to get oily throughout the day but this doesn't add to my usual amount of oiliness. This and the OG are great makeup primers, too.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.7397260273972602,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "j9nonw3",
        "comment_author": "UnicornPonyPorn",
        "comment_score": 3,
        "comment_created_utc": 1677136609.0,
        "comment": "**Skin Type:** Normal/Oily Combo\n**Product Name:** Belo Sunexpert Dewy Essence Sunscreen SPF50 PA++++\n**Price and Size:** 442 for 50ML but i think there's B1T1 at some stores.\n**Effects/Experience:** it's a decent combo sunscreen, perfect for people starting skincare and on a budget. it has a noticeable white cast, a strong vanilla fragrance, and it doesn't sting the eyes. overall, i think it's comfortable to use, easily accessible, affordable, and perfect for lazy morning skincare routines XD\npersonally, i think there are better sunscreen options out there for even cheaper with no fragrance. it weirdly separates if left alone for awhile so make sure to shake properly. it does the job well but i'm not blown away by it.\n**Status:** 5/10 WNR",
        "skin_type": [
          "Normal",
          "Oily"
        ],
        "price_size": "** 442 for 50ML but i think there's B1T1 at some stores.",
        "effects": "** it's a decent combo sunscreen, perfect for people starting skincare and on a budget. it has a noticeable white cast, a strong vanilla fragrance, and it doesn't sting the eyes. overall, i think it's comfortable to use, easily accessible, affordable, and perfect for lazy morning skincare routines XD personally, i think there are better sunscreen options out there for even cheaper with no fragrance. it weirdly separates if left alone for awhile so make sure to shake properly. it does the job well but i'm not blown away by it.",
        "status": "WNR (Will Not Repurchase)",
        "availability": null,
        "match_confidence": 0.7397260273972602,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "kxvubu7",
        "comment_author": "Puzzleheaded-Wish422",
        "comment_score": 1,
        "comment_created_utc": 1712165843.0,
        "comment": "this or belo dewy essence?",
        "skin_type": [],
        "price_size": null,
        "effects": null,
        "status": null,
        "availability": null,
        "match_confidence": 0.6538461538461539,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "lm2f5yy",
        "comment_author": "kurimchizu",
        "comment_score": 4,
        "comment_created_utc": 1725770785.0,
        "comment": "**Product Name:**  BELO SunExpert Dewy Essence Sunscreen 50ML (SPF50 PA++++)\n**Price and Size:** 50 ML / P269\n**Effects/Experience:**\n-No whitecast\n-Feels like a moisturizer\n-Takes time to absorb\n-Have not tried under makeup\n-I did not feel any difference with the watermelon variant\n**Status:** WR only when super low of budget\n----------------------------------------\n**Product Name:**  Belo SunExpert Dewy Essence Watermelon (SPF50 PA++)\n**Price and Size:** 50 ML / B1T1 P450\n**Effects/Experience:**\n-May take few seconds longer for whitecast to disappear\n-Feels like a moisturizer\n-Takes time to absorb\n-Have not tried under makeup\n-I did not feel any difference with the regular dewy variant\n**Status:** WR only when super low of budget\n----------------------------------------\n**Product Name:**  Belo SunExpert Whitening Sunscreen (SPF50 PA++) (old packaging)\n**Price and Size:** 50ML / P450\n**Effects/Experience:**\n-bit heavy on skin\n-takes time to absorb and whitecast to disappear\n-have not tried under makeup\n-a little sting on the dry areas of my face (chin)\n-make my cheeks blush when exposed to sun\n**Status:** WR only if Dewy variant is out of stock and if I’m super low on budget\n----------------------------------------\n**Product Name:** Belo SunExpert Tinted Sunscreen (SPF50 PA++++) 50mL\n**Price and Size:** 50ML / 399\n**Effects/Experience:**\n-Too dark on me\n-Takes a long time to absorb\n**Status:** WNR",
        "skin_type": [],
        "price_size": "** 50ML / 399",
        "effects": "** -Too dark on me -Takes a long time to absorb",
        "status": "WNR (Will Not Repurchase)",
        "availability": null,
        "match_confidence": 0.6923076923076923,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "lscdph9",
        "comment_author": "BioChal",
        "comment_score": 1,
        "comment_created_utc": 1729161897.0,
        "comment": "Hello glow tinted sunscreen",
        "skin_type": [],
        "price_size": null,
        "effects": null,
        "status": null,
        "availability": null,
        "match_confidence": 0.6666666666666666,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrzftek",
        "comment_author": "InfiniteChocoyummy",
        "comment_score": 6,
        "comment_created_utc": 1747085404.0,
        "comment": "Skin Type: Sensitive, Acne prone\nProduct Name: Belo Pure Mineral Sunscreen\nPrice and Size: ₱535/50ml\nEffects/Experience: Blends super easy and has a matte finish unlike other sunscreens (lalo na’t mataas ang % ng mga UV filters niya), mas okay pa nga to compared to other chemical sunscreen na ang hirap iblend plus ang oily sa face\nStatus: HG, WR—lalo na pag nagb1t1 siya (🤞🏼hopefully 🤞🏼tulad ng other sunscreens nila huhu)\n~~\nDati ang HG ko talag is the Perfected Beauty Salve Pure Mineral tinted sunscreen kaso sobrang mahal na niya ngayon halos hindi na makatarungan ₱700+/50ml pero if you have the budget I highly recommend this product. What I love about this sunscreen is that Pure mineral sunscreen siya without any whitecast and meron siyang Iron oxide that protects you from visible light and can help you lighten your darkspots. Unfortunately until now wala pa ako nahahanap na pure physical sunscreen na merong iron oxide that won’t break the bank :(",
        "skin_type": [
          "Sensitive",
          "Acne Prone"
        ],
        "price_size": "₱535/50ml",
        "effects": "Blends super easy and has a matte finish unlike other sunscreens (lalo na’t mataas ang % ng mga UV filters niya), mas okay pa nga to compared to other chemical sunscreen na ang hirap iblend plus ang oily sa face",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.7037037037037037,
        "product_type": "Sunscreen"
      }
    ],
    "posts_count": 0,
    "comments_count": 6
  },
  "Canmake UV Mermaid Sun Gel Clear Sunscreen": {
    "product_name": "Canmake UV Mermaid Sun Gel Clear Sunscreen",
    "product_type": "Sunscreen",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "jbf941x",
        "comment_author": "23fantasy",
        "comment_score": 11,
        "comment_created_utc": 1678294914.0,
        "comment": "**Skin Type:** Combination, acne-prone\n**Product Name:** Canmake UV Mermaid Sun Gel Clear/Cica\n**Price and Size:** around ₱500, 40ml\n**Effects/Experience:** I first tried the Clear variant and I really liked it! No white cast, no alcohol/fragrance as well so it’s likely okay for those with sensitive skin like me. Pwede rin siya around the eyes, it doesn’t sting.\nTried the Cica version last month and I think I’ll switch to it permanently hehe. Love the slight green tint as someone who has PIE 🥲\nedit: It also doubles as a primer I believe!\nCon would be that it’s not waterproof - not an issue if for daily use lang sa work or school with minimal sun exposure. Also it has a dewy finish I think so medj kita kapag textured ang skin (like mine lol) but I don’t find this much of a problem.\n**Status:** HG! No issues with it and I’m too lazy to experiment with other brands at this point haha",
        "skin_type": [
          "Combination",
          "Acne Prone"
        ],
        "price_size": "** around ₱500, 40ml",
        "effects": "** HG! No issues with it and I’m too lazy to experiment with other brands at this point haha",
        "status": null,
        "availability": null,
        "match_confidence": 0.8461538461538461,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "jertl6r",
        "comment_author": "lanwangjisus",
        "comment_score": 10,
        "comment_created_utc": 1680520190.0,
        "comment": "**Skin Type:** Oily, acne-prone, sensitive skin\n**Product Name:** Canmake Mermaid Skin Gel UV (Clear)\n**Price and Size:** 500 PHP, 40g on Shopee\n**Effects/Experience:** This is nice! It may be greasy upon initial application but dries down to a more healthy dewy look. Did not break me out, no stinging or any irritation. Maganda gamitin lalo na for cold weather. Yiu can really why it's recommended by many people. Cons lang is that it's not sweat-resistant, which is what I need for the summer season 🥲 My face sweats like crazy and this will immediately melt once I step out of the house.\n**Status:** HG so far. Sad lang na it's not sweat-resistant.",
        "skin_type": [
          "Oily",
          "Acne Prone",
          "Sensitive"
        ],
        "price_size": "** 500 PHP, 40g on Shopee",
        "effects": "** This is nice! It may be greasy upon initial application but dries down to a more healthy dewy look. Did not break me out, no stinging or any irritation. Maganda gamitin lalo na for cold weather. Yiu can really why it's recommended by many people. Cons lang is that it's not sweat-resistant, which is what I need for the summer season 🥲 My face sweats like crazy and this will immediately melt once I step out of the house.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.7466666666666667,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "j9nhg3s",
        "comment_author": "_luna21",
        "comment_score": 4,
        "comment_created_utc": 1677131591.0,
        "comment": "Skin Type: Oily\nProduct Name: Canmake Mermaid Skin Gel\nPrice and Size: 30/40g(?) | 600-700\nEffects and Experience: For me, this sunscreen is a hybrid of sunscreen and primer since it gives you a nice glow when you use it. Its also good for oily skin kasi no sticky feeling din.\nStatus: WR - Namamahalan kasi ako saknya for its size so WR lang haha",
        "skin_type": [
          "Oily"
        ],
        "price_size": "30/40g(?) | 600-700",
        "effects": "For me, this sunscreen is a hybrid of sunscreen and primer since it gives you a nice glow when you use it. Its also good for oily skin kasi no sticky feeling din.",
        "status": "WR (Will Repurchase)",
        "availability": null,
        "match_confidence": 0.6666666666666666,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "lm2fcj2",
        "comment_author": "kurimchizu",
        "comment_score": 3,
        "comment_created_utc": 1725770873.0,
        "comment": "**Product Name:**  Canmake Mermaid Skin Gel UV 01 Clear (SPF 50+ / PA++++)\n**Price and Size:** 40ML / P450+\n**Effects/Experience:**\n-Pearly-shimmer\n-Can be too dewy\n-No whitecast but may take more time to absorb and disappear\n-Feels like a moisturizer\n-Doesn’t sting my eyes\n-Have not tried under makeup\n**Status:** WNR (Just because the packaging does not look put together when placed along with my korean skincare LOL)",
        "skin_type": [],
        "price_size": "** 40ML / P450+",
        "effects": "** -Pearly-shimmer -Can be too dewy -No whitecast but may take more time to absorb and disappear -Feels like a moisturizer -Doesn’t sting my eyes -Have not tried under makeup",
        "status": "WNR (Will Not Repurchase)",
        "availability": null,
        "match_confidence": 0.6818181818181818,
        "product_type": "Sunscreen"
      }
    ],
    "posts_count": 0,
    "comments_count": 4
  },
  "Biore UV Aqua Rich Watery Essence Sunscreen": {
    "product_name": "Biore UV Aqua Rich Watery Essence Sunscreen",
    "product_type": "Sunscreen",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "j9nix6m",
        "comment_author": "pessimistHotdog",
        "comment_score": 9,
        "comment_created_utc": 1677132559.0,
        "comment": "Skin Type: Oily\nProduct Name: Bioré UV Watery Essence\nPrice and Size: Watsons = 535php, Mercury Drug = I cant remember pero mas cheap sya sa Mercury Drug\nEffects/Experience: Prescribed by my derma kasi I had Acne Vulgaris. Okay naman sya but pag lumalabas ako and nakamask, pansin ko lang is parang shiny shimmery un face ko lol. tho feel ko okay naman un sun protection nya di ko lang bet un mejo shiny sya hehe. I would like to try other sunscreens but eto un nireseta ng derma, and i‘m scared na magbreakout nanaman\nStatus: WR, for safety hehe\nedited: added some details",
        "skin_type": [
          "Oily"
        ],
        "price_size": "Watsons = 535php, Mercury Drug = I cant remember pero mas cheap sya sa Mercury Drug",
        "effects": "Prescribed by my derma kasi I had Acne Vulgaris. Okay naman sya but pag lumalabas ako and nakamask, pansin ko lang is parang shiny shimmery un face ko lol. tho feel ko okay naman un sun protection nya di ko lang bet un mejo shiny sya hehe. I would like to try other sunscreens but eto un nireseta ng derma, and i‘m scared na magbreakout nanaman",
        "status": "WR (Will Repurchase)",
        "availability": null,
        "match_confidence": 0.6666666666666666,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "j9ni6ni",
        "comment_author": "_luna21",
        "comment_score": 5,
        "comment_created_utc": 1677132079.0,
        "comment": "Skin Type: Oily\nProduct Name: Bioré UV Aqua Rich - Watery Essence\nPrice and Size: 50g | 450-500\nEffects and Experience: This is the first Jap sunscreen I feel inlove with. Super suitable for oily skin pips and even tho it has alcohol content, it doesnt bother me that much. However, nagooil up ako dito sometimes so I have to set it with powder. Eto rin gamit na sunscreen ng derma ko so def a must try sunscreen\nStatus: WR",
        "skin_type": [
          "Oily"
        ],
        "price_size": "50g | 450-500",
        "effects": "This is the first Jap sunscreen I feel inlove with. Super suitable for oily skin pips and even tho it has alcohol content, it doesnt bother me that much. However, nagooil up ako dito sometimes so I have to set it with powder. Eto rin gamit na sunscreen ng derma ko so def a must try sunscreen",
        "status": "WR (Will Repurchase)",
        "availability": null,
        "match_confidence": 0.8421052631578947,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "j9nidvj",
        "comment_author": "_luna21",
        "comment_score": 4,
        "comment_created_utc": 1677132211.0,
        "comment": "Skin Type: Oily\nProduct Name: Biorè UV Aqua Rich - Watery Gel\nPrice and Size: 90g | 550 - 650\nEffects and Experience: Tried this once nung nawalan ako ng stock nung Watery Essence. I feel like this is more suitable for dry - combi skin and not for the oily skin. Medyo may whitecast din sya when you first apply it but pag nagset naman, nawawala na. Less fragrance din ito compared sa watery essence.\nStatus: WNR",
        "skin_type": [
          "Oily"
        ],
        "price_size": "90g | 550 - 650",
        "effects": "Tried this once nung nawalan ako ng stock nung Watery Essence. I feel like this is more suitable for dry - combi skin and not for the oily skin. Medyo may whitecast din sya when you first apply it but pag nagset naman, nawawala na. Less fragrance din ito compared sa watery essence.",
        "status": "WNR (Will Not Repurchase)",
        "availability": null,
        "match_confidence": 0.7222222222222222,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "kvpv6v2",
        "comment_author": "CapNo5552",
        "comment_score": 2,
        "comment_created_utc": 1710934741.0,
        "comment": "Skin Type: Combination, Sensitive\nProduct Name: Biore UV Aqua Rich\nPrice and Size: 800yen for 100mL? not really sure abt the size\nEffects: Decided to try this kasi I've seen a lot of good reviews about it. Has a faint chemical (?) scent, stings around the eyes, and leaves a whitecast (which tbf was manageable din naman) but omg just a day after I used it, I got comedones on my forehead! They were so noticeable and I had to get a facial just to get rid of them. I stopped using it after three days kasi the whiteheads were multiplying na. It also leaves a super oily finish which I hate. This was one of the reasons why I decided to consult a dermatologist na.\nStatus: WNR. Nope haha\nName: La Roche Posay Anthelios Mineral Sunscreen\nPrice and Size: 1500php ish for 50mL\nEffects: Light, odorless, leaves a bit of a whitecast but manageable as long as you let it set for a while. This was recommended by my dermatologist after I told her abt the whiteheads I got from Biore's UV Aqua Rich Sunscreen lol. My only issue is that it's not available here in the PH so ang mahal nya! But si far I think it's worth it naman, not HG status yet because I want to try Anessa's and Beauty of Joson's.\nStatus: WR :)",
        "skin_type": [
          "Combination",
          "Sensitive"
        ],
        "price_size": "1500php ish for 50mL",
        "effects": "Light, odorless, leaves a bit of a whitecast but manageable as long as you let it set for a while. This was recommended by my dermatologist after I told her abt the whiteheads I got from Biore's UV Aqua Rich Sunscreen lol. My only issue is that it's not available here in the PH so ang mahal nya! But si far I think it's worth it naman, not HG status yet because I want to try Anessa's and Beauty of Joson's.",
        "status": "WR (Will Repurchase)",
        "availability": null,
        "match_confidence": 0.8,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrvqqdn",
        "comment_author": "yakult_00",
        "comment_score": 8,
        "comment_created_utc": 1747038237.0,
        "comment": "**Skin Type:** Combination\n**Product Name:** Biore Aqua Rich UV Watery Essence\n**Price and Size:** 550+ for 70g\n**Effects/Experience:** Water-based so it doesn't feel sticky and leaves a nice-glowy satin finish. Have repurchased it 100x coz it works great on humid places. Bought another one yesterday in Watson's Gateway 1 branch and the pack comes with a free travel size. So sulit.\nYou can also opt out for a moisturiser and apply this right away as it also acts as a moisturiser\n**Status: HG!!!**\n\\------------------------------------------------------------------\n**Product Name:** Luxe Organix Aqua Daily Sunscreen\n**Price and Size:** 350 for 50ml\n**Effects/Experience:** Water-based too so not as sticky but leaves a shine after applying. If my budget can't fit Biore, I tend to go for this but it runs out quickly as it's only 50 ml and hard to get the remaining products as it's not in a squeezable pack.\nWhen I worked in the office, I typically used this so didn't feel hulas after.\n**Status: WR**\n\\----------------------------------------------------------------\n**Product Name:** Sunplay Menthol\n**Price and Size:** 500? Can't remember the exact price\n**Effects/Experience:** Menthol feeling after applying but has a tone-up effect and not good for commuting.\n**Status: WNR**\n\\--------------------------------------------------------------\n**Product Name:** Oxecure Daily Sunscreen\n**Price and Size:** 490+ for 30g\n**Effects/Experience:** Thick application. Not good for outdoor use, sobrang hulas and lagkit sa feeling. Nakakabreak-out. Only used once.\n**Status: WNR**",
        "skin_type": [
          "Combination"
        ],
        "price_size": "** 490+ for 30g",
        "effects": "** Thick application. Not good for outdoor use, sobrang hulas and lagkit sa feeling. Nakakabreak-out. Only used once.",
        "status": "WNR (Will Not Repurchase)",
        "availability": null,
        "match_confidence": 0.7894736842105263,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrvm962",
        "comment_author": "BrilliantIll7680",
        "comment_score": 5,
        "comment_created_utc": 1747035340.0,
        "comment": "Skin Type: Oily t-zone to Dry cheeks\nProduct Name: Bioré UV Aqua Rich Watery Gel / SPF50 + PA++++\nPrice and Size: 552 php for 70 g\nEffects/Experience: Gel type siya with a creamy white consistency. May tone-up effect siya na minsan hindi ko bet—lalo na kapag nagmamadali akong mag-blend, nagiging reddish or parang grayish ’yung finish. Pero once ma-absorb na ng skin, nawawala naman. Napansin ko na depende talaga sa pag-aapply—nabasa ko rin na best daw if dab dab lang gamit fingers then gently spread, at effective naman ’yun for me. As much as possible, nag-aapply ako sa harap ng electric fan or kapag malamig ’yung paligid kasi mas maganda ’yung lapat.\nNaamoy ko talaga ’yung alcohol, which makes sense kasi may alcohol content siya. May mga nagsabi na nati-tear up or may sting sa mata, pero personally hindi ko naman na-experience ’yun. Dahil may alcohol, mabilis din siyang mag-set sa skin kaya dapat i-blend agad after apply.\nSo far, okay naman siya. No breakouts and bumps. Binili ko lang din talaga ito para mag-try ng ibang Japanese sunscreens since ubos na ’yung Omi Menturm ko. Binili ko pala siya nitong March 20. mag 2 months na rin halos and hindi pa siya ubos.\nStatus: HG, WR if may budget",
        "skin_type": [
          "Oily",
          "Dry"
        ],
        "price_size": "552 php for 70 g",
        "effects": "Gel type siya with a creamy white consistency. May tone-up effect siya na minsan hindi ko bet—lalo na kapag nagmamadali akong mag-blend, nagiging reddish or parang grayish ’yung finish. Pero once ma-absorb na ng skin, nawawala naman. Napansin ko na depende talaga sa pag-aapply—nabasa ko rin na best daw if dab dab lang gamit fingers then gently spread, at effective naman ’yun for me. As much as possible, nag-aapply ako sa harap ng electric fan or kapag malamig ’yung paligid kasi mas maganda ’yung lapat. Naamoy ko talaga ’yung alcohol, which makes sense kasi may alcohol content siya. May mga nagsabi na nati-tear up or may sting sa mata, pero personally hindi ko naman na-experience ’yun. Dahil may alcohol, mabilis din siyang mag-set sa skin kaya dapat i-blend agad after apply. So far, okay naman siya. No breakouts and bumps. Binili ko lang din talaga ito para mag-try ng ibang Japanese sunscreens since ubos na ’yung Omi Menturm ko. Binili ko pala siya nitong March 20. mag 2 months na rin halos and hindi pa siya ubos.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.691358024691358,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrwfk7j",
        "comment_author": "alohacactus_",
        "comment_score": 6,
        "comment_created_utc": 1747051854.0,
        "comment": "Skin Type: Oily, Acne-Prone\n🔆 Bioré UV Aqua Rich Watery Essence SPF 50+ PA++++\nPrice & Size: ₱527 for 70g (Shopee @Smikie Japan. Ph)\nExperience:\nBeen using since 2019 — skin loves it!\nNo breakouts, no white cast, lightweight texture\nGlides on easily, absorbs fast\nLasts 3–4 months with daily use\nStatus: Holy Grail — Everyday essential, repurchase forever ♾️\n⸻\n🔆 Bioré UV Aqua Rich Protect Mist SPF 50+ PA++++\nPrice & Size: ₱614 for 60ml (Shopee @Smikie Japan. Ph)\nExperience:\nUsed for reapplication 2–3x daily\nLightweight, non-sticky, easy to carry\nDoesn’t break out or clog pores\nLasts 3–4 months\nStatus: Holy Grail — Daily reapplication savior, skin feels protected.\n⸻\n🔆 DERMPLUS Moisturizing Sunscreen SPF 60 PA++++ (Brown)\nPrice & Size: ₱495 for 100ml | ₱84 for 15ml sachet (Watsons)\nExperience:\nFavorite for beach and outdoor activities\nHeavy and slightly oily texture but deeply hydrating\nSpreads easily, protects well from harsh sun\nSlightly greasy feel, but worth it for strong protection\nStatus: Holy Grail — Family staple, trusted for outdoor protection! 🔆🌺✨",
        "skin_type": [
          "Oily",
          "Acne Prone"
        ],
        "price_size": "₱495 for 100ml | ₱84 for 15ml sachet (Watsons)",
        "effects": "Favorite for beach and outdoor activities Heavy and slightly oily texture but deeply hydrating Spreads easily, protects well from harsh sun Slightly greasy feel, but worth it for strong protection",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.7727272727272727,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrvwznj",
        "comment_author": "kaeya_x",
        "comment_score": 4,
        "comment_created_utc": 1747042350.0,
        "comment": "**Skin Type:** Oily\n**Product Name:** Bioré UV Aqua Rich Watery Essence\n**Price and Size:** ₱500+ for 70g (recently repurchased from Watsons na may small travel-sized bottle freebie!)\n**Effects/Experience:** First sunscreen I’ve tried that didn’t feel heavy! I use this as my primer and my makeup is long lasting. 😩 This is what I used during a concert last month.\n**Status:** HG\n___________\n**Product Name:** Face Republic Purity Sun Essence\n**Price and Size:** ₱400+ for 50ml\n**Effects/Experience:** Too watery for my liking but still works great! Though for this I still need to apply primer before everything else so I just use this when I’m going for a barefaced look.\n**Status:** WR",
        "skin_type": [
          "Oily"
        ],
        "price_size": "** ₱400+ for 50ml",
        "effects": "** Too watery for my liking but still works great! Though for this I still need to apply primer before everything else so I just use this when I’m going for a barefaced look.",
        "status": "WR (Will Repurchase)",
        "availability": null,
        "match_confidence": 0.8421052631578947,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrw8sfk",
        "comment_author": "mynamesendearment",
        "comment_score": 2,
        "comment_created_utc": 1747048833.0,
        "comment": "Skin type: Combination, sensitive\nProduct Name: Bioré UV Aqua Rich Watery Essence\nPrice and Size: ₱552 for 70g\nEffect and Experience: No white cast, I use it as my make up base na rin hihi. Of all the sunscreens that I have tried so far ito lang talaga yung hiyang ako knowing din na super sensitive ng face ko sa new products na naiintroduce. The dry patches that I have also disappears\nstatus: WR too soon to tell if holy grail ko siya",
        "skin_type": [
          "Combination",
          "Sensitive"
        ],
        "price_size": "₱552 for 70g",
        "effects": "No white cast, I use it as my make up base na rin hihi. Of all the sunscreens that I have tried so far ito lang talaga yung hiyang ako knowing din na super sensitive ng face ko sa new products na naiintroduce. The dry patches that I have also disappears",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.8421052631578947,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrw31hh",
        "comment_author": "Legendary_patatas",
        "comment_score": 1,
        "comment_created_utc": 1747045947.0,
        "comment": ">Biore UV Aqua Rich Watery Essence SPF 50\nNagbago na na packaging neto? Hindi ko kasi mahanap sa watsons.",
        "skin_type": [],
        "price_size": null,
        "effects": null,
        "status": null,
        "availability": null,
        "match_confidence": 0.8433734939759037,
        "product_type": "Sunscreen"
      }
    ],
    "posts_count": 0,
    "comments_count": 10
  },
  "Nivea Derma Skin Clear Deep Pore Cleanser": {
    "product_name": "Nivea Derma Skin Clear Deep Pore Cleanser",
    "product_type": "Cleanser",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "j9nztrk",
        "comment_author": null,
        "comment_score": 8,
        "comment_created_utc": 1677145713.0,
        "comment": "**Skin Type:** Oily, sensitive, gets pimple occasionally (puyat, period, stress etc)\n**Product Name:**\nIsntree Hyaluronic Acid Watery Sun Gel\nBiore UV Watery Essence\n**Price and Size:**\nIsntree ~₱500 for 50ml\nBiore ~₱500 for 50g\n**Effects/Experience:**\nIsntree. No whitecast! Dewy finish. Didnt get breakout or what. Super moisturizing! Kaya I skip na my usual moisturizer in the morning. A little goes a long way pero generous ako mag apply ng sunscreen lol. Downside lang pala nito hindi water resistant.\nBiore. I have Biore for back up whenever I go swimming or do water activities. But since di naman ako nagbbeach lately, Isntree talaga gamit ko indoor and outdoor. Issue ko lang sa Biore, sobrang oily ko after huhu kaya pang water ko lang talaga sya ginagamit. May strong scent din pala to upon application.\n**Status:** both HG 🥰",
        "skin_type": [
          "Oily",
          "Sensitive"
        ],
        "price_size": "**",
        "effects": "** Isntree. No whitecast! Dewy finish. Didnt get breakout or what. Super moisturizing! Kaya I skip na my usual moisturizer in the morning. A little goes a long way pero generous ako mag apply ng sunscreen lol. Downside lang pala nito hindi water resistant. Biore. I have Biore for back up whenever I go swimming or do water activities. But since di naman ako nagbbeach lately, Isntree talaga gamit ko indoor and outdoor. Issue ko lang sa Biore, sobrang oily ko after huhu kaya pang water ko lang talaga sya ginagamit. May strong scent din pala to upon application.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.8,
        "product_type": "Cleanser"
      },
      {
        "comment_id": "lbkuvqw",
        "comment_author": null,
        "comment_score": 1,
        "comment_created_utc": 1720089657.0,
        "comment": "**Skin Type:** oily skin\n**Product Name:**\n# Skinis Sunprotector Cream SPF50 10g plus VIT E and ANTIOXIDANTS\n**Price and Size: 80 pesos and 10grams**\n**Effects/Experience: magaan sa mukha, and effective siya for me**\n**Status:** WR",
        "skin_type": [
          "Oily"
        ],
        "price_size": "80 pesos and 10grams**",
        "effects": "magaan sa mukha, and effective siya for me**",
        "status": "WR (Will Repurchase)",
        "availability": null,
        "match_confidence": 0.8,
        "product_type": "Cleanser"
      }
    ],
    "posts_count": 0,
    "comments_count": 2
  },
  "Anessa Perfect UV Sunscreen Skin Care Milk": {
    "product_name": "Anessa Perfect UV Sunscreen Skin Care Milk",
    "product_type": "Sunscreen",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "j9v20vj",
        "comment_author": "doyeonse",
        "comment_score": 6,
        "comment_created_utc": 1677267426.0,
        "comment": "Skin Type: Combination\nProduct Name: Anessa Perfect UV Sunscreen\nPrice and Size: 1990 for 60ml on shopee\nEffects/Experience: For me, this is the best best sunscreen I have ever tried. It feels weightless on the skin. It doesn't ruin your makeup. Commuter-friendly din! Medyo pricey pero I feel like worth it naman kasi I have never tried something I liked as much as this!\n____________\nSkin Type: Combination\nProduct Name: I'm Meme I'm Super Light Oil Sun Base\nPrice and Size: 442 for 40 ml (but there are several promo bundles on this product)\nEffects/Experience: Not worth it in my opinion. I got the bundle during a payday sale so it was much cheaper but I still think not worth it for me just because I ended up just giving it away. It ruined my makeup after less than 2 hours. Hulas na hulas talaga. It also made my pores feel congested for some reason. I don't think it's for me but if you really want to try it out, get it on a sale. I got my oil cut powder pact + sun base bundle for only ₱231 so I don't think completely nalugi ako.",
        "skin_type": [
          "Combination"
        ],
        "price_size": "442 for 40 ml (but there are several promo bundles on this product)",
        "effects": "Not worth it in my opinion. I got the bundle during a payday sale so it was much cheaper but I still think not worth it for me just because I ended up just giving it away. It ruined my makeup after less than 2 hours. Hulas na hulas talaga. It also made my pores feel congested for some reason. I don't think it's for me but if you really want to try it out, get it on a sale. I got my oil cut powder pact + sun base bundle for only ₱231 so I don't think completely nalugi ako.",
        "status": null,
        "availability": null,
        "match_confidence": 0.8,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "kvnzn83",
        "comment_author": "manilaxla",
        "comment_score": 10,
        "comment_created_utc": 1710895861.0,
        "comment": "Skin Type: Dry\nProduct Name: Anessa Perfect UV Sunscreen Mild Milk 50 SPF\nPrice and Size: Php1990 60ml\nEffects/Experience: Because of my skin type, I use products without alcohol and Anessa Mild Milk doesn't have alcohol. It dries down well and gives a slight sheen. I do not use make up primer and my make up lasts all day.\nStatus: HG",
        "skin_type": [],
        "price_size": "Php1990 60ml",
        "effects": null,
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.7906976744186046,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "kvw0dwa",
        "comment_author": "Careless_Produce9410",
        "comment_score": 3,
        "comment_created_utc": 1711029400.0,
        "comment": "Skin Type: Oily\nProduct Name: ANESSA\nPrice and Size: starts at Php1,400+\nEffects/Experience: I’ve been using this for years and it’s perfect for oily skin. No white cast at all and one can easily reapply it a few times a day, although consistency is a bit runny. It doesn’t clog my pores and I use this everyday. I would highly recommend.\nStatus: HG, WR ⭐️⭐️⭐️⭐️⭐️",
        "skin_type": [
          "Oily"
        ],
        "price_size": "starts at Php1,400+",
        "effects": "I’ve been using this for years and it’s perfect for oily skin. No white cast at all and one can easily reapply it a few times a day, although consistency is a bit runny. It doesn’t clog my pores and I use this everyday. I would highly recommend.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.8,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "ms0nmh9",
        "comment_author": "emmanuelle-mimieux",
        "comment_score": 20,
        "comment_created_utc": 1747100223.0,
        "comment": "Skin type: Combination\nProduct Name: Anessa Perfect UV Brightening Sunscreen Skincare Gel 50 SPF\nPrice and Size: Bought mine for 1,030 pesos / 90g\nEffects/Experience:\n- Really gives you that radiant glow after application due to its tone-up effect\n- Does not leave any white cast but you must apply it properly\n- Super light-weight!\n- Noticed that I sweat and oil less once it is applied\n- Did not experience any breakouts\nStatus: HG",
        "skin_type": [
          "Combination"
        ],
        "price_size": "Bought mine for 1,030 pesos / 90g",
        "effects": "- Really gives you that radiant glow after application due to its tone-up effect - Does not leave any white cast but you must apply it properly - Super light-weight! - Noticed that I sweat and oil less once it is applied - Did not experience any breakouts",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.7524752475247525,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrw4jbz",
        "comment_author": "sakayatanaka",
        "comment_score": 15,
        "comment_created_utc": 1747046740.0,
        "comment": "Skin Type: Oily\nProduct Name: Anessa\nPrice and Size: 1,500+ and 60mL\nEffects/Experience: doesnt make my face more oily. found a lot of sunscreen tests and it always had the best result\nStatus: HG!!!!",
        "skin_type": [
          "Oily"
        ],
        "price_size": "1,500+ and 60mL",
        "effects": "doesnt make my face more oily. found a lot of sunscreen tests and it always had the best result",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.8,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrvu668",
        "comment_author": "Secret-Guarantee-708",
        "comment_score": 3,
        "comment_created_utc": 1747040500.0,
        "comment": "Skin Type: Normal (I used to be combination but i had a really bad allergy attack last year which led to my skin being dry, then now i’m normal)\nProduct Name: Anessa Perfect UV Sunscreen Skincare Gel SPF50+ PA++++\nPrice and Size: P1,416 | 90g (based online) / Anessa throws promos every now and then on diff apps\nEffects & Experience: All in one sunscreen + makeup base/primer. It really healed my skin overall, especially when I had out-of-nowhere allergies H2 onwards of last year. I love that it leaves a dewy glow and not a white cast. Quite pricey but I learned that if a specific product works wonders for your skin, it’s an investment more than anything else. Plus, it’s a Japanese product so 💯\nPS: for dry skin girlies, best to use water-based sunscreen (gels) as it should hydrate/rehydrate your skin!\nStatus: HG",
        "skin_type": [
          "Normal",
          "Combination",
          "Dry"
        ],
        "price_size": "All in one sunscreen + makeup base/primer. It really healed my skin overall, especially when I had out-of-nowhere allergies H2 onwards of last year. I love that it leaves a dewy glow and not a white cast. Quite pricey but I learned that if a specific product works wonders for your skin, it’s an investment more than anything else. Plus, it’s a Japanese product so 💯",
        "effects": null,
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.8351648351648352,
        "product_type": "Sunscreen"
      }
    ],
    "posts_count": 0,
    "comments_count": 6
  },
  "Beauty of Joseon Relief Sun Sunscreen: Rice + Probiotics": {
    "product_name": "Beauty of Joseon Relief Sun Sunscreen: Rice + Probiotics",
    "product_type": "Sunscreen",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "jabsqec",
        "comment_author": "lanwangjisus",
        "comment_score": 5,
        "comment_created_utc": 1677571697.0,
        "comment": "**Skin Type:** Normal to Oily, Sensitive, Acne-prone\n**Product Name:** Beauty of Joseon Relief Sun: Rice + Probiotics (SPF50+ PA++++)\n**Price and Size:** 145 for 10 ml, bought this from Shopee\n**Effects/Experience:** There was a slight sting after my first initial application, pero after ilang use ulit, wala na. It did not break me out which was great and there was no further irritation. However, it sits on my skin after application and leaves a shine on it. It's a combination of dewy/greasy skin kung susumahin ko hahaha. I think it's a good combo for sunscreen and moisturizer. Yun nga lang, it makes me oily after ilang hours kahit nasa bahay lang ako. I don't think this would be a great sunscreen for me if I'm going out/commuting dahil sure na mas magiging oily yung face ko dito after sweating.\n**Status:** WR lang because it works for me but makes my face oily.",
        "skin_type": [
          "Normal",
          "Oily",
          "Sensitive",
          "Acne Prone"
        ],
        "price_size": "** 145 for 10 ml, bought this from Shopee",
        "effects": "** There was a slight sting after my first initial application, pero after ilang use ulit, wala na. It did not break me out which was great and there was no further irritation. However, it sits on my skin after application and leaves a shine on it. It's a combination of dewy/greasy skin kung susumahin ko hahaha. I think it's a good combo for sunscreen and moisturizer. Yun nga lang, it makes me oily after ilang hours kahit nasa bahay lang ako. I don't think this would be a great sunscreen for me if I'm going out/commuting dahil sure na mas magiging oily yung face ko dito after sweating.",
        "status": "WR (Will Repurchase)",
        "availability": null,
        "match_confidence": 0.8080808080808081,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "ja1yhuw",
        "comment_author": "eyka07",
        "comment_score": 5,
        "comment_created_utc": 1677391422.0,
        "comment": "SKIN TYPE: Combination\nPRODUCT NAME: BEAUTY OF JOSEON RELIEF SUN: RICE AND PROBIOTICS SPF50PA++++\nPRICE AND SIZE: 50 ML 624PHP\nEFFECTS/EXPERIENCE:\nHad breakouts the first time I used this with Paula's Choice AHA/BHA (basta yung bottle) so I don't recommend using it with toners of the same nature (acidic??) Kapag wala namang ganon before you apply the sunscreen it feels fine. Hindi naman heavy ang feeling pero kinda sticky at may chemical amoy. It doesn't brighten up your skin talagang flat, malagkit (rather than glowy) finish sya. Yes nabudol ako ng viral influencers dito lol\nWILL NOT REBUY ang verdict dahil-\nPRODUCT NAME: Issy and Co Active Skin SPF 35 in SAND\nPRICE AND SIZE: 35 ML 499PHP\nEFFECTS/EXPERIENCE:\nDahil I prefer this over BOJ. I know, I know, hindi siya \"sunscreen\" mas skin tint/moisturizer siya accdg sa label pero I use this as my daily base instead of foundation. I prefer this over BOJ kase magaan sya sa skin pero it brightens my complexion. Saks ang effect at size for the price pero I really wish it contains more product.\nNaka-ilang REBUY na ako nito pero I am willing to buy another product that delivers the same effects with more product in the container. Now that I think about it, parang mas sustainable choice if madaling maubos kase if sawa ka na agad sa product, before you know it, you're already halfway through the bottle lol. Maunti siya talaga.\nEDIT: ISSY AND CO ay madali ring magtransfer sa face mask eh I dont put a powder on top of it pa man din. Kaya looking for alternative rin ako lol",
        "skin_type": [
          "Combination"
        ],
        "price_size": "35 ML 499PHP",
        "effects": "Dahil I prefer this over BOJ. I know, I know, hindi siya \"sunscreen\" mas skin tint/moisturizer siya accdg sa label pero I use this as my daily base instead of foundation. I prefer this over BOJ kase magaan sya sa skin pero it brightens my complexion. Saks ang effect at size for the price pero I really wish it contains more product. Naka-ilang REBUY na ako nito pero I am willing to buy another product that delivers the same effects with more product in the container. Now that I think about it, parang mas sustainable choice if madaling maubos kase if sawa ka na agad sa product, before you know it, you're already halfway through the bottle lol. Maunti siya talaga. EDIT: ISSY AND CO ay madali ring magtransfer sa face mask eh I dont put a powder on top of it pa man din. Kaya looking for alternative rin ako lol",
        "status": null,
        "availability": null,
        "match_confidence": 0.8163265306122449,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "j9o6ytf",
        "comment_author": null,
        "comment_score": 2,
        "comment_created_utc": 1677151528.0,
        "comment": "Skin Type:  Combination, dry-leaning with a tendency to get oily in the T-zone\nProduct Name:  Beauty of Joseon Relief Sun SPF50 PA++++\nPrice and Size:  50ml, around Php600.00\nEffects/Experience:  I like the finish of this sunscreen. It reminds me of Cosrx Aloe Soothing Sun Cream, but this feels a little heavier and \"harder\" to spread. It's thick but like I said in another comment, I really dig moisturizing sunscreens so it's not an issue for me. It just might feel too much for oiler skin types. It's a nice makeup primer as well because it has that almost gripping finish.\nI really wanted to love this but it irritated my skin. It didn't break me out in visible acne, just gave me rougher skin texture and tiny, under-the-skin bumps. I suspect it's the fermented ingredient as this is also what the Cosrx Galactomyces Essence did to my face.\nStatus: (HG for Holy Grail, WR for Will Repurchase, WNR for Will Not Repurchase) WNR",
        "skin_type": [],
        "price_size": "50ml, around Php600.00",
        "effects": null,
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.6746987951807228,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "kvplyj3",
        "comment_author": "Novel_Basis6076",
        "comment_score": 5,
        "comment_created_utc": 1710929141.0,
        "comment": "Skin Type: Dry-Combination\nProduct Name: Beauty Of Joseon\nPrice and Size: ₱580-650 / 50ml\nEffects/Experience: It’s lightweight, no white cast, hydrating and I like how it’s not sticky or drying on my face and it gives you that glow.\nStatus: HG. I’ve been using this since 2021 and never tried any sunscreen since then",
        "skin_type": [
          "Dry",
          "Combination"
        ],
        "price_size": "₱580-650 / 50ml",
        "effects": "It’s lightweight, no white cast, hydrating and I like how it’s not sticky or drying on my face and it gives you that glow.",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.8,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrvxjyl",
        "comment_author": "anon_armadillo",
        "comment_score": 6,
        "comment_created_utc": 1747042704.0,
        "comment": "✨FOR FACE✨\nSkin Type: combination (not sure if ganun pa rin until now)\nProduct Name: Beauty of Joseon Relief Sun\nPrice and Size: 500-600Php, 50ml\nEffects/Experience:\n- 🤩Read & seen many good reviews, so I tried it myself. I do many outdoor movements bcs of work, and I think BOJ does its job naman as a sunscreen.\n- Feels light on skin, easily blends & does not leave any whitecast or icky feeling, esp when face becomes oily or sweaty!!\n- Some say you can skip your moisturizer too bcs BOJ is very hydrating na rin—I agree! This is the ONLY thing I put on my face every morning after cleanser. No bad effects on my skin naman after having used it for a year (or more); face feels hydrated & protected from the sun!\n- One 50ml tube lasted for 3 to 4 months for me, so i can say sulit na rin for it’s price\nStatus: HG!\n✨✨✨\nAs for body sunscreen, I currently make do w/ Kojie-san Skin Lightening Body Lotion w/ SPF25 w/c I just bought from watsons. Ok naman consistency & smell, tho I feel like my arms turn grayish agad pag naaarawan. I’ll be scanning through the thread pa for more body sunscreen recos!",
        "skin_type": [
          "Combination"
        ],
        "price_size": "500-600Php, 50ml",
        "effects": "- 🤩Read & seen many good reviews, so I tried it myself. I do many outdoor movements bcs of work, and I think BOJ does its job naman as a sunscreen. - Feels light on skin, easily blends & does not leave any whitecast or icky feeling, esp when face becomes oily or sweaty!! - Some say you can skip your moisturizer too bcs BOJ is very hydrating na rin—I agree! This is the ONLY thing I put on my face every morning after cleanser. No bad effects on my skin naman after having used it for a year (or more); face feels hydrated & protected from the sun! - One 50ml tube lasted for 3 to 4 months for me, so i can say sulit na rin for it’s price",
        "status": "HG (Holy Grail)",
        "availability": null,
        "match_confidence": 0.8,
        "product_type": "Sunscreen"
      },
      {
        "comment_id": "mrw90sl",
        "comment_author": "reihinno",
        "comment_score": 5,
        "comment_created_utc": 1747048944.0,
        "comment": "**Skin Type:** Combination\n**Product Name: Beauty of Joseon Relief Sun Aqua Fresh: Rice + B5**\n**Price and Size:** ₱ 1,050 for 50 ml (Watsons)\n**Effects/Experience:** Lightweight and easily blendable with no white cast. ✨ Leaves a slightly dewy finish (though I personally prefer powdery finish like Biore Perfect Bright Face Milk). Helped calm my forehead, which was irritated by malassezia. Some reviews mention pilling, but I didn’t experience any.\n**Status:** WR",
        "skin_type": [
          "Combination"
        ],
        "price_size": "** ₱ 1,050 for 50 ml (Watsons)",
        "effects": "** Lightweight and easily blendable with no white cast. ✨ Leaves a slightly dewy finish (though I personally prefer powdery finish like Biore Perfect Bright Face Milk). Helped calm my forehead, which was irritated by malassezia. Some reviews mention pilling, but I didn’t experience any.",
        "status": "WR (Will Repurchase)",
        "availability": null,
        "match_confidence": 0.7526881720430108,
        "product_type": "Sunscreen"
      }
    ],
    "posts_count": 0,
    "comments_count": 6
  },
  "Missha Safe Block Waterproof Sun Milk Sunscreen": {
    "product_name": "Missha Safe Block Waterproof Sun Milk Sunscreen",
    "product_type": "Sunscreen",
    "posts": [],
    "megathread_comments": [
      {
        "comment_id": "j9ndwub",
        "comment_author": "waveitdowninside",
        "comment_score": 2,
        "comment_created_utc": 1677129415.0,
        "comment": "Skin Type:Combination\nProduct Name: Missha Waterproof Sun Milk SPF50 PA++++\nPrice and Size: Around P700 for 70ml\nEffects/Experience: Great for everyday use, I work outdoors sometimes + have oily area on my skin so it's sweatproof and humidity proof; no whitecast. On my 3rd bottle. Slight issue that it's been making my skin a little oily which it didn't before, so while I'm looking for an alternative, I'll be sticking to this.\nStatus: WR",
        "skin_type": [
          "Combination"
        ],
        "price_size": "Around P700 for 70ml",
        "effects": "Great for everyday use, I work outdoors sometimes + have oily area on my skin so it's sweatproof and humidity proof; no whitecast. On my 3rd bottle. Slight issue that it's been making my skin a little oily which it didn't before, so while I'm looking for an alternative, I'll be sticking to this.",
        "status": "WR (Will Repurchase)",
        "availability": null,
        "match_confidence": 0.6829268292682927,
        "product_type": "Sunscreen"
      }
    ],
    "posts_count": 0,
    "comments_count": 1
  },
  "Luxe Organix's Aqua Lock hydrogel cleanser": {
    "product_name": "Luxe Organix's Aqua Lock hydrogel cleanser",
    "product_type": "Cleanser",
    "posts": [
      {
        "post_id": "1kcbilb",
        "post_author": "skincare_chemist19",
        "post_score": 2508,
        "post_created_utc": 1746113246.0,
        "post_title": "Chemist's Review: Luxe Organix Retinol + Gluta Youthful Radiance Whitening Serum Lotion",
        "post_url": "https://reddit.com/r/beautytalkph/comments/1kcbilb/chemists_review_luxe_organix_retinol_gluta/",
        "post_selftext": "Naisipan kong dumaan sa Watsons ngayong araw para bumili ng lotion, dahil paubos na yung ginagamit ko. Nakita ko tong lotion na 'to ng Luxe Organix na naka B1T1 for Php 405, kaya naisipan kong subukan. 2 variant yung binili ko, itong Retinol + Gluta, tsaka yung Niacinamide + Arbutin. \n\nTLDR:\n\nMay microfoaming, malakas ang fragrance, heavier skin feel kumpara sa ibang serum lotions sa Market, mali-mali ang IL, mislabeled dahil imbes na retinol, Retinyl Palmitate ang laman base sa IL. \n\nUnahin muna nating tingnan ang packaging. Sa unang tingin, di nalalayo material sa packaging ng mga serum lotion ng Vaseline. Tho, yung sa Vaseline, rounded yung tabas ng seal ng tube sa both sides, samantalang itong sa LO ay pointed. \n\nSa itsura naman mismo ng laman, off-white na medyo madilaw yung kulay ng lotion. Medyo clumpy din yung itsura pagkalabas nito sa tube, at madali ding mag-break yung emulsion upon skin contact. Malakas yung fragrance nya na dominated ng floral notes. Unang naisip ko nga nung naamoy ko e amoy poon, dahil sa sobrang floral. \n\nMedyo matagal ipahid sa balat, kumpara sa ibang serum lotion na nasubukan ko na. Naka-observe din ako ng microfoaming during application nitong lotion. Ang microfoaming ito yung nagkakaroon ng puti-puting streaks sa balat habang pinapahid ang isang product, kadalasan mga emulsion gaya ng lotion at creams. Ang microfoaming ay dulot ng pagkaka-trap ng air sa product habang ipinapahid sa balat. Kung ikukumpara ko ito sa ibang serum lotion na nagamit ko na (Vaseline Gluta-Hya Serum Burst Lotion, Smoochkins Nia-Arbutin Nano White Serum Lotion), ito yung pinaka heavy ang skin feel. Hindi ko masyadong na-feel yung pagka serum lotion. And lastly naka-experience din ako ng pamumula at pantal sa braso ko after ko gamitin itong lotion na ito. \n\nTumungo naman tayo sa ingredient list. \n\nWater (Aqua), Glycerin, Glyceryl Stearate, Cetyl Stearyl Alcohol, Cetyl Alcohol, Isopropyl Myristate, Fragrance, C15-19 Alkane, Stearyl Alcohol, Phenoxyethanol, Triethanolamine, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Disodium EDTA, Glutathione, Polysorbate 20, Dimethyl Isosorbide, Plukenetia Volubilis Seed Oil, Olea Europaea (Olive) Fruit Oil, Ceramide NP, Mannitol, Pentylene Glycol, CI19140, Phosphatidylcholine, Retinyl Palmitate, Cholesterol, Xanthan Gum, Sodium Chloride, Polyglyceryl-10,  Citric Acid, Tocopherol, Sodium Hyaluronate, Sodium Acetylated Hyaluronate, Sodium Hyaluronate Crosspolymer, Potassium Sorbate, Sodium Benzoate, Hydrolyzed Sodium Hyaluronate Acetyl Tetrapeptide-11, Acetyl Tetrapeptide-9, Ethylhexylglycerin\n\nHindi na talaga nawala ang mga errors sa IL ng mga local products. Di yata talaga uso ipa-check man lang sa regulatory personnel ang IL na ilalagay sa final layout ng packaging bago ang ipa-mass printing. Para sa product na ito, hindi Cetyl Stearyl Alcohol ang tamang INCI name, kung hindi Cetearyl Alcohol. Next, Polyglyceryl-10, what? Incomplete yung ingredient name. Ang daming Polyglyceryl-10 esters na nag eexist, wag nyo na kami paghulain. (Side Note: Ang Polyglyceryl-10 esters ay kadalasang ginagamit as non-ionic emulsifier sa cosmetics.). \n\nPangalawa kong napansin, CI19140. Ang CI19140 ay isang dye na kilala din bilang Tartrazine Yellow or FD&C Yellow #5. Ito yung nagbigay ng medyo madilaw na kulay sa lotion na ito. Konektado ito sa kasunod kong punto. \n\nIkatlo, bakit Retinyl Palmitate ang nakalista dito sa IL? Kaya nyo ba nilagyan ng Yellow #5 ang lotion na ito para magmukhang may retinol, kasi nakakapagdulot ng paninilaw sa mga product ang retinol kapag ihinalo ito? Ngayon, ano ba ang problema kung retinyl palmitate ang nakalagay, imbes na retinol? Ito kasi yun: maliban sa obvious na mislabelling sa product na ito, mas mababa ang potency ng retinyl palmitate kaysa sa retinol. Sa buong retinoid family, ang mga retinyl esters kagaya ng retinyl palmitate ang may pinakamababang potency, dahil kailangan pa nito ng isang extra conversion step (retinyl palmitate -> retinol). Tandaan, ang mga retinoids, kailangang ma-convert into retinoic acid para ma-activate ang retinoic acid receptors natin sa balat at makuha ang benefits. \n\nRetinyl esters -> Retinol -> Retinaldehyde -> Retinoic Acid\n\nKada conversion step, bumababa ang potency ng isang retinoid, kaya sa kaso ng retinyl palmitate, na isang retinyl ester, eto ang may pinakamababang potency. \n\nMay peptides din pala itong lotion na ito: Acetyl Tetrapeptide-9 at Acetyl Tetrapeptide-11.\n\nAng acetyl tetrapeptide-9 ay isang signaling peptide na nagbibigay ng message sa fibroblasts sa ating dermis na magproduce ng collagen (specifically Collagen Type 1) at proteoglycans, na mahalaga para mapanatili ang structure at mapanatiling tight (hindi sagging) ang balat natin.  Nakakatulong din itong mabawasan ang appearance ng fine lines sa mukha, dahil na rin sa stimulation ng collagen at proteoglycan production. \n\nKung ang dermis ang target ng acetyl tetrapeptide-9, ang epidermis naman ang target ng acetyl tetrapeptide-11. Kagaya ng acetyl tetrapeptide-9, signaling peptide din ito na nagbibigay ng mensahe sa epidermis na mag-synthesize o magproduce ng Syndecan-1 at Collagen XVII. Kapag mataas ang dalawang ito sa balat, nag-iimprove ang elasticity ng balat. \n\nKaramihan ng mga nabanggit na benepisyo ng dalawang peptides na ito ay base pa lamang sa mga in-vitro studies na naisagawa na. Wala pang gaanong in-vivo clinical studies na lumabas kaya medyo skeptical pa din ako sa mga peptides na ito. \n\nTumungo naman tayo lastly sa product claims. \n\n* Retinol + Gluta\n\n* Whitening Serum Lotion\n\n* Lightening\n\n* Firming\n\n* Hydrating\n\n* 24 hr Supple Smooth\n\n* 3X Peptide Youth Repair + Hyaluronic Bright + Ceramide Glow\n\nUnang claim pa lang, sablay na. Wala namang retinol tong lotion na 'to. Pinaglololoko ako nitong LO e. \n\nSa claim na lightening at whitening, medyo duda ako. Mukhang glutathione lang ang pwedeng masabi ng brand na ito na skin lightening ingredient. Pero duda ako sa efficacy ng glutathione na makapagpa lighten ng skin topically. Maraming limitations yung mga published studies tungkol sa efficacy ng topically applied gluta, gaya ng mababang bilang ng participants sa studies at sobrang iksi na study period. \n\nSa claim na firming, mukhang inilagay ito gawa nung mga peptides. Sa hydrating claim, meron namang hydrating ingredients (glycerin, hyaluronic acid derivatives, olive oil, Plukenetia Volubilis oil, tsaka Ceramide NP). Same din dun sa mga sumunod na claims, dahil sa presence ng mga nabanggit na ingredients. \n\n\nFinal words:\n\nHindi ako masaya sa nabili kong lotion na 'to. Hindi kasing lightweight at fast absorbing nung iba kong nasubukan na serum lotions. Amoy poon yung fragrance. May microfoaming during application. Nagkapantal ako sa braso. Mali-mali ang IL. Pero yung pinaka disappointing sa lotion na 'to e yung claim na may retinol daw, pero retinyl palmitate lang ang nasa ingredient list. May paglalagay pa ng yellow dye para magmukhang may retinol. Napakalaking red flag para sa akin ang pagmi-mislabel ng product.\n\nAyun lang. Salamat sa pagbabasa. At laging maging mapanuri sa mga binibili at balak nating gamitin na products.",
        "match_confidence": 0.75,
        "skin_type": [],
        "price_size": "Php 405,",
        "status": null,
        "availability": "Watsons"
      }
    ],
    "megathread_comments": [],
    "posts_count": 1,
    "comments_count": 0
  }
}