[
  {
    "product_name": "Nivea Derma Skin Clear Deep Pore Cleanser",
    "posts_count": 1,
    "posts": [
      {
        "post_id": "1j8tuxe",
        "post_author": "Brief-Bee-7315",
        "post_score": 244,
        "post_created_utc": 1741708032.0,
        "post_title": "Nivea Derma Skin Clear Deep Pore Cleanser - Removed my small cheek bumps that seemed like fungal acne",
        "post_url": "https://reddit.com/r/beautytalkph/comments/1j8tuxe/nivea_derma_skin_clear_deep_pore_cleanser_removed/",
        "post_selftext": "I have been using this for a month now. I have combination skin and my cheeks particularly have very small bumps that the facialist said were whiteheads. Every time i get a facial, it gets removed. However, it just comes back. After a month of using this, my cheek bumps are gone. \n\n(I used to use celeteque only)\n\nDefinitely try this!",
        "match_confidence": 0.9,
        "skin_type": [
          "Combination"
        ],
        "price_size": null,
        "status": null,
        "availability": null
      }
    ]
  },
  {
    "product_name": "Cetaphil Gentle Skin Cleanser",
    "posts_count": 1,
    "posts": [
      {
        "post_id": "1i048ay",
        "post_author": "Sapphirie",
        "post_score": 22,
        "post_created_utc": 1736736715.0,
        "post_title": "Review and Experience - SKIN1004, Cetaphil, Benzac, Glow Glass Beauty, and Aestura",
        "post_url": "https://reddit.com/r/beautytalkph/comments/1i048ay/review_and_experience_skin1004_cetaphil_benzac/",
        "post_selftext": "Let me preface this by saying that it took a lot to get to where I am now. I am sure many people with similar concerns have gone through a comparable journey. Finding the right products can be tiring and overwhelming at times.\n\nI come bearing good news for myself and hope to share my experience with anyone who might be facing similar struggles.\n\n**November 2024**\n\nIt was around this time that my skin kept breaking out and felt overworked. It’s already January 2025 as I write this, so it’s a bit hard to describe the feeling exactly—but I felt like my skin was being over-cleansed.\n\n**Previous Routine:**\n\n**AM**\n\n* SKIN1004 Tea-Trica BHA Foam Cleanser\n   * Great daily exfoliant but dried me out too much.\n   * Works well for my mom and daughter.\n* SKIN1004 Madagascar Centella Ampoule\n   * Feels like your skin is drinking water—absolutely love this one!\n* SKIN1004 Madagascar Centella Tea-Trica BS Cream\n   * Feels like a skin balm.\n   * The hyaluronic acid in this formula didn’t work well for me. My skin felt stuck between being moisturized and dry, as the HA kept pulling moisture from my skin instead of locking it in.\n   * I briefly used it over Aveeno Oat Gel (mentioned below) to give the HA something to draw moisture from. That worked, but feels too heavy on the skin.\n* SKIN1004 Madagascar Centella Hyalu-Cica Water-Fit Sun Serum SPF50+ PA++++\n   * A great sunscreen, but since it contains HA, I need to layer it over something hydrating without additional HA.\n\n**PM**\n\n* SKIN1004 Madagascar Centella Light Cleansing Oil\n   * Still using this for makeup removal or when I need a deeper cleanse.\n* SKIN1004 Tea-Trica BHA Foam Cleanser\n* SKIN1004 Madagascar Centella Tea-Trica Purifying Toner\n   * Still a good toner, but it no longer fits my current routine (it doesn’t contain HA).\n* SKIN1004 Madagascar Centella Ampoule\n* SKIN1004 Madagascar Centella Tea-Trica BS Cream\n\nThe SKIN1004 line worked well for me initially. However, after about a year and a half, I noticed my skin’s needs changed—likely due to aging. Here are the products I’ve used since late November and my thoughts on them:\n\n**Product Reviews & Discoveries**\n\n* Cetaphil Gentle Skin Cleanser for Sensitive Skin\n   * Great when my skin feels overworked or over-cleansed.\n   * Not so great at getting all the amount of gunk I put on my face (skincare, I don't wear makeup unless there's an occasion).\n* Cetaphil Moisturizing Lotion with Avocado Oil\n   * This is when I realized that any oil-based moisturizer breaks me out or causes cystic acne.\n* Benzac Benzoyl Peroxide Spot Treatment Gel (5%)\n   * Effective spot treatment.\n   * I apply a thick layer to the affected area and cover it with tissue to keep the ointment in place and protect the spot from sun exposure when used in the morning. The tissue also helps prevent the product from transferring to your clothes or anything.\n* Benzac Microbiome Equaliser\n   * Made my face sting and didn’t provide enough moisture. I now use it on my underarms to avoid wasting it.\n* LUXE ORGANIX Retinol + Bakuchiol Overnight Glow Gentle Treatment Cream Moisturizer\n   * Great as a beginner retinol.\n   * Started with applications every 10 days, then moved to every 7 days, and now use it twice a week.\n   * I use the sandwich method with pea-sized amounts, gradually increasing the application as my skin tolerated it.\n* Glow Glass Ceramide Moisturizer (Cera Glow Healthy Gel Cream)\n   * Previously used this brand and returned to it.\n   * Contains niacinamide, ceramides, and no hyaluronic acid—a good detox moisturizer when I wanted to simplify my routine.\n   * Feels nice but isn’t quite enough for the colder season.\n* Glow Glass AHA BHA Renewing Serum\n   * Repurchased as an exfoliant for my current routine.\n   * Feels great on initial application—didn’t dry me out.\n   * Sometimes causes small breakouts, possibly due to its concentration.\n* Aveeno Calm + Restore Oat Gel Moisturizer\n   * Bought hoping it would be more hydrating.\n   * Good moisturizer but not quite enough for Philippine cold season, LOL.\n* Cetaphil Hydrating Foaming Cream Cleanser\n   * Combines gentleness and cleansing power perfectly—my daily cleanser now.\n   * I alternate with Cetaphil Gentle Skin Cleanser on sensitive days.\n* Aestura AtoBarrier 365 Cream\n   * Holy Grail moisturizer!\n   * A little goes a long way—just a small amount covers my entire face and neck.\n   * Provides amazing hydration and has helped repair my skin barrier. Maybe due to using it in tandem with the SKIN1004 Ampoule too.\n   * I ordered the lighter version (AtoBarrier 365 Lotion) for warmer months and will update after testing.\n\n**Current Routine (Finally Balanced!)**\n\nMy routine alternates between exfoliation, retinol, and moisturizing:\n\n**AM (Daily)**\n\n* Cetaphil Hydrating Foaming Cream Cleanser\n* SKIN1004 Madagascar Centella Ampoule\n* Aestura AtoBarrier 365 Cream\n* SKIN1004 Madagascar Centella Hyalu-Cica Water-Fit Sun Serum SPF50+ PA++++\n\n**PM (Exfoliate)**\n\n* Cetaphil Hydrating Foaming Cream Cleanser\n* SKIN1004 Madagascar Centella Ampoule\n* Glow Glass AHA BHA Renewing Serum\n* Aestura AtoBarrier 365 Cream\n\n**PM (Retinol)**\n\n* Cetaphil Hydrating Foaming Cream Cleanser\n* Glow Glass Ceramide Moisturizer\n* LUXE ORGANIX Retinol + Bakuchiol Overnight Glow Treatment\n* Aestura AtoBarrier 365 Cream\n\n**PM (Moisturize)**\n\n* Cetaphil Hydrating Foaming Cream Cleanser\n* SKIN1004 Madagascar Centella Ampoule\n* Aestura AtoBarrier 365 Cream\n\nOnce I’m confident in this routine, I plan to add Vitamin C after the SKIN1004 Madagascar Centella Ampoule in the mornings.",
        "match_confidence": 0.85,
        "skin_type": [],
        "price_size": null,
        "status": "HG (Holy Grail)",
        "availability": null
      }
    ]
  },
  {
    "product_name": "Cosrx Salicylic Acid Daily Gentle Cleanser",
    "posts_count": 1,
    "posts": [
      {
        "post_id": "dbs0kk",
        "post_author": "rr0596",
        "post_score": 6,
        "post_created_utc": 1569929442.0,
        "post_title": "Anyone here experienced breakout using COSRX Salicylic Acid Daily Gentle Cleanser?",
        "post_url": "https://reddit.com/r/beautytalkph/comments/dbs0kk/anyone_here_experienced_breakout_using_cosrx/",
        "post_selftext": "I've been using this product for almost 2 months already, and I noticed I have several cystic bumps especially on my right cheek. I'm afraid I'm having a breakout and lowkey wishing this is just purging. I want this to be my HG since a lot of people say this product made their skin free from pimples and less oily.",
        "match_confidence": 0.9500000000000001,
        "skin_type": [],
        "price_size": null,
        "status": "HG (Holy Grail)",
        "availability": null
      }
    ]
  },
  {
    "product_name": "Belo Dewy Essence Sunscreen",
    "posts_count": 1,
    "posts": [
      {
        "post_id": "1g28qyp",
        "post_author": "nabannugen",
        "post_score": 5,
        "post_created_utc": 1728763949.0,
        "post_title": "Belo SunExpert Sunspritz and Belo SunExpert Transparent Mist have denatured ethyl alcohol as main ingredient that causes skin dehydration and damage",
        "post_url": "https://reddit.com/r/beautytalkph/comments/1g28qyp/belo_sunexpert_sunspritz_and_belo_sunexpert/",
        "post_selftext": "I learned from my mistake of not checking the ingredients before buying and using the mentioned products. I am sharing this so u may learn as well, without committing the same mistake 🫶🏽\n[Long post ahead]\n\nI was looking for a spray-on sunscreens for face and body bec i was thinking na it may be more hygienic and convenient to use vs the cream ones that i have to apply by hand esp when I'm outdoors.\n\nHiyang ako sa Belo Dewy Essence sunscreen kaya i thought their spray-on sunscreens would also be good for me so i bought and tried it.\n\nI decided to use the sunspritz first and reserve the Transparent Mist for when the first would be finished. When i used the sunspritz, it has a plastic-y smell, was oily, may stingy feeling sa mukha that i thought might just be the cooling menthol effect i read in one review in a blog, at medyo may hapdi sa mata kahit nakapikit naman ako pag-spray. Inulit kong gamitin with more awareness sa effects nya, thinking that the effects i felt before were just because my skin is just not yet used to the product. Pagka-spray ko, ganon pa rin yung experience like the first time; it made me nervous pa to inhale after spraying kasi medyo may tapang yung amoy.\n\nNapa-isip na ako kung itutuloy ko pa bang gamitin yung sunspritz. It was just then that i looked at the ingredients and compared it to the Dewy Essence to see why it has different effects on my skin (see pics 2 & 3). (The ingredients are listed on the product packagings but i attached ss from belo and watsons sites for clearer images)\n\n DENATURED ETHYL ALCOHOL is listed as the main ingredient in the Sunspritz, but it is not included in the Dewy Essence, plus i generally know that alcohol is not good for the face so i researched some more abt it and its effects (see pics 4-8).\n\nAlarmed abt these findings, i checked the ingredients for the Transparent Mist and found denat ethyl alc as its main ingredient as well! (See pic 9). I also found a tiktok vid abt this product and read the comments that say same things as what i experienced with the Sunspritz: https://vt.tiktok.com/ZS2TEGfuE/\n\nIt is trust-breaking and concerning to find that the products made and advertised by an established beauty line as ones that would \"[deliver] instant freshness and hydration...\" is using an unsafe alcohol that gives off the \"cooling menthol-ly effect\" and is just too oily to cover up the reality that it is dehydrating your skin.\n\nAgain, I already learned from my mistake of not checking the ingredients before buying and using the mentioned products. I hope my fellow beauty-product-users will take this as a lesson to check the product's ingredients first before purchasing.\n\nFor more info abt other facial products that contain denat ethyl alcohol, you may want to chech this out:\nhttps://incidecoder.com/ingredients/alcohol-denat#details\n\nThat's all. Love lots 🩷",
        "match_confidence": 0.85,
        "skin_type": [],
        "price_size": null,
        "status": null,
        "availability": "Watsons"
      }
    ]
  }
]