[
  {
    "product_name": "Luxe Organix's Aqua Lock hydrogel cleanser",
    "posts_count": 1,
    "posts": [
      {
        "post_id": "1kcbilb",
        "post_author": "skincare_chemist19",
        "post_score": 2508,
        "post_created_utc": 1746113246.0,
        "post_title": "Chemist's Review: Luxe Organix Retinol + Gluta Youthful Radiance Whitening Serum Lotion",
        "post_url": "https://reddit.com/r/beautytalkph/comments/1kcbilb/chemists_review_luxe_organix_retinol_gluta/",
        "post_selftext": "Naisipan kong dumaan sa Watsons ngayong araw para bumili ng lotion, dahil paubos na yung ginagamit ko. Nakita ko tong lotion na 'to ng Luxe Organix na naka B1T1 for Php 405, kaya naisipan kong subukan. 2 variant yung binili ko, itong Retinol + Gluta, tsaka yung Niacinamide + Arbutin. \n\nTLDR:\n\nMay microfoaming, malakas ang fragrance, heavier skin feel kumpara sa ibang serum lotions sa Market, mali-mali ang IL, mislabeled dahil imbes na retinol, Retinyl Palmitate ang laman base sa IL. \n\nUnahin muna nating tingnan ang packaging. Sa unang tingin, di nalalayo material sa packaging ng mga serum lotion ng Vaseline. Tho, yung sa Vaseline, rounded yung tabas ng seal ng tube sa both sides, samantalang itong sa LO ay pointed. \n\nSa itsura naman mismo ng laman, off-white na medyo madilaw yung kulay ng lotion. Medyo clumpy din yung itsura pagkalabas nito sa tube, at madali ding mag-break yung emulsion upon skin contact. Malakas yung fragrance nya na dominated ng floral notes. Unang naisip ko nga nung naamoy ko e amoy poon, dahil sa sobrang floral. \n\nMedyo matagal ipahid sa balat, kumpara sa ibang serum lotion na nasubukan ko na. Naka-observe din ako ng microfoaming during application nitong lotion. Ang microfoaming ito yung nagkakaroon ng puti-puting streaks sa balat habang pinapahid ang isang product, kadalasan mga emulsion gaya ng lotion at creams. Ang microfoaming ay dulot ng pagkaka-trap ng air sa product habang ipinapahid sa balat. Kung ikukumpara ko ito sa ibang serum lotion na nagamit ko na (Vaseline Gluta-Hya Serum Burst Lotion, Smoochkins Nia-Arbutin Nano White Serum Lotion), ito yung pinaka heavy ang skin feel. Hindi ko masyadong na-feel yung pagka serum lotion. And lastly naka-experience din ako ng pamumula at pantal sa braso ko after ko gamitin itong lotion na ito. \n\nTumungo naman tayo sa ingredient list. \n\nWater (Aqua), Glycerin, Glyceryl Stearate, Cetyl Stearyl Alcohol, Cetyl Alcohol, Isopropyl Myristate, Fragrance, C15-19 Alkane, Stearyl Alcohol, Phenoxyethanol, Triethanolamine, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Disodium EDTA, Glutathione, Polysorbate 20, Dimethyl Isosorbide, Plukenetia Volubilis Seed Oil, Olea Europaea (Olive) Fruit Oil, Ceramide NP, Mannitol, Pentylene Glycol, CI19140, Phosphatidylcholine, Retinyl Palmitate, Cholesterol, Xanthan Gum, Sodium Chloride, Polyglyceryl-10,  Citric Acid, Tocopherol, Sodium Hyaluronate, Sodium Acetylated Hyaluronate, Sodium Hyaluronate Crosspolymer, Potassium Sorbate, Sodium Benzoate, Hydrolyzed Sodium Hyaluronate Acetyl Tetrapeptide-11, Acetyl Tetrapeptide-9, Ethylhexylglycerin\n\nHindi na talaga nawala ang mga errors sa IL ng mga local products. Di yata talaga uso ipa-check man lang sa regulatory personnel ang IL na ilalagay sa final layout ng packaging bago ang ipa-mass printing. Para sa product na ito, hindi Cetyl Stearyl Alcohol ang tamang INCI name, kung hindi Cetearyl Alcohol. Next, Polyglyceryl-10, what? Incomplete yung ingredient name. Ang daming Polyglyceryl-10 esters na nag eexist, wag nyo na kami paghulain. (Side Note: Ang Polyglyceryl-10 esters ay kadalasang ginagamit as non-ionic emulsifier sa cosmetics.). \n\nPangalawa kong napansin, CI19140. Ang CI19140 ay isang dye na kilala din bilang Tartrazine Yellow or FD&C Yellow #5. Ito yung nagbigay ng medyo madilaw na kulay sa lotion na ito. Konektado ito sa kasunod kong punto. \n\nIkatlo, bakit Retinyl Palmitate ang nakalista dito sa IL? Kaya nyo ba nilagyan ng Yellow #5 ang lotion na ito para magmukhang may retinol, kasi nakakapagdulot ng paninilaw sa mga product ang retinol kapag ihinalo ito? Ngayon, ano ba ang problema kung retinyl palmitate ang nakalagay, imbes na retinol? Ito kasi yun: maliban sa obvious na mislabelling sa product na ito, mas mababa ang potency ng retinyl palmitate kaysa sa retinol. Sa buong retinoid family, ang mga retinyl esters kagaya ng retinyl palmitate ang may pinakamababang potency, dahil kailangan pa nito ng isang extra conversion step (retinyl palmitate -> retinol). Tandaan, ang mga retinoids, kailangang ma-convert into retinoic acid para ma-activate ang retinoic acid receptors natin sa balat at makuha ang benefits. \n\nRetinyl esters -> Retinol -> Retinaldehyde -> Retinoic Acid\n\nKada conversion step, bumababa ang potency ng isang retinoid, kaya sa kaso ng retinyl palmitate, na isang retinyl ester, eto ang may pinakamababang potency. \n\nMay peptides din pala itong lotion na ito: Acetyl Tetrapeptide-9 at Acetyl Tetrapeptide-11.\n\nAng acetyl tetrapeptide-9 ay isang signaling peptide na nagbibigay ng message sa fibroblasts sa ating dermis na magproduce ng collagen (specifically Collagen Type 1) at proteoglycans, na mahalaga para mapanatili ang structure at mapanatiling tight (hindi sagging) ang balat natin.  Nakakatulong din itong mabawasan ang appearance ng fine lines sa mukha, dahil na rin sa stimulation ng collagen at proteoglycan production. \n\nKung ang dermis ang target ng acetyl tetrapeptide-9, ang epidermis naman ang target ng acetyl tetrapeptide-11. Kagaya ng acetyl tetrapeptide-9, signaling peptide din ito na nagbibigay ng mensahe sa epidermis na mag-synthesize o magproduce ng Syndecan-1 at Collagen XVII. Kapag mataas ang dalawang ito sa balat, nag-iimprove ang elasticity ng balat. \n\nKaramihan ng mga nabanggit na benepisyo ng dalawang peptides na ito ay base pa lamang sa mga in-vitro studies na naisagawa na. Wala pang gaanong in-vivo clinical studies na lumabas kaya medyo skeptical pa din ako sa mga peptides na ito. \n\nTumungo naman tayo lastly sa product claims. \n\n* Retinol + Gluta\n\n* Whitening Serum Lotion\n\n* Lightening\n\n* Firming\n\n* Hydrating\n\n* 24 hr Supple Smooth\n\n* 3X Peptide Youth Repair + Hyaluronic Bright + Ceramide Glow\n\nUnang claim pa lang, sablay na. Wala namang retinol tong lotion na 'to. Pinaglololoko ako nitong LO e. \n\nSa claim na lightening at whitening, medyo duda ako. Mukhang glutathione lang ang pwedeng masabi ng brand na ito na skin lightening ingredient. Pero duda ako sa efficacy ng glutathione na makapagpa lighten ng skin topically. Maraming limitations yung mga published studies tungkol sa efficacy ng topically applied gluta, gaya ng mababang bilang ng participants sa studies at sobrang iksi na study period. \n\nSa claim na firming, mukhang inilagay ito gawa nung mga peptides. Sa hydrating claim, meron namang hydrating ingredients (glycerin, hyaluronic acid derivatives, olive oil, Plukenetia Volubilis oil, tsaka Ceramide NP). Same din dun sa mga sumunod na claims, dahil sa presence ng mga nabanggit na ingredients. \n\n\nFinal words:\n\nHindi ako masaya sa nabili kong lotion na 'to. Hindi kasing lightweight at fast absorbing nung iba kong nasubukan na serum lotions. Amoy poon yung fragrance. May microfoaming during application. Nagkapantal ako sa braso. Mali-mali ang IL. Pero yung pinaka disappointing sa lotion na 'to e yung claim na may retinol daw, pero retinyl palmitate lang ang nasa ingredient list. May paglalagay pa ng yellow dye para magmukhang may retinol. Napakalaking red flag para sa akin ang pagmi-mislabel ng product.\n\nAyun lang. Salamat sa pagbabasa. At laging maging mapanuri sa mga binibili at balak nating gamitin na products.",
        "match_confidence": 0.75,
        "skin_type": [],
        "price_size": "Php 405,",
        "status": null,
        "availability": "Watsons"
      }
    ]
  },
  {
    "product_name": "Skin Aqua UV Super Moisture Gel Gold Sunscreen",
    "posts_count": 1,
    "posts": [
      {
        "post_id": "1e9d1by",
        "post_author": "AtTheUngodlyHour",
        "post_score": 46,
        "post_created_utc": 1721651266.0,
        "post_title": "Kose Suncut UV Perfect Gel (2024 Reformulation) Review - Perfect for Oily Skin and Active Lifestyles! ",
        "post_url": "https://reddit.com/r/beautytalkph/comments/1e9d1by/kose_suncut_uv_perfect_gel_2024_reformulation/",
        "post_selftext": "Hi everyone!\n\nI wanted to share my thoughts on the Kose Suncut UV Perfect Gel (2024 reformulation). For some background, I have oily skin and use adapalene at night for acne. I’m diligent about my sunscreen use since 2015, as advised by my dermatologist, and I've tried numerous Western and Asian sunscreens over the years. Here’s my experience with the latest version of this sunscreen:\n\n\nWhat I Liked:\n\n1. True gel consistency: Just like the old version, this sunscreen has a true gel consistency that dries down with almost no greasy feeling. It dries down to a natural finish (not dewy, not matte).\n   \n2. Does not pill: One of the biggest issues I had with the previous version was that it would pill when I accidentally touch it while it dries. Also, the old formula pills when friction was applied. This new formulation has completely resolved that problem.\n\n3. Water resistance: As someone with an active lifestyle who sweats a lot, I always use a water resistant sunscreen when doing outdoor activities. When I tried this, I noticed that it stays on my face despite sweating and (lightly) wiping sweat a lot.\n\n4. Works well under makeup: I’ve tried this under my foundation, and it blends seamlessly. Unlike other water-resistant gel sunscreens like Skin Aqua Super Moisture Barrier UV Gel and Biore Aqua Rich Watery Essence, this one didn’t cause me to oil up throughout the day.\n\n5. Not drying or stinging: Even though it contains alcohol, it doesn’t feel drying or sting my skin. \n\n6. No white cast! \n\n7. No added fragrance: This has a bit of an alcohol smell but when it dries down, the scent fades.\n\n\nCons:\n\n1. Alcohol Ingredient: This may not be for those who are sensitive to alcohol. \n\n2. Not readily available in physical stores in the Philippines.",
        "match_confidence": 0.75,
        "skin_type": [
          "Oily"
        ],
        "price_size": null,
        "status": null,
        "availability": "Physical stores in the philippines"
      }
    ]
  }
]