[
  {
    "skin_type": [
      "Oily",
      "Combination"
    ],
    "product_name": "Cosrx Salicylic Acid Daily Gentle Cleanser",
    "price_size": "Varies but less than ₱300 for 150ml when you get it on discount (online)!",
    "effects": "Have been using this for around 4-5 years and this helped remove excess sebum talaga. Controlled my oil, helped with breakouts, gentle and very low % of salicylic so for everyday talaga. This is a very well known product that I assume has been tried by many, but still want to recommend it because it’s that effective. My first korean product and I still love it to this day! Disclaimer: this is more for oily/combi skin. Dry skin is not hiyang with this I think.",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "Skin Type: Oily / Combi\nProduct Name: Cosrx Salicylic Acid Daily Gentle Cleanser\nType: Foam\nPrice/Quantity: Varies but less than ₱300 for 150ml when you get it on discount (online)!\nEffect/experience: Have been using this for around 4-5 years and this helped remove excess sebum talaga. Controlled my oil, helped with breakouts, gentle and very low % of salicylic so for everyday talaga. This is a very well known product that I assume has been tried by many, but still want to recommend it because it’s that effective. My first korean product and I still love it to this day! Disclaimer: this is more for oily/combi skin. Dry skin is not hiyang with this I think.\nStatus: HG!!!!! 🩷🩷🩷",
    "comment_id": "l7o5i1r",
    "comment_score": 14,
    "comment_created_utc": 1717851801.0,
    "comment_author": "toorusgf",
    "match_confidence": 1.0,
    "matched_product": "Cosrx Salicylic Acid Daily Gentle Cleanser"
  },
  {
    "skin_type": [
      "Combination",
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Pyunkang Yul Acne Facial Cleanser",
    "price_size": "950 pesos/156 mL",
    "effects": "My mistake buying the 10% right off the bat 💀💀. I borrowed my mom’s 10% panoxyl benzoyl p. wash before and now that I moved out i ordered my own and bought the 10% na agad figuring that i can tolerate it naman na. When it arrived, that’s when i realized na fake pala gamit ng nanay ko and damn this stings so muchhh. I tried applying it every other day the first few weeks and minsan parang spot treatment lang, like ibababad ko one thick layer of wash sa active pimple ko for 1-3 mins bc i felt like the rest of my face couldn’t take the whole product. It works SO FAST. Literal parang kusa na lang nagpupush out yung pus palabas as i’m washing it off. Then I slap a pimple patch pag di pa completely natanggal yung pus. Perfect combination. Now I use it once a day and apply it to the T-zone since dun lang naman ako tinitigyawat at pansin ko ang galing din niya magexfoliate. Even more effective than the two salicylic products i bought from Cosrx and Skintific. So now I don’t use them anymore, just this panoxyl wash na lang. So yeah siguro advice ko na lang na stick to the 4% concentration if mild-mod acne lang naman and it would work just as well. Otherwise, this product is so good, it killed all my active pimples, prevented future breakouts and works as an exfoliator for me din. HG MATERIAL 👑👑👑",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "Skin Type: combination, oily and acne-prone\nProduct Name: Pyunkang Yul Acne Facial Cleanser\nOrder: First\nType: gel\nPrice/Quantity: 250 pesos/one 120 mL\nEffect/experience: I think this is my fave gentle cleanser na pasok sa budget ko. It’s not stripping and i still feel my natural oils retained after washing with it. It’s best used lalo na after oil cleansing and right before using tretinoin because safe siya sa barrier ko. I love it lol.\nStatus: WR\n———————————————\nProduct Name: PanOxyl 10% Benzoyl Peroxide Acne foaming wash\nOrder: First\nType: cream\nPrice/Quantity: 950 pesos/156 mL\nEffect/experience: My mistake buying the 10% right off the bat 💀💀. I borrowed my mom’s 10% panoxyl benzoyl p. wash before and now that I moved out i ordered my own and bought the 10% na agad figuring that i can tolerate it naman na. When it arrived, that’s when i realized na fake pala gamit ng nanay ko and damn this stings so muchhh.\nI tried applying it every other day the first few weeks and minsan parang spot treatment lang, like ibababad ko one thick layer of wash sa active pimple ko for 1-3 mins bc i felt like the rest of my face couldn’t take the whole product. It works SO FAST. Literal parang kusa na lang nagpupush out yung pus palabas as i’m washing it off. Then I slap a pimple patch pag di pa completely natanggal yung pus. Perfect combination.\nNow I use it once a day and apply it to the T-zone since dun lang naman ako tinitigyawat at pansin ko ang galing din niya magexfoliate. Even more effective than the two salicylic products i bought from Cosrx and Skintific. So now I don’t use them anymore, just this panoxyl wash na lang.\nSo yeah siguro advice ko na lang na stick to the 4% concentration if mild-mod acne lang naman and it would work just as well. Otherwise, this product is so good, it killed all my active pimples, prevented future breakouts and works as an exfoliator for me din. HG MATERIAL 👑👑👑\nStatus: HG 👑😩😩",
    "comment_id": "l7s1tl2",
    "comment_score": 14,
    "comment_created_utc": 1717912133.0,
    "comment_author": null,
    "match_confidence": 1.0,
    "matched_product": "Pyunkang Yul Acne Facial Cleanser"
  },
  {
    "skin_type": [
      "Dry",
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Cetaphil Gentle Skin cleanser (blue cap)",
    "price_size": "smallest is around 300 for 118mls, or around 500 for 250 mls.",
    "effects": "i used to only use Cerave but it's hard to source. Found Cetaphil and it suits me just fine plus it's way cheaper. This cleanser is mild and inoffensive. Perfect especially if like me you use actives in other parts of your routine (vit c, acids, retinol). This doesn't overwhelm my skin, not drying.",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "Skin Type: oily combo sa pinas. Dry combo colder climates. No acne / clear skin, occasional pimples lang once in a blue moon.\nProduct Name: Cetaphil Gentle Skin cleanser (blue cap)\nOrder: Second if I use an oil cleanser. OK sya as only cleanser if you don't wear makeup.\nType: liquid\nPrice/Quantity: smallest is around 300 for 118mls, or around 500 for 250 mls.\nEffect/experience: i used to only use Cerave but it's hard to source. Found Cetaphil and it suits me just fine plus it's way cheaper. This cleanser is mild and inoffensive. Perfect especially if like me you use actives in other parts of your routine (vit c, acids, retinol). This doesn't overwhelm my skin, not drying.\nStatus: WR, HG",
    "comment_id": "l7obmt9",
    "comment_score": 4,
    "comment_created_utc": 1717854582.0,
    "comment_author": "smpllivingthrowaway",
    "match_confidence": 0.8656716417910447,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  },
  {
    "skin_type": [
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Cosrx Salicylic Acid Daily Gentle Cleanser",
    "price_size": "220 (small)",
    "effects": "Unfortunately, this did not work for me. Too drying for my face and may stinging sensation whenever I use this. Hindi lang talaga siguro ako hiyang.",
    "status": "WNR (Will Not Repurchase)",
    "availability": null,
    "comment": "Skin Type: Oily/ Acne Prone\nProduct name: Cosrx Salicylic Acid Daily Gentle Cleanser\nOrder: Second\nType: Liquid\nPrice: 220 (small)\nEffect: Unfortunately, this did not work for me. Too drying for my face and may stinging sensation whenever I use this. Hindi lang talaga siguro ako hiyang.\nStatus: Will not repurchase",
    "comment_id": "l7ogmiu",
    "comment_score": 3,
    "comment_created_utc": 1717856668.0,
    "comment_author": "Kz_Mafuyu",
    "match_confidence": 1.0,
    "matched_product": "Cosrx Salicylic Acid Daily Gentle Cleanser"
  },
  {
    "skin_type": [
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Cetaphil Gentle Skin Cleanser",
    "price_size": "Super mild on face and hindi nakaka-trigger ng acne. Medyo pricey lang pero worth it.",
    "effects": null,
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "Skin Type: Oily/ Acne Prone\nProduct name: Cetaphil Gentle Skin Cleanser\nOrder: Second\nType: Liquid\nPrice: 170 (60 ml)\nEffect: Super mild on face and hindi nakaka-trigger ng acne. Medyo pricey lang pero worth it.\nStatus: HG",
    "comment_id": "l7ohlcw",
    "comment_score": 3,
    "comment_created_utc": 1717857059.0,
    "comment_author": "Kz_Mafuyu",
    "match_confidence": 1.0,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  },
  {
    "skin_type": [
      "Normal"
    ],
    "product_name": "Cetaphil Gentle Skin Cleanser",
    "price_size": "500+ (250 ml)",
    "effects": "Soft ang feeling sa skin at di nakaka dry. Bihira lang ako magka acne so di ko alam if okay pa rin to gamitin.",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "Skin Type: Normal skin\nProduct name: Cetaphil Gentle Skin Cleanser\nOrder: Third\nType: Liquid\nPrice: 500+ (250 ml)\nEffect: Soft ang feeling sa skin at di nakaka dry. Bihira lang ako magka acne so di ko alam if okay pa rin to gamitin.\nStatus: HG, WR",
    "comment_id": "l7omiho",
    "comment_score": 3,
    "comment_created_utc": 1717859019.0,
    "comment_author": "sullenaya1",
    "match_confidence": 1.0,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  },
  {
    "skin_type": [],
    "product_name": "Luxe Organix's Aqua Lock hydrogel cleanser",
    "price_size": "122php for 20mL (repackaged yung naorder ko cause it seems to be discontinued. details below)",
    "effects": "just a bit of context. i tried to search up on youtube some anti-aging regimen recommendations and ito yung narecommend ni Jan Angelo from YT. so far I've used a 20mL variant and it's been great. It's gentle on the skin and has a nice soothing effect. very relaxing and its reminiscent of the milk cleanser from DermaBlend i used to use.",
    "status": "WR (Will Repurchase)",
    "availability": null,
    "comment": "Skintype: combination\nProduct name: Luxe Organix's Aqua Lock hydrogel cleanser\nOrder: 1st\nType: Gel\nPrice: 122php for 20mL (repackaged yung naorder ko cause it seems to be discontinued. details below)\nEffect: just a bit of context. i tried to search up on youtube some anti-aging regimen recommendations and ito yung narecommend ni Jan Angelo from YT. so far I've used a 20mL variant and it's been great. It's gentle on the skin and has a nice soothing effect. very relaxing and its reminiscent of the milk cleanser from DermaBlend i used to use.\nStatus: WR\nps.\nmuch appreciated if anyone can chime in for alternative recommendations cause this product seems obscure nowadays (in 2024). with same anti aging properties, gel-type, low pH and has NO sodium lauryl sulfate)",
    "comment_id": "lenxmpo",
    "comment_score": 2,
    "comment_created_utc": 1721798265.0,
    "comment_author": "Acceptable_Winner628",
    "match_confidence": 1.0,
    "matched_product": "Luxe Organix's Aqua Lock hydrogel cleanser"
  },
  {
    "skin_type": [],
    "product_name": "Luxe Organix's Aqua Lock hydrogel cleanser",
    "price_size": "122php for 20mL (repackaged yung naorder ko cause it seems to be discontinued. details below)",
    "effects": "just a bit of context. i tried to search up on youtube some anti-aging regimen recommendations and ito yung narecommend ni Jan Angelo from YT. so far I've used a 20mL variant and it's been great. It's gentle on the skin and has a nice soothing effect. very relaxing and its reminiscent of the milk cleanser from DermaBlend i used to use.",
    "status": "WR (Will Repurchase)",
    "availability": null,
    "comment": "Skintype: combination\nProduct name: Luxe Organix's Aqua Lock hydrogel cleanser\nOrder: 1st\nType: Gel\nPrice: 122php for 20mL (repackaged yung naorder ko cause it seems to be discontinued. details below)\nEffect: just a bit of context. i tried to search up on youtube some anti-aging regimen recommendations and ito yung narecommend ni Jan Angelo from YT. so far I've used a 20mL variant and it's been great. It's gentle on the skin and has a nice soothing effect. very relaxing and its reminiscent of the milk cleanser from DermaBlend i used to use.\nStatus: WR\nps.\nAnyone here who uses this product?\nI was scouring the internet and even tried to post here sa sub and ask for its whereabouts cause it seems to be obscure nowadays. looking for alternative recommendations (anti aging properties and same specs as it na gel-type, low pH and has NO sodium lauryl sulfate)\nTIA",
    "comment_id": "lentdzd",
    "comment_score": 1,
    "comment_created_utc": 1721795987.0,
    "comment_author": "Acceptable_Winner628",
    "match_confidence": 1.0,
    "matched_product": "Luxe Organix's Aqua Lock hydrogel cleanser"
  }
]