[
  {
    "skin_type": [
      "Sensitive",
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Skin Aqua UV Moisture Gold Gel SPF50+ PA++++",
    "price_size": "Php550 for 110g",
    "effects": "finally found a sunscreen that works on my super arteng skin!! Very lightweight, easy to spread and doesn’t sting my eyes. I usually get closed comedones and pimples when using sunscreen pero sa product na ‘to wala. Very hiyang talaga ako dito and ganda din ng lapat nya sa make up. Fresh buong araw. Di ako mukang dugyot while using this sunscreen.",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "Skin Type: Sensitive, Oily & Acne Prone\nProduct Name: Skin Aqua UV Moisture Gold Gel SPF50+ PA++++\nPrice: Php550 for 110g\nEffects/Experience: finally found a sunscreen that works on my super arteng skin!! Very lightweight, easy to spread and doesn’t sting my eyes. I usually get closed comedones and pimples when using sunscreen pero sa product na ‘to wala. Very hiyang talaga ako dito and ganda din ng lapat nya sa make up. Fresh buong araw. Di ako mukang dugyot while using this sunscreen.\nStatus: HG & WR 💖💖💖💖",
    "comment_id": "jbdf3lw",
    "comment_score": 13,
    "comment_created_utc": 1678255935.0,
    "comment_author": "Muffinlooove",
    "match_confidence": 0.6933333333333334,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [
      "Combination",
      "Dry",
      "Oily"
    ],
    "product_name": "Belo SunExpert Dewy Essence Sunscreen SPF50 PA++++",
    "price_size": "50ml, Php430.00",
    "effects": "I love this stuff. This is the most lightweight sunscreen I've ever used, though I prefer emollient sunscreens so take this with a grain of salt. For reference, the original SunExpert Face with SPF40 was lightweight for me, and Dewy Essence feels even more comfortable than that. Some people find that pretty heavy. I can layer this and use three fingers' worth of product without a problem, and it doesn't break me out. I don't really find this dewy or shiny. I tend to get oily throughout the day but this doesn't add to my usual amount of oiliness. This and the OG are great makeup primers, too.",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "Skin Type: Combination, dry-leaning with a tendency to get oily in the T-zone\nProduct Name: Belo SunExpert Dewy Essence Sunscreen SPF50 PA++++\nPrice and Size: 50ml, Php430.00\nEffects/Experience: I love this stuff. This is the most lightweight sunscreen I've ever used, though I prefer emollient sunscreens so take this with a grain of salt. For reference, the original SunExpert Face with SPF40 was lightweight for me, and Dewy Essence feels even more comfortable than that. Some people find that pretty heavy. I can layer this and use three fingers' worth of product without a problem, and it doesn't break me out. I don't really find this dewy or shiny. I tend to get oily throughout the day but this doesn't add to my usual amount of oiliness. This and the OG are great makeup primers, too.\nStatus: (HG for Holy Grail, WR for Will Repurchase, WNR for Will Not Repurchase) Probably my HG at this point",
    "comment_id": "j9o63mo",
    "comment_score": 12,
    "comment_created_utc": 1677150883.0,
    "comment_author": null,
    "match_confidence": 0.7397260273972602,
    "matched_product": "Belo Dewy Essence Sunscreen"
  },
  {
    "skin_type": [
      "Oily",
      "Sensitive"
    ],
    "product_name": "**",
    "price_size": "**",
    "effects": "** Isntree. No whitecast! Dewy finish. Didnt get breakout or what. Super moisturizing! Kaya I skip na my usual moisturizer in the morning. A little goes a long way pero generous ako mag apply ng sunscreen lol. Downside lang pala nito hindi water resistant. Biore. I have Biore for back up whenever I go swimming or do water activities. But since di naman ako nagbbeach lately, Isntree talaga gamit ko indoor and outdoor. Issue ko lang sa Biore, sobrang oily ko after huhu kaya pang water ko lang talaga sya ginagamit. May strong scent din pala to upon application.",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "**Skin Type:** Oily, sensitive, gets pimple occasionally (puyat, period, stress etc)\n**Product Name:**\nIsntree Hyaluronic Acid Watery Sun Gel\nBiore UV Watery Essence\n**Price and Size:**\nIsntree ~₱500 for 50ml\nBiore ~₱500 for 50g\n**Effects/Experience:**\nIsntree. No whitecast! Dewy finish. Didnt get breakout or what. Super moisturizing! Kaya I skip na my usual moisturizer in the morning. A little goes a long way pero generous ako mag apply ng sunscreen lol. Downside lang pala nito hindi water resistant.\nBiore. I have Biore for back up whenever I go swimming or do water activities. But since di naman ako nagbbeach lately, Isntree talaga gamit ko indoor and outdoor. Issue ko lang sa Biore, sobrang oily ko after huhu kaya pang water ko lang talaga sya ginagamit. May strong scent din pala to upon application.\n**Status:** both HG 🥰",
    "comment_id": "j9nztrk",
    "comment_score": 10,
    "comment_created_utc": 1677145713.0,
    "comment_author": null,
    "match_confidence": 0.8,
    "matched_product": "Nivea Derma Skin Clear Deep Pore Cleanser"
  },
  {
    "skin_type": [
      "Normal",
      "Dry"
    ],
    "product_name": "[Skin Aqua UV Super Moisture Gel SPF50+ PA++++](https://shp.ee/acqfuty)",
    "price_size": "110g for ₱450",
    "effects": "I alternate this with my Skin1004 Hyalu-Cica Water Fit Sun Serum. I use this on days my skin isn't feeling too dry or I'm not too lazy for moisturizer [it's not drying ah, I just really have dry skin most of the time since I use actives too kaya my skin requires the use of moisturizer]. Feels good on the skin, non-greasy, and no white cast! It's absorbed well on my skin + barely any drying time. The 110g lasts me soooo long despite using it every day [I reapply this when I'm at home since I'm barefaced lang naman]. No irritations whatsoever.",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "Skin Type: Normal-Dry\nProduct Name: [Skin Aqua UV Super Moisture Gel SPF50+ PA++++](https://shp.ee/acqfuty)\nPrice & Size: 110g for ₱450\nEffects/Experience: I alternate this with my Skin1004 Hyalu-Cica Water Fit Sun Serum. I use this on days my skin isn't feeling too dry or I'm not too lazy for moisturizer [it's not drying ah, I just really have dry skin most of the time since I use actives too kaya my skin requires the use of moisturizer]. Feels good on the skin, non-greasy, and no white cast! It's absorbed well on my skin + barely any drying time. The 110g lasts me soooo long despite using it every day [I reapply this when I'm at home since I'm barefaced lang naman]. No irritations whatsoever.\nStatus: WR [can't say it's my HG since I've only been using this for a little over 2 months and I think that's too soon for it to be called a holy grail]",
    "comment_id": "jbdfuym",
    "comment_score": 9,
    "comment_created_utc": 1678256471.0,
    "comment_author": "makeupnskincareonly",
    "match_confidence": 0.6881720430107527,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [
      "Combination"
    ],
    "product_name": "Anessa Perfect UV Sunscreen",
    "price_size": "442 for 40 ml (but there are several promo bundles on this product)",
    "effects": "Not worth it in my opinion. I got the bundle during a payday sale so it was much cheaper but I still think not worth it for me just because I ended up just giving it away. It ruined my makeup after less than 2 hours. Hulas na hulas talaga. It also made my pores feel congested for some reason. I don't think it's for me but if you really want to try it out, get it on a sale. I got my oil cut powder pact + sun base bundle for only ₱231 so I don't think completely nalugi ako.",
    "status": null,
    "availability": null,
    "comment": "Skin Type: Combination\nProduct Name: Anessa Perfect UV Sunscreen\nPrice and Size: 1990 for 60ml on shopee\nEffects/Experience: For me, this is the best best sunscreen I have ever tried. It feels weightless on the skin. It doesn't ruin your makeup. Commuter-friendly din! Medyo pricey pero I feel like worth it naman kasi I have never tried something I liked as much as this!\n____________\nSkin Type: Combination\nProduct Name: I'm Meme I'm Super Light Oil Sun Base\nPrice and Size: 442 for 40 ml (but there are several promo bundles on this product)\nEffects/Experience: Not worth it in my opinion. I got the bundle during a payday sale so it was much cheaper but I still think not worth it for me just because I ended up just giving it away. It ruined my makeup after less than 2 hours. Hulas na hulas talaga. It also made my pores feel congested for some reason. I don't think it's for me but if you really want to try it out, get it on a sale. I got my oil cut powder pact + sun base bundle for only ₱231 so I don't think completely nalugi ako.",
    "comment_id": "j9v20vj",
    "comment_score": 6,
    "comment_created_utc": 1677267426.0,
    "comment_author": "doyeonse",
    "match_confidence": 0.8,
    "matched_product": "Anessa Perfect UV Sunscreen Skin Care Milk"
  },
  {
    "skin_type": [
      "Normal",
      "Oily"
    ],
    "product_name": "** Belo Sunexpert Dewy Essence Sunscreen SPF50 PA++++",
    "price_size": "** 442 for 50ML but i think there's B1T1 at some stores.",
    "effects": "** it's a decent combo sunscreen, perfect for people starting skincare and on a budget. it has a noticeable white cast, a strong vanilla fragrance, and it doesn't sting the eyes. overall, i think it's comfortable to use, easily accessible, affordable, and perfect for lazy morning skincare routines XD personally, i think there are better sunscreen options out there for even cheaper with no fragrance. it weirdly separates if left alone for awhile so make sure to shake properly. it does the job well but i'm not blown away by it.",
    "status": "WNR (Will Not Repurchase)",
    "availability": null,
    "comment": "**Skin Type:** Normal/Oily Combo\n**Product Name:** Belo Sunexpert Dewy Essence Sunscreen SPF50 PA++++\n**Price and Size:** 442 for 50ML but i think there's B1T1 at some stores.\n**Effects/Experience:** it's a decent combo sunscreen, perfect for people starting skincare and on a budget. it has a noticeable white cast, a strong vanilla fragrance, and it doesn't sting the eyes. overall, i think it's comfortable to use, easily accessible, affordable, and perfect for lazy morning skincare routines XD\npersonally, i think there are better sunscreen options out there for even cheaper with no fragrance. it weirdly separates if left alone for awhile so make sure to shake properly. it does the job well but i'm not blown away by it.\n**Status:** 5/10 WNR",
    "comment_id": "j9nonw3",
    "comment_score": 3,
    "comment_created_utc": 1677136609.0,
    "comment_author": "UnicornPonyPorn",
    "match_confidence": 0.7397260273972602,
    "matched_product": "Belo Dewy Essence Sunscreen"
  }
]