[
  {
    "skin_type": [
      "Oily",
      "Combination",
      "Sensitive"
    ],
    "product_name": "Cosrx Salicylic Acid Daily Gentle Cleanser & Cosrx Good Morning Facial Cleanser",
    "price_size": "Both 250 for 50ml",
    "effects": "No itchiness, redness or any adverse reaction sa skin ko. Skin feels soft and clean talaga. Sa umaga ko ginagamit yung Good Morning Facial Cleanser and sa gabi yung Salicylic Acid. ☺️",
    "status": "WR (Will Repurchase)",
    "availability": "Piggies Shop sa orange app / Meron din sa Watsons Official Store ng orange app",
    "comment": "Skin Type: Oily/Combination, Sensitive Skin\nProduct Name: Cosrx Salicylic Acid Daily Gentle Cleanser & Cosrx Good Morning Facial Cleanser\nPrice and Size: Both 250 for 50ml\nWhere to buy: Piggies Shop sa orange app / Meron din sa Watsons Official Store ng orange app\nEffects/Experience: No itchiness, redness or any adverse reaction sa skin ko. Skin feels soft and clean talaga. Sa umaga ko ginagamit yung Good Morning Facial Cleanser and sa gabi yung Salicylic Acid. ☺️\nStatus: WR = will repurchase",
    "comment_id": "k97q4mn",
    "comment_score": 13,
    "comment_created_utc": 1699971568.0,
    "comment_author": "MundaneTwistedMind",
    "match_confidence": 0.8,
    "matched_product": "Cosrx Salicylic Acid Daily Gentle Cleanser"
  },
  {
    "skin_type": [
      "Sensitive",
      "Dry",
      "Oily"
    ],
    "product_name": "COSRX Low pH Good Morning Gel Cleanser and COSRX Salicylic Acid Daily Gentle Cleanser",
    "price_size": "Good Morning Gel Cleanser= 299 php for 150ml ; Salicylic Acid 299 php for 150ml also (sale ngayon idk the og price)",
    "effects": "My skin is already so sensitive and dry, but the Low pH and Salicylic Acid Cleansers doesn't make it worse. The Low ph cleanser does wonders in drying out pimples and cleaning the face without any stripping. Sometimes, kapag nakakalimutan ko mag moisturize, gigising ako kinabukasan w/o any dry, flaky, and redness on any parts of my face. I only use the Salicylic Acid cleanser 2 or 3 times a week. Low lang concentration niya ng Salicylic Acid, pero its really helpful in removing white heads around the nose, chin, and forehead (just make sure to rub it thoroughly).",
    "status": "HG (Holy Grail)",
    "availability": "Shopee, Tiktok Shop, Watsons (jusy make sure na sa official page kayo ng COSR bibili)",
    "comment": "Skin Type: Sensitive, Dry, and Oily on some areas\nProduct Name: COSRX Low pH Good Morning Gel Cleanser and COSRX Salicylic Acid Daily Gentle Cleanser\nPrice and Size: Good Morning Gel Cleanser= 299 php for 150ml ; Salicylic Acid 299 php for 150ml also (sale ngayon idk the og price)\nWhere to buy: Shopee, Tiktok Shop, Watsons (jusy make sure na sa official page kayo ng COSR bibili)\nEffects/Experience: My skin is already so sensitive and dry, but the Low pH and Salicylic Acid Cleansers doesn't make it worse.\nThe Low ph cleanser does wonders in drying out pimples and cleaning the face without any stripping. Sometimes, kapag nakakalimutan ko mag moisturize, gigising ako kinabukasan w/o any dry, flaky, and redness on any parts of my face.\nI only use the Salicylic Acid cleanser 2 or 3 times a week. Low lang concentration niya ng Salicylic Acid, pero its really helpful in removing white heads around the nose, chin, and forehead (just make sure to rub it thoroughly).\nStatus: HG and WR on both!!",
    "comment_id": "k8uqoeu",
    "comment_score": 11,
    "comment_created_utc": 1699743544.0,
    "comment_author": "YettersGonnaYeet",
    "match_confidence": 0.8,
    "matched_product": "Cosrx Salicylic Acid Daily Gentle Cleanser"
  },
  {
    "skin_type": [
      "Combination"
    ],
    "product_name": "Klued - 2% Salicylic Acid Gentle Cleanser 120m|",
    "price_size": "₱ 349 / 120 mL (bought mine at ₱192 during sale)",
    "effects": "Parang hindi nakaka wash ng face? But I guess ganun lang talaga yung effect since it’s advertised as a “gentle” cleanser. Second bottle ko na. I need cleansers with SA (salicylic acid) kasi these type of cleansers prevent huge pimples sa face ko. I went on a vacay so iniwan ko to and gosh nag break out ako. Before, COSRX Salicylic Acid Daily Gentle Cleanser (white and red variant) gamit ko but superrrr drying for me, so I switched to Klued.",
    "status": "WR (Will Repurchase (ALREADY DID))",
    "availability": "Official online stores (Shopee or Laz)",
    "comment": "Skin Type: Combination\nProduct Name: Klued - 2% Salicylic Acid Gentle Cleanser 120m|\nPrice and Size: ₱ 349 / 120 mL (bought mine at ₱192 during sale)\nWhere to buy: Official online stores (Shopee or Laz)\nEffects/Experience: Parang hindi nakaka wash ng face? But I guess ganun lang talaga yung effect since it’s advertised as a “gentle” cleanser. Second bottle ko na. I need cleansers with SA (salicylic acid) kasi these type of cleansers prevent huge pimples sa face ko. I went on a vacay so iniwan ko to and gosh nag break out ako. Before, COSRX Salicylic Acid Daily Gentle Cleanser (white and red variant) gamit ko but superrrr drying for me, so I switched to Klued.\nStatus: Will repurchase (already did).",
    "comment_id": "k8vezrt",
    "comment_score": 10,
    "comment_created_utc": 1699753280.0,
    "comment_author": "Charmeeleone",
    "match_confidence": 0.7294117647058823,
    "matched_product": "Cosrx Salicylic Acid Daily Gentle Cleanser"
  },
  {
    "skin_type": [
      "Oily",
      "Acne Prone"
    ],
    "product_name": "CosRx Salicyclid Acid Cleanser",
    "price_size": "295php yata sa Shopee?",
    "effects": "Since 2020 ko ito gamit and around this time, super dami kong pimples 🥲 A friend recommended this to me at nahiyang ako, pero siya daw hindi hiyang HAHA i still get pimples pero hindi siya kasing bad compared sa dati hahaha. And mostly mabilis mawala kasi hormonal or diet naman ang cause.",
    "status": "HG (Holy Grail)",
    "availability": "Lazada, Shopee, Watson’s",
    "comment": "Skin Type: Oily, Acne-Prone\nProduct Name: CosRx Salicyclid Acid Cleanser\nPrice: 295php yata sa Shopee?\nWhere to buy: Lazada, Shopee, Watson’s\nExperience: Since 2020 ko ito gamit and around this time, super dami kong pimples 🥲 A friend recommended this to me at nahiyang ako, pero siya daw hindi hiyang HAHA i still get pimples pero hindi siya kasing bad compared sa dati hahaha. And mostly mabilis mawala kasi hormonal or diet naman ang cause.\nStatus: HG for me",
    "comment_id": "k8s0h1h",
    "comment_score": 7,
    "comment_created_utc": 1699706966.0,
    "comment_author": "Valuable-Switch-1159",
    "match_confidence": 0.7777777777777778,
    "matched_product": "Cosrx Salicylic Acid Daily Gentle Cleanser"
  },
  {
    "skin_type": [
      "Oily",
      "Combination"
    ],
    "product_name": "COSRX Low pH Good Morning Gel Cleanser + Axis-Y Quinoa One-Step Balanced Gel Cleanser",
    "price_size": "COSRX 150ml (php 350), Axis-Y 180ml (php 565)",
    "effects": "COSRX’s gel cleanser has been a skincare staple for me since pre-pandemic times. There’s very little I can add into the array of rave reviews about it that already exist, but as always, it’s non-stripping, lathers nicely, and does everything a basic, no-frills AM cleanser should do. The Axis-Y quinoa cleanser has a thinner and more watery consistency than COSRX, so I use this in the PM after cleansing with a balm (I use Heimish’s btw!). It lathers just enough to get rid of any residual makeup, sunscreen, and/or cleansing balm. And when I get out of the shower at night, my face doesn’t feel uncomfortably tight. Just a note: Both of these cleansers smell clean (somewhat botanical?) but aren’t fragranced to high heaven, so they’re perfect for someone like me who also happens to dislike strong perfume-y scents in skincare.",
    "status": "HG (Holy Grail)",
    "availability": "Shopee/Lazada",
    "comment": "Skin Type: oily combination\nProduct Name: COSRX Low pH Good Morning Gel Cleanser + Axis-Y Quinoa One-Step Balanced Gel Cleanser\nPrice and Size: COSRX 150ml (php 350), Axis-Y 180ml (php 565)\nWhere to buy: Shopee/Lazada\nExperience: COSRX’s gel cleanser has been a skincare staple for me since pre-pandemic times. There’s very little I can add into the array of rave reviews about it that already exist, but as always, it’s non-stripping, lathers nicely, and does everything a basic, no-frills AM cleanser should do.\nThe Axis-Y quinoa cleanser has a thinner and more watery consistency than COSRX, so I use this in the PM after cleansing with a balm (I use Heimish’s btw!). It lathers just enough to get rid of any residual makeup, sunscreen, and/or cleansing balm. And when I get out of the shower at night, my face doesn’t feel uncomfortably tight.\nJust a note: Both of these cleansers smell clean (somewhat botanical?) but aren’t fragranced to high heaven, so they’re perfect for someone like me who also happens to dislike strong perfume-y scents in skincare.\nStatus: COSRX HG, Axis-Y WR",
    "comment_id": "k8uecrz",
    "comment_score": 8,
    "comment_created_utc": 1699739206.0,
    "comment_author": "chairo__",
    "match_confidence": 0.8,
    "matched_product": "COSRX Low pH Good Morning Gel Cleanser"
  },
  {
    "skin_type": [
      "Sensitive"
    ],
    "product_name": "Cetaphil Gentle Skin Cleanser (Not the Acne Prone one)",
    "price_size": "Around P500+ (I get it for P499 at a nearby Watsons, but some some stores I see have higher prices) for 250mL",
    "effects": "I've tried a handful of facial cleansers that were sort of effective but not as effective as this cleanser. Grabe pagkasensitive ng skin ko kaya masyadong matapang most ng cleansers kaya, even if they do clean my face, my skin still gets irritated. Some are gentle enough na di magwawala skin ko pero parang feeling niya na wala namang effect. Cetaphil's is gentle enough that it doesn't irritate my skin but still gets the job done.",
    "status": "HG (Holy Grail)",
    "availability": "Watsons/Deparment Stores/Online",
    "comment": "Skin Type: Sensitive\nProduct Name: Cetaphil Gentle Skin Cleanser (Not the Acne Prone one)\nPrice and Size: Around P500+ (I get it for P499 at a nearby Watsons, but some some stores I see have higher prices) for 250mL\nWhere to buy: Watsons/Deparment Stores/Online\nEffects/Experiences: I've tried a handful of facial cleansers that were sort of effective but not as effective as this cleanser. Grabe pagkasensitive ng skin ko kaya masyadong matapang most ng cleansers kaya, even if they do clean my face, my skin still gets irritated. Some are gentle enough na di magwawala skin ko pero parang feeling niya na wala namang effect. Cetaphil's is gentle enough that it doesn't irritate my skin but still gets the job done.\nStatus: HG",
    "comment_id": "k8w51wa",
    "comment_score": 5,
    "comment_created_utc": 1699765852.0,
    "comment_author": "eseerine",
    "match_confidence": 0.8,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "Cetaphil",
    "price_size": "500ml for the big bottle and about P1,200",
    "effects": "Due to my oily acne prone skin, I used to use super harsh cleansers like kojic acid, salicylic acid wash, etc. It worked when I was in college, now parang sensitive na ang skin ko so it needs a cleanser na walang active ingredients. So I switched over to cetaphil and it decreased all my pimples! Still a bit oily but it’s no problem. I double cleanse din and do my skincare.",
    "status": "HG (Holy Grail)",
    "availability": "Watsons or any grocery store",
    "comment": "Skin type: Oily\nProduct name: Cetaphil\nPrice and size: 500ml for the big bottle and about P1,200\nWhere to buy: Watsons or any grocery store\nExperience: Due to my oily acne prone skin, I used to use super harsh cleansers like kojic acid, salicylic acid wash, etc. It worked when I was in college, now parang sensitive na ang skin ko so it needs a cleanser na walang active ingredients. So I switched over to cetaphil and it decreased all my pimples! Still a bit oily but it’s no problem. I double cleanse din and do my skincare.\nStatus: I don’t think it’s my HG but WR since it’s readily available anywhere.",
    "comment_id": "k8s94nv",
    "comment_score": 5,
    "comment_created_utc": 1699711306.0,
    "comment_author": "Frosty_Interest_6740",
    "match_confidence": 0.8,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  }
]