[
  {
    "skin_type": [
      "Oily",
      "Acne Prone",
      "Sensitive"
    ],
    "product_name": "Cetaphil Cleanser",
    "price_size": null,
    "effects": "Dito lang ako nahiyang kasi walang hapdi. Before I use The Face Shop B1T1 cleanser pero mas nahiyang talaga ako kay Cetaphil. Nag-ooil pa rin naman face ko pero hindi dugyot tignan. Plus hindi na ako nagbbreakout.",
    "status": "HG",
    "comment": "Skin Type: Oily and Sensitive (Acne-Prone)\nProduct Name: Cetaphil Cleanser\nI usually use it after cleaning with Micellar Water\nType: Liquid\nPrice: 990 for 591 ML (I always buy sa S&R kapag B1T1 sila so parang 445 each)\nEffect: Dito lang ako nahiyang kasi walang hapdi. Before I use The Face Shop B1T1 cleanser pero mas nahiyang talaga ako kay Cetaphil. Nag-ooil pa rin naman face ko pero hindi dugyot tignan. Plus hindi na ako nagbbreakout.\nStatus: HG",
    "comment_id": "l7oombn",
    "comment_score": 5,
    "comment_created_utc": 1717859838.0,
    "comment_author": "telejubbies",
    "match_confidence": 0.7391304347826086,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  },
  {
    "skin_type": [
      "Combination"
    ],
    "product_name": "COSRC Salicylic Acid Cleanser",
    "price_size": null,
    "effects": "Maganda sya for me. Got laid off and no work for 6 months so wala talagang budget for skincare. Textured skin, acne prone pa, sabayan pa ng stress so ayun ang dumi talaga ng mukha ko. Until I came across this product and has been using it for 1 week now and promising ang results; pimples nag dry na, dark spots starting to lighten.",
    "status": null,
    "comment": "Skin Type: Combination\nProduct Name: COSRC Salicylic Acid Cleanser\nPrice: 350\nType: Creamy\nEffect: Maganda sya for me. Got laid off and no work for 6 months so wala talagang budget for skincare. Textured skin, acne prone pa, sabayan pa ng stress so ayun ang dumi talaga ng mukha ko. Until I came across this product and has been using it for 1 week now and promising ang results; pimples nag dry na, dark spots starting to lighten.",
    "comment_id": "l7nxm4y",
    "comment_score": 4,
    "comment_created_utc": 1717847740.0,
    "comment_author": "salty_mamimo",
    "match_confidence": 0.7887323943661971,
    "matched_product": "Cosrx Salicylic Acid Daily Gentle Cleanser"
  },
  {
    "skin_type": [
      "Combination",
      "Oily",
      "Acne Prone",
      "Sensitive"
    ],
    "product_name": "Cetaphil Cleanser",
    "price_size": null,
    "effects": "Tried this kasi nag dry yung skin ko. Ever since ginamit ko to, nabawasan din yung pimples ko and little bumps sa buong mukha ko. I also noticed na lumambot din yung balat ko sa mukha. Every morning ko lang to ginagamit kasi nag a-acne soap ako sa gabi",
    "status": "HG",
    "comment": "Skin Type: Combination / Oily and Sensitive (Acne-Prone)\nProduct Name: Cetaphil Cleanser\nType: Gel type\nPrice: 300+ for 118 ml\nEffect: Tried this kasi nag dry yung skin ko. Ever since ginamit ko to, nabawasan din yung pimples ko and little bumps sa buong mukha ko. I also noticed na lumambot din yung balat ko sa mukha.\nEvery morning ko lang to ginagamit kasi nag a-acne soap ako sa gabi\nStatus: HG ✨",
    "comment_id": "l7x3l7o",
    "comment_score": 3,
    "comment_created_utc": 1717994286.0,
    "comment_author": "minianing",
    "match_confidence": 0.7391304347826086,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  },
  {
    "skin_type": [
      "Oily",
      "Combination",
      "Sensitive"
    ],
    "product_name": "Cosrx Salicylic Acid Daily Gentle Cleanser & Cosrx Good Morning Facial Cleanser",
    "price_size": "Both 250 for 50ml",
    "effects": "No itchiness, redness or any adverse reaction sa skin ko. Skin feels soft and clean talaga. Sa umaga ko ginagamit yung Good Morning Facial Cleanser and sa gabi yung Salicylic Acid. ☺️",
    "status": "WR",
    "comment": "Skin Type: Oily/Combination, Sensitive Skin\nProduct Name: Cosrx Salicylic Acid Daily Gentle Cleanser & Cosrx Good Morning Facial Cleanser\nPrice and Size: Both 250 for 50ml\nWhere to buy: Piggies Shop sa orange app / Meron din sa Watsons Official Store ng orange app\nEffects/Experience: No itchiness, redness or any adverse reaction sa skin ko. Skin feels soft and clean talaga. Sa umaga ko ginagamit yung Good Morning Facial Cleanser and sa gabi yung Salicylic Acid. ☺️\nStatus: WR = will repurchase",
    "comment_id": "k97q4mn",
    "comment_score": 12,
    "comment_created_utc": 1699971568.0,
    "comment_author": "MundaneTwistedMind",
    "match_confidence": 0.8,
    "matched_product": "Cosrx Salicylic Acid Daily Gentle Cleanser"
  },
  {
    "skin_type": [
      "Sensitive",
      "Dry",
      "Oily"
    ],
    "product_name": "COSRX Low pH Good Morning Gel Cleanser and COSRX Salicylic Acid Daily Gentle Cleanser",
    "price_size": "Good Morning Gel Cleanser= 299 php for 150ml ; Salicylic Acid 299 php for 150ml also (sale ngayon idk the og price)",
    "effects": "My skin is already so sensitive and dry, but the Low pH and Salicylic Acid Cleansers doesn't make it worse. The Low ph cleanser does wonders in drying out pimples and cleaning the face without any stripping. Sometimes, kapag nakakalimutan ko mag moisturize, gigising ako kinabukasan w/o any dry, flaky, and redness on any parts of my face. I only use the Salicylic Acid cleanser 2 or 3 times a week. Low lang concentration niya ng Salicylic Acid, pero its really helpful in removing white heads around the nose, chin, and forehead (just make sure to rub it thoroughly).",
    "status": "HG",
    "comment": "Skin Type: Sensitive, Dry, and Oily on some areas\nProduct Name: COSRX Low pH Good Morning Gel Cleanser and COSRX Salicylic Acid Daily Gentle Cleanser\nPrice and Size: Good Morning Gel Cleanser= 299 php for 150ml ; Salicylic Acid 299 php for 150ml also (sale ngayon idk the og price)\nWhere to buy: Shopee, Tiktok Shop, Watsons (jusy make sure na sa official page kayo ng COSR bibili)\nEffects/Experience: My skin is already so sensitive and dry, but the Low pH and Salicylic Acid Cleansers doesn't make it worse.\nThe Low ph cleanser does wonders in drying out pimples and cleaning the face without any stripping. Sometimes, kapag nakakalimutan ko mag moisturize, gigising ako kinabukasan w/o any dry, flaky, and redness on any parts of my face.\nI only use the Salicylic Acid cleanser 2 or 3 times a week. Low lang concentration niya ng Salicylic Acid, pero its really helpful in removing white heads around the nose, chin, and forehead (just make sure to rub it thoroughly).\nStatus: HG and WR on both!!",
    "comment_id": "k8uqoeu",
    "comment_score": 9,
    "comment_created_utc": 1699743544.0,
    "comment_author": "YettersGonnaYeet",
    "match_confidence": 0.8,
    "matched_product": "Cosrx Salicylic Acid Daily Gentle Cleanser"
  },
  {
    "skin_type": [
      "Combination"
    ],
    "product_name": "Klued - 2% Salicylic Acid Gentle Cleanser 120m|",
    "price_size": "₱ 349 / 120 mL (bought mine at ₱192 during sale)",
    "effects": "Parang hindi nakaka wash ng face? But I guess ganun lang talaga yung effect since it’s advertised as a “gentle” cleanser. Second bottle ko na. I need cleansers with SA (salicylic acid) kasi these type of cleansers prevent huge pimples sa face ko. I went on a vacay so iniwan ko to and gosh nag break out ako. Before, COSRX Salicylic Acid Daily Gentle Cleanser (white and red variant) gamit ko but superrrr drying for me, so I switched to Klued.",
    "status": null,
    "comment": "Skin Type: Combination\nProduct Name: Klued - 2% Salicylic Acid Gentle Cleanser 120m|\nPrice and Size: ₱ 349 / 120 mL (bought mine at ₱192 during sale)\nWhere to buy: Official online stores (Shopee or Laz)\nEffects/Experience: Parang hindi nakaka wash ng face? But I guess ganun lang talaga yung effect since it’s advertised as a “gentle” cleanser. Second bottle ko na. I need cleansers with SA (salicylic acid) kasi these type of cleansers prevent huge pimples sa face ko. I went on a vacay so iniwan ko to and gosh nag break out ako. Before, COSRX Salicylic Acid Daily Gentle Cleanser (white and red variant) gamit ko but superrrr drying for me, so I switched to Klued.\nStatus: Will repurchase (already did).",
    "comment_id": "k8vezrt",
    "comment_score": 10,
    "comment_created_utc": 1699753280.0,
    "comment_author": "Charmeeleone",
    "match_confidence": 0.7294117647058823,
    "matched_product": "Cosrx Salicylic Acid Daily Gentle Cleanser"
  },
  {
    "skin_type": [
      "Oily",
      "Acne Prone"
    ],
    "product_name": "CosRx Salicyclid Acid Cleanser",
    "price_size": null,
    "effects": "Since 2020 ko ito gamit and around this time, super dami kong pimples 🥲 A friend recommended this to me at nahiyang ako, pero siya daw hindi hiyang HAHA i still get pimples pero hindi siya kasing bad compared sa dati hahaha. And mostly mabilis mawala kasi hormonal or diet naman ang cause.",
    "status": "HG",
    "comment": "Skin Type: Oily, Acne-Prone\nProduct Name: CosRx Salicyclid Acid Cleanser\nPrice: 295php yata sa Shopee?\nWhere to buy: Lazada, Shopee, Watson’s\nExperience: Since 2020 ko ito gamit and around this time, super dami kong pimples 🥲 A friend recommended this to me at nahiyang ako, pero siya daw hindi hiyang HAHA i still get pimples pero hindi siya kasing bad compared sa dati hahaha. And mostly mabilis mawala kasi hormonal or diet naman ang cause.\nStatus: HG for me",
    "comment_id": "k8s0h1h",
    "comment_score": 8,
    "comment_created_utc": 1699706966.0,
    "comment_author": "Valuable-Switch-1159",
    "match_confidence": 0.7777777777777778,
    "matched_product": "Cosrx Salicylic Acid Daily Gentle Cleanser"
  },
  {
    "skin_type": [
      "Oily",
      "Combination"
    ],
    "product_name": "COSRX Low pH Good Morning Gel Cleanser + Axis-Y Quinoa One-Step Balanced Gel Cleanser",
    "price_size": "COSRX 150ml (php 350), Axis-Y 180ml (php 565)",
    "effects": "COSRX’s gel cleanser has been a skincare staple for me since pre-pandemic times. There’s very little I can add into the array of rave reviews about it that already exist, but as always, it’s non-stripping, lathers nicely, and does everything a basic, no-frills AM cleanser should do. The Axis-Y quinoa cleanser has a thinner and more watery consistency than COSRX, so I use this in the PM after cleansing with a balm (I use Heimish’s btw!). It lathers just enough to get rid of any residual makeup, sunscreen, and/or cleansing balm. And when I get out of the shower at night, my face doesn’t feel uncomfortably tight. Just a note: Both of these cleansers smell clean (somewhat botanical?) but aren’t fragranced to high heaven, so they’re perfect for someone like me who also happens to dislike strong perfume-y scents in skincare.",
    "status": "HG",
    "comment": "Skin Type: oily combination\nProduct Name: COSRX Low pH Good Morning Gel Cleanser + Axis-Y Quinoa One-Step Balanced Gel Cleanser\nPrice and Size: COSRX 150ml (php 350), Axis-Y 180ml (php 565)\nWhere to buy: Shopee/Lazada\nExperience: COSRX’s gel cleanser has been a skincare staple for me since pre-pandemic times. There’s very little I can add into the array of rave reviews about it that already exist, but as always, it’s non-stripping, lathers nicely, and does everything a basic, no-frills AM cleanser should do.\nThe Axis-Y quinoa cleanser has a thinner and more watery consistency than COSRX, so I use this in the PM after cleansing with a balm (I use Heimish’s btw!). It lathers just enough to get rid of any residual makeup, sunscreen, and/or cleansing balm. And when I get out of the shower at night, my face doesn’t feel uncomfortably tight.\nJust a note: Both of these cleansers smell clean (somewhat botanical?) but aren’t fragranced to high heaven, so they’re perfect for someone like me who also happens to dislike strong perfume-y scents in skincare.\nStatus: COSRX HG, Axis-Y WR",
    "comment_id": "k8uecrz",
    "comment_score": 8,
    "comment_created_utc": 1699739206.0,
    "comment_author": "chairo__",
    "match_confidence": 0.8,
    "matched_product": "COSRX Low pH Good Morning Gel Cleanser"
  },
  {
    "skin_type": [
      "Sensitive"
    ],
    "product_name": "Cetaphil Gentle Skin Cleanser (Not the Acne Prone one)",
    "price_size": "Around P500+ (I get it for P499 at a nearby Watsons, but some some stores I see have higher prices) for 250mL",
    "effects": "I've tried a handful of facial cleansers that were sort of effective but not as effective as this cleanser. Grabe pagkasensitive ng skin ko kaya masyadong matapang most ng cleansers kaya, even if they do clean my face, my skin still gets irritated. Some are gentle enough na di magwawala skin ko pero parang feeling niya na wala namang effect. Cetaphil's is gentle enough that it doesn't irritate my skin but still gets the job done.",
    "status": "HG",
    "comment": "Skin Type: Sensitive\nProduct Name: Cetaphil Gentle Skin Cleanser (Not the Acne Prone one)\nPrice and Size: Around P500+ (I get it for P499 at a nearby Watsons, but some some stores I see have higher prices) for 250mL\nWhere to buy: Watsons/Deparment Stores/Online\nEffects/Experiences: I've tried a handful of facial cleansers that were sort of effective but not as effective as this cleanser. Grabe pagkasensitive ng skin ko kaya masyadong matapang most ng cleansers kaya, even if they do clean my face, my skin still gets irritated. Some are gentle enough na di magwawala skin ko pero parang feeling niya na wala namang effect. Cetaphil's is gentle enough that it doesn't irritate my skin but still gets the job done.\nStatus: HG",
    "comment_id": "k8w51wa",
    "comment_score": 6,
    "comment_created_utc": 1699765852.0,
    "comment_author": "eseerine",
    "match_confidence": 0.8,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "Cetaphil",
    "price_size": "500ml for the big bottle and about P1,200",
    "effects": "Due to my oily acne prone skin, I used to use super harsh cleansers like kojic acid, salicylic acid wash, etc. It worked when I was in college, now parang sensitive na ang skin ko so it needs a cleanser na walang active ingredients. So I switched over to cetaphil and it decreased all my pimples! Still a bit oily but it’s no problem. I double cleanse din and do my skincare.",
    "status": "HG",
    "comment": "Skin type: Oily\nProduct name: Cetaphil\nPrice and size: 500ml for the big bottle and about P1,200\nWhere to buy: Watsons or any grocery store\nExperience: Due to my oily acne prone skin, I used to use super harsh cleansers like kojic acid, salicylic acid wash, etc. It worked when I was in college, now parang sensitive na ang skin ko so it needs a cleanser na walang active ingredients. So I switched over to cetaphil and it decreased all my pimples! Still a bit oily but it’s no problem. I double cleanse din and do my skincare.\nStatus: I don’t think it’s my HG but WR since it’s readily available anywhere.",
    "comment_id": "k8s94nv",
    "comment_score": 4,
    "comment_created_utc": 1699711306.0,
    "comment_author": "Frosty_Interest_6740",
    "match_confidence": 0.8,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  },
  {
    "skin_type": [
      "Sensitive",
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Skin Aqua UV Moisture Gold Gel SPF50+ PA++++",
    "price_size": null,
    "effects": "finally found a sunscreen that works on my super arteng skin!! Very lightweight, easy to spread and doesn’t sting my eyes. I usually get closed comedones and pimples when using sunscreen pero sa product na ‘to wala. Very hiyang talaga ako dito and ganda din ng lapat nya sa make up. Fresh buong araw. Di ako mukang dugyot while using this sunscreen.",
    "status": "HG",
    "comment": "Skin Type: Sensitive, Oily & Acne Prone\nProduct Name: Skin Aqua UV Moisture Gold Gel SPF50+ PA++++\nPrice: Php550 for 110g\nEffects/Experience: finally found a sunscreen that works on my super arteng skin!! Very lightweight, easy to spread and doesn’t sting my eyes. I usually get closed comedones and pimples when using sunscreen pero sa product na ‘to wala. Very hiyang talaga ako dito and ganda din ng lapat nya sa make up. Fresh buong araw. Di ako mukang dugyot while using this sunscreen.\nStatus: HG & WR 💖💖💖💖",
    "comment_id": "jbdf3lw",
    "comment_score": 12,
    "comment_created_utc": 1678255935.0,
    "comment_author": "Muffinlooove",
    "match_confidence": 0.6933333333333334,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [
      "Combination",
      "Dry",
      "Oily"
    ],
    "product_name": "Belo SunExpert Dewy Essence Sunscreen SPF50 PA++++",
    "price_size": "50ml, Php430.00",
    "effects": "I love this stuff. This is the most lightweight sunscreen I've ever used, though I prefer emollient sunscreens so take this with a grain of salt. For reference, the original SunExpert Face with SPF40 was lightweight for me, and Dewy Essence feels even more comfortable than that. Some people find that pretty heavy. I can layer this and use three fingers' worth of product without a problem, and it doesn't break me out. I don't really find this dewy or shiny. I tend to get oily throughout the day but this doesn't add to my usual amount of oiliness. This and the OG are great makeup primers, too.",
    "status": "HG",
    "comment": "Skin Type: Combination, dry-leaning with a tendency to get oily in the T-zone\nProduct Name: Belo SunExpert Dewy Essence Sunscreen SPF50 PA++++\nPrice and Size: 50ml, Php430.00\nEffects/Experience: I love this stuff. This is the most lightweight sunscreen I've ever used, though I prefer emollient sunscreens so take this with a grain of salt. For reference, the original SunExpert Face with SPF40 was lightweight for me, and Dewy Essence feels even more comfortable than that. Some people find that pretty heavy. I can layer this and use three fingers' worth of product without a problem, and it doesn't break me out. I don't really find this dewy or shiny. I tend to get oily throughout the day but this doesn't add to my usual amount of oiliness. This and the OG are great makeup primers, too.\nStatus: (HG for Holy Grail, WR for Will Repurchase, WNR for Will Not Repurchase) Probably my HG at this point",
    "comment_id": "j9o63mo",
    "comment_score": 11,
    "comment_created_utc": 1677150883.0,
    "comment_author": null,
    "match_confidence": 0.7397260273972602,
    "matched_product": "Belo Dewy Essence Sunscreen"
  },
  {
    "skin_type": [
      "Oily",
      "Sensitive"
    ],
    "product_name": "**",
    "price_size": "**",
    "effects": "** Isntree. No whitecast! Dewy finish. Didnt get breakout or what. Super moisturizing! Kaya I skip na my usual moisturizer in the morning. A little goes a long way pero generous ako mag apply ng sunscreen lol. Downside lang pala nito hindi water resistant. Biore. I have Biore for back up whenever I go swimming or do water activities. But since di naman ako nagbbeach lately, Isntree talaga gamit ko indoor and outdoor. Issue ko lang sa Biore, sobrang oily ko after huhu kaya pang water ko lang talaga sya ginagamit. May strong scent din pala to upon application.",
    "status": "HG",
    "comment": "**Skin Type:** Oily, sensitive, gets pimple occasionally (puyat, period, stress etc)\n**Product Name:**\nIsntree Hyaluronic Acid Watery Sun Gel\nBiore UV Watery Essence\n**Price and Size:**\nIsntree ~₱500 for 50ml\nBiore ~₱500 for 50g\n**Effects/Experience:**\nIsntree. No whitecast! Dewy finish. Didnt get breakout or what. Super moisturizing! Kaya I skip na my usual moisturizer in the morning. A little goes a long way pero generous ako mag apply ng sunscreen lol. Downside lang pala nito hindi water resistant.\nBiore. I have Biore for back up whenever I go swimming or do water activities. But since di naman ako nagbbeach lately, Isntree talaga gamit ko indoor and outdoor. Issue ko lang sa Biore, sobrang oily ko after huhu kaya pang water ko lang talaga sya ginagamit. May strong scent din pala to upon application.\n**Status:** both HG 🥰",
    "comment_id": "j9nztrk",
    "comment_score": 9,
    "comment_created_utc": 1677145713.0,
    "comment_author": null,
    "match_confidence": 0.8,
    "matched_product": "Nivea Derma Skin Clear Deep Pore Cleanser"
  },
  {
    "skin_type": [
      "Normal",
      "Dry"
    ],
    "product_name": "[Skin Aqua UV Super Moisture Gel SPF50+ PA++++](https://shp.ee/acqfuty)",
    "price_size": "110g for ₱450",
    "effects": "I alternate this with my Skin1004 Hyalu-Cica Water Fit Sun Serum. I use this on days my skin isn't feeling too dry or I'm not too lazy for moisturizer [it's not drying ah, I just really have dry skin most of the time since I use actives too kaya my skin requires the use of moisturizer]. Feels good on the skin, non-greasy, and no white cast! It's absorbed well on my skin + barely any drying time. The 110g lasts me soooo long despite using it every day [I reapply this when I'm at home since I'm barefaced lang naman]. No irritations whatsoever.",
    "status": "HG",
    "comment": "Skin Type: Normal-Dry\nProduct Name: [Skin Aqua UV Super Moisture Gel SPF50+ PA++++](https://shp.ee/acqfuty)\nPrice & Size: 110g for ₱450\nEffects/Experience: I alternate this with my Skin1004 Hyalu-Cica Water Fit Sun Serum. I use this on days my skin isn't feeling too dry or I'm not too lazy for moisturizer [it's not drying ah, I just really have dry skin most of the time since I use actives too kaya my skin requires the use of moisturizer]. Feels good on the skin, non-greasy, and no white cast! It's absorbed well on my skin + barely any drying time. The 110g lasts me soooo long despite using it every day [I reapply this when I'm at home since I'm barefaced lang naman]. No irritations whatsoever.\nStatus: WR [can't say it's my HG since I've only been using this for a little over 2 months and I think that's too soon for it to be called a holy grail]",
    "comment_id": "jbdfuym",
    "comment_score": 8,
    "comment_created_utc": 1678256471.0,
    "comment_author": "makeupnskincareonly",
    "match_confidence": 0.6881720430107527,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [
      "Combination"
    ],
    "product_name": "Anessa Perfect UV Sunscreen",
    "price_size": "442 for 40 ml (but there are several promo bundles on this product)",
    "effects": "Not worth it in my opinion. I got the bundle during a payday sale so it was much cheaper but I still think not worth it for me just because I ended up just giving it away. It ruined my makeup after less than 2 hours. Hulas na hulas talaga. It also made my pores feel congested for some reason. I don't think it's for me but if you really want to try it out, get it on a sale. I got my oil cut powder pact + sun base bundle for only ₱231 so I don't think completely nalugi ako.",
    "status": null,
    "comment": "Skin Type: Combination\nProduct Name: Anessa Perfect UV Sunscreen\nPrice and Size: 1990 for 60ml on shopee\nEffects/Experience: For me, this is the best best sunscreen I have ever tried. It feels weightless on the skin. It doesn't ruin your makeup. Commuter-friendly din! Medyo pricey pero I feel like worth it naman kasi I have never tried something I liked as much as this!\n____________\nSkin Type: Combination\nProduct Name: I'm Meme I'm Super Light Oil Sun Base\nPrice and Size: 442 for 40 ml (but there are several promo bundles on this product)\nEffects/Experience: Not worth it in my opinion. I got the bundle during a payday sale so it was much cheaper but I still think not worth it for me just because I ended up just giving it away. It ruined my makeup after less than 2 hours. Hulas na hulas talaga. It also made my pores feel congested for some reason. I don't think it's for me but if you really want to try it out, get it on a sale. I got my oil cut powder pact + sun base bundle for only ₱231 so I don't think completely nalugi ako.",
    "comment_id": "j9v20vj",
    "comment_score": 5,
    "comment_created_utc": 1677267426.0,
    "comment_author": "doyeonse",
    "match_confidence": 0.8,
    "matched_product": "Anessa Perfect UV Sunscreen Skin Care Milk"
  },
  {
    "skin_type": [
      "Normal",
      "Oily"
    ],
    "product_name": "** Belo Sunexpert Dewy Essence Sunscreen SPF50 PA++++",
    "price_size": "** 442 for 50ML but i think there's B1T1 at some stores.",
    "effects": "** it's a decent combo sunscreen, perfect for people starting skincare and on a budget. it has a noticeable white cast, a strong vanilla fragrance, and it doesn't sting the eyes. overall, i think it's comfortable to use, easily accessible, affordable, and perfect for lazy morning skincare routines XD personally, i think there are better sunscreen options out there for even cheaper with no fragrance. it weirdly separates if left alone for awhile so make sure to shake properly. it does the job well but i'm not blown away by it.",
    "status": "WNR",
    "comment": "**Skin Type:** Normal/Oily Combo\n**Product Name:** Belo Sunexpert Dewy Essence Sunscreen SPF50 PA++++\n**Price and Size:** 442 for 50ML but i think there's B1T1 at some stores.\n**Effects/Experience:** it's a decent combo sunscreen, perfect for people starting skincare and on a budget. it has a noticeable white cast, a strong vanilla fragrance, and it doesn't sting the eyes. overall, i think it's comfortable to use, easily accessible, affordable, and perfect for lazy morning skincare routines XD\npersonally, i think there are better sunscreen options out there for even cheaper with no fragrance. it weirdly separates if left alone for awhile so make sure to shake properly. it does the job well but i'm not blown away by it.\n**Status:** 5/10 WNR",
    "comment_id": "j9nonw3",
    "comment_score": 3,
    "comment_created_utc": 1677136609.0,
    "comment_author": "UnicornPonyPorn",
    "match_confidence": 0.7397260273972602,
    "matched_product": "Belo Dewy Essence Sunscreen"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "Skin Aqua  Super Moisture UV milk spf 50+",
    "price_size": null,
    "effects": "Not only that it’s sweat and water resistant, it’s also alcohol and fragrance free! I bought this as an alternative to my much more expensive sunscreen and let me tell you it did not disappoint! It also didn’t irritate my skin compared to other sunscreens (i also have sensitive skin) It’s also in a  lighter finish!",
    "status": "HG",
    "comment": "Skin type: oily skin\nProduct name: Skin Aqua  Super Moisture UV milk spf 50+\nPrice: 374 pesos, if you get it from this [direct from japan store](https://goeco.asia/eeZ576Bs). I got mine from japan but there’s a lot of direct from japan shops in 🍊app but this is the cheapest I could find\nEffects: Not only that it’s sweat and water resistant, it’s also alcohol and fragrance free! I bought this as an alternative to my much more expensive sunscreen and let me tell you it did not disappoint! It also didn’t irritate my skin compared to other sunscreens (i also have sensitive skin) It’s also in a  lighter finish!\nStatus: HG ✨",
    "comment_id": "l9kkto9",
    "comment_score": 12,
    "comment_created_utc": 1718944347.0,
    "comment_author": "Complex_Week3697",
    "match_confidence": 0.72,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [
      "Acne Prone",
      "Oily"
    ],
    "product_name": "** Skin Aqua Super Moisture Gel Gold SPF 50+ / PA ++++",
    "price_size": "** Ranges from Php 450-600 pesos sa blue and orange apps, 110ml bottle",
    "effects": "** It is marketed for humid climates and is super effective on face and body given na I work on-site some days. Comes in a big bottle, moisturizing and leaves no white-cast. May subtle alcohol smell but fades easily. Big plus na it does not break me out. Also, may dewy finish but I usually powder my face din naman.",
    "status": "HG",
    "comment": "**Skin Type:** Acne-prone, Oily\n**Product Name:** Skin Aqua Super Moisture Gel Gold SPF 50+ / PA ++++\n**Price and Size:** Ranges from Php 450-600 pesos sa blue and orange apps, 110ml bottle\n**Effects/Experience:** It is marketed for humid climates and is super effective on face and body given na I work on-site some days. Comes in a big bottle, moisturizing and leaves no white-cast. May subtle alcohol smell but fades easily. Big plus na it does not break me out. Also, may dewy finish but I usually powder my face din naman.\n**Status:** HG status!  \\*Would want to repurchase however I read somewhere it may be discontinued this year",
    "comment_id": "kvo3dk3",
    "comment_score": 12,
    "comment_created_utc": 1710897305.0,
    "comment_author": "blimeyyweasleyy",
    "match_confidence": 0.8354430379746836,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [],
    "product_name": "Anessa Perfect UV Sunscreen Mild Milk 50 SPF",
    "price_size": "Php1990 60ml",
    "effects": null,
    "status": "HG",
    "comment": "Skin Type: Dry\nProduct Name: Anessa Perfect UV Sunscreen Mild Milk 50 SPF\nPrice and Size: Php1990 60ml\nEffects/Experience: Because of my skin type, I use products without alcohol and Anessa Mild Milk doesn't have alcohol. It dries down well and gives a slight sheen. I do not use make up primer and my make up lasts all day.\nStatus: HG",
    "comment_id": "kvnzn83",
    "comment_score": 10,
    "comment_created_utc": 1710895861.0,
    "comment_author": "manilaxla",
    "match_confidence": 0.7906976744186046,
    "matched_product": "Anessa Perfect UV Sunscreen Skin Care Milk"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "ANESSA",
    "price_size": "starts at Php1,400+",
    "effects": "I’ve been using this for years and it’s perfect for oily skin. No white cast at all and one can easily reapply it a few times a day, although consistency is a bit runny. It doesn’t clog my pores and I use this everyday. I would highly recommend.",
    "status": "HG",
    "comment": "Skin Type: Oily\nProduct Name: ANESSA\nPrice and Size: starts at Php1,400+\nEffects/Experience: I’ve been using this for years and it’s perfect for oily skin. No white cast at all and one can easily reapply it a few times a day, although consistency is a bit runny. It doesn’t clog my pores and I use this everyday. I would highly recommend.\nStatus: HG, WR ⭐️⭐️⭐️⭐️⭐️",
    "comment_id": "kvw0dwa",
    "comment_score": 3,
    "comment_created_utc": 1711029400.0,
    "comment_author": "Careless_Produce9410",
    "match_confidence": 0.8,
    "matched_product": "Anessa Perfect UV Sunscreen Skin Care Milk"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "**",
    "price_size": "80 pesos and 10grams**",
    "effects": "magaan sa mukha, and effective siya for me**",
    "status": "WR",
    "comment": "**Skin Type:** oily skin\n**Product Name:**\n# Skinis Sunprotector Cream SPF50 10g plus VIT E and ANTIOXIDANTS\n**Price and Size: 80 pesos and 10grams**\n**Effects/Experience: magaan sa mukha, and effective siya for me**\n**Status:** WR",
    "comment_id": "lbkuvqw",
    "comment_score": 1,
    "comment_created_utc": 1720089657.0,
    "comment_author": null,
    "match_confidence": 0.8,
    "matched_product": "Nivea Derma Skin Clear Deep Pore Cleanser"
  },
  {
    "skin_type": [],
    "product_name": "**  BELO SunExpert Dewy Essence Sunscreen 50ML (SPF50 PA++++)",
    "price_size": "** 50ML / 399",
    "effects": "** -Too dark on me -Takes a long time to absorb",
    "status": "WNR",
    "comment": "**Product Name:**  BELO SunExpert Dewy Essence Sunscreen 50ML (SPF50 PA++++)\n**Price and Size:** 50 ML / P269\n**Effects/Experience:**\n-No whitecast\n-Feels like a moisturizer\n-Takes time to absorb\n-Have not tried under makeup\n-I did not feel any difference with the watermelon variant\n**Status:** WR only when super low of budget\n----------------------------------------\n**Product Name:**  Belo SunExpert Dewy Essence Watermelon (SPF50 PA++)\n**Price and Size:** 50 ML / B1T1 P450\n**Effects/Experience:**\n-May take few seconds longer for whitecast to disappear\n-Feels like a moisturizer\n-Takes time to absorb\n-Have not tried under makeup\n-I did not feel any difference with the regular dewy variant\n**Status:** WR only when super low of budget\n----------------------------------------\n**Product Name:**  Belo SunExpert Whitening Sunscreen (SPF50 PA++) (old packaging)\n**Price and Size:** 50ML / P450\n**Effects/Experience:**\n-bit heavy on skin\n-takes time to absorb and whitecast to disappear\n-have not tried under makeup\n-a little sting on the dry areas of my face (chin)\n-make my cheeks blush when exposed to sun\n**Status:** WR only if Dewy variant is out of stock and if I’m super low on budget\n----------------------------------------\n**Product Name:** Belo SunExpert Tinted Sunscreen (SPF50 PA++++) 50mL\n**Price and Size:** 50ML / 399\n**Effects/Experience:**\n-Too dark on me\n-Takes a long time to absorb\n**Status:** WNR",
    "comment_id": "lm2f5yy",
    "comment_score": 4,
    "comment_created_utc": 1725770785.0,
    "comment_author": "kurimchizu",
    "match_confidence": 0.6923076923076923,
    "matched_product": "Belo Dewy Essence Sunscreen"
  },
  {
    "skin_type": [],
    "product_name": "Hi",
    "price_size": null,
    "effects": null,
    "status": null,
    "comment": "Hi\nhttps://s.lazada.com.ph/s.PgIep",
    "comment_id": "l9alnwp",
    "comment_score": 2,
    "comment_created_utc": 1718797021.0,
    "comment_author": "Recent_Pea_8680",
    "match_confidence": 0.8,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  },
  {
    "skin_type": [
      "Combination"
    ],
    "product_name": "Anessa Perfect UV Brightening Sunscreen Skincare Gel 50 SPF",
    "price_size": "Bought mine for 1,030 pesos / 90g",
    "effects": "- Really gives you that radiant glow after application due to its tone-up effect - Does not leave any white cast but you must apply it properly - Super light-weight! - Noticed that I sweat and oil less once it is applied - Did not experience any breakouts",
    "status": "HG",
    "comment": "Skin type: Combination\nProduct Name: Anessa Perfect UV Brightening Sunscreen Skincare Gel 50 SPF\nPrice and Size: Bought mine for 1,030 pesos / 90g\nEffects/Experience:\n- Really gives you that radiant glow after application due to its tone-up effect\n- Does not leave any white cast but you must apply it properly\n- Super light-weight!\n- Noticed that I sweat and oil less once it is applied\n- Did not experience any breakouts\nStatus: HG",
    "comment_id": "ms0nmh9",
    "comment_score": 20,
    "comment_created_utc": 1747100223.0,
    "comment_author": "emmanuelle-mimieux",
    "match_confidence": 0.7524752475247525,
    "matched_product": "Anessa Perfect UV Sunscreen Skin Care Milk"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "Anessa",
    "price_size": "1,500+ and 60mL",
    "effects": "doesnt make my face more oily. found a lot of sunscreen tests and it always had the best result",
    "status": "HG",
    "comment": "Skin Type: Oily\nProduct Name: Anessa\nPrice and Size: 1,500+ and 60mL\nEffects/Experience: doesnt make my face more oily. found a lot of sunscreen tests and it always had the best result\nStatus: HG!!!!",
    "comment_id": "mrw4jbz",
    "comment_score": 15,
    "comment_created_utc": 1747046740.0,
    "comment_author": "sakayatanaka",
    "match_confidence": 0.8,
    "matched_product": "Anessa Perfect UV Sunscreen Skin Care Milk"
  },
  {
    "skin_type": [
      "Sensitive",
      "Acne Prone"
    ],
    "product_name": "Belo Pure Mineral Sunscreen",
    "price_size": "₱535/50ml",
    "effects": "Blends super easy and has a matte finish unlike other sunscreens (lalo na’t mataas ang % ng mga UV filters niya), mas okay pa nga to compared to other chemical sunscreen na ang hirap iblend plus ang oily sa face",
    "status": "HG",
    "comment": "Skin Type: Sensitive, Acne prone\nProduct Name: Belo Pure Mineral Sunscreen\nPrice and Size: ₱535/50ml\nEffects/Experience: Blends super easy and has a matte finish unlike other sunscreens (lalo na’t mataas ang % ng mga UV filters niya), mas okay pa nga to compared to other chemical sunscreen na ang hirap iblend plus ang oily sa face\nStatus: HG, WR—lalo na pag nagb1t1 siya (🤞🏼hopefully 🤞🏼tulad ng other sunscreens nila huhu)\n~~\nDati ang HG ko talag is the Perfected Beauty Salve Pure Mineral tinted sunscreen kaso sobrang mahal na niya ngayon halos hindi na makatarungan ₱700+/50ml pero if you have the budget I highly recommend this product. What I love about this sunscreen is that Pure mineral sunscreen siya without any whitecast and meron siyang Iron oxide that protects you from visible light and can help you lighten your darkspots. Unfortunately until now wala pa ako nahahanap na pure physical sunscreen na merong iron oxide that won’t break the bank :(",
    "comment_id": "mrzftek",
    "comment_score": 6,
    "comment_created_utc": 1747085404.0,
    "comment_author": "InfiniteChocoyummy",
    "match_confidence": 0.7037037037037037,
    "matched_product": "Belo Dewy Essence Sunscreen"
  },
  {
    "skin_type": [
      "Oily",
      "Combination"
    ],
    "product_name": "Skin Aqua Moisture UV Gel",
    "price_size": "375 plus for 50 ml",
    "effects": "Not effective as a sunscreen. Don’t be fooled by its SPF! It burns through the skin, making it painful despite reapplication.",
    "status": "WNR",
    "comment": "Skin Type: Combi-Oily\nProduct Name: Skin Aqua Moisture UV Gel\nPrice and Size: 600 plus for 100 g\nEffects/Experience: Skin looks and feels moisturized after application. Super effective, being under the sun didn’t feel painful.\nStatus: HG\n——-\nProduct Name: Beach Hut Sunblock\nPrice and Size: 375 plus for 50 ml\nEffects/Experience: Not effective as a sunscreen. Don’t be fooled by its SPF! It burns through the skin, making it painful despite reapplication.\nStatus: WNR",
    "comment_id": "mrvrhpp",
    "comment_score": 5,
    "comment_created_utc": 1747038743.0,
    "comment_author": "reveriereverie13",
    "match_confidence": 0.7213114754098361,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [
      "Dry",
      "Sensitive"
    ],
    "product_name": "Skin Aqua UV Super Moisture Milk SPF 50+ PA++++",
    "price_size": "Php 545 // 40ml. I wish it came in a bigger size.",
    "effects": "This is a hybrid sunscreen (has both chemical and physical sun filters). I use Skinoren Azelaic Acid in the morning and this sunscreen doesn't aggravate the stinging sensation. If you use azelaic acid, usually physical sunscreen is recommended, but it has white cast. Chemical sunscreens doesn't, but it always stings. So this sunscreen is perfect. It has a runny milky consistency. It's smooth and very easy to blend. It dries down with a satin finish, perfect for a makeup base or on it's own.",
    "status": "HG",
    "comment": "**Skin Type**: Dry & Sensitive\n**Product Name**: Skin Aqua UV Super Moisture Milk SPF 50+ PA++++\n**Price and Size**: Php 545 // 40ml. I wish it came in a bigger size.\n**Effects/Experience**: This is a hybrid sunscreen (has both chemical and physical sun filters). I use Skinoren Azelaic Acid in the morning and this sunscreen doesn't aggravate the stinging sensation. If you use azelaic acid, usually physical sunscreen is recommended, but it has white cast. Chemical sunscreens doesn't, but it always stings. So this sunscreen is perfect. It has a runny milky consistency. It's smooth and very easy to blend. It dries down with a satin finish, perfect for a makeup base or on it's own.\n**Status**: HG!!! I WILL FOREVER REPURCHASE THIS. I've been using Beauty of Joseon for the longest time, but ever since I started azelaic acid I stopped. Idk if it's true that it was discontinued already 😭 I hope not. Hopefully not a reformulation too.",
    "comment_id": "mrvzqsn",
    "comment_score": 5,
    "comment_created_utc": 1747044048.0,
    "comment_author": "devonnemai",
    "match_confidence": 0.7692307692307693,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [
      "Normal",
      "Combination",
      "Dry"
    ],
    "product_name": "Anessa Perfect UV Sunscreen Skincare Gel SPF50+ PA++++",
    "price_size": "P1,416 | 90g (based online) / Anessa throws promos every now and then on diff apps",
    "effects": "All in one sunscreen + makeup base/primer. It really healed my skin overall, especially when I had out-of-nowhere allergies H2 onwards of last year. I love that it leaves a dewy glow and not a white cast. Quite pricey but I learned that if a specific product works wonders for your skin, it’s an investment more than anything else. Plus, it’s a Japanese product so 💯 PS: for dry skin girlies, best to use water-based sunscreen (gels) as it should hydrate/rehydrate your skin!",
    "status": "HG",
    "comment": "Skin Type: Normal (I used to be combination but i had a really bad allergy attack last year which led to my skin being dry, then now i’m normal)\nProduct Name: Anessa Perfect UV Sunscreen Skincare Gel SPF50+ PA++++\nPrice and Size: P1,416 | 90g (based online) / Anessa throws promos every now and then on diff apps\nEffects & Experience: All in one sunscreen + makeup base/primer. It really healed my skin overall, especially when I had out-of-nowhere allergies H2 onwards of last year. I love that it leaves a dewy glow and not a white cast. Quite pricey but I learned that if a specific product works wonders for your skin, it’s an investment more than anything else. Plus, it’s a Japanese product so 💯\nPS: for dry skin girlies, best to use water-based sunscreen (gels) as it should hydrate/rehydrate your skin!\nStatus: HG",
    "comment_id": "mrvu668",
    "comment_score": 3,
    "comment_created_utc": 1747040500.0,
    "comment_author": "Secret-Guarantee-708",
    "match_confidence": 0.8351648351648352,
    "matched_product": "Anessa Perfect UV Sunscreen Skin Care Milk"
  }
]