[
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "Skin Aqua UV Super Moisture Gel",
    "price_size": "110g | 450-550",
    "effects": "Been a Bioré girl ever since but nagoioil up ako sa biore so tried this one out and I’m currently on my 3 bottle na. Its suitable for oily gals since it is easily absorbed by the skin. No sticky feeling as well",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "Skin Type: Oily\nProduct Name: Skin Aqua UV Super Moisture Gel\nPrice and Size: 110g | 450-550\nEffects and Experience: Been a Bioré girl ever since but nagoioil up ako sa biore so tried this one out and I’m currently on my 3 bottle na. Its suitable for oily gals since it is easily absorbed by the skin. No sticky feeling as well\nStatus: HG",
    "comment_id": "j9nh55r",
    "comment_score": 20,
    "comment_created_utc": 1677131396.0,
    "comment_author": "_luna21",
    "match_confidence": 0.8051948051948052,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold Sunscreen"
  },
  {
    "skin_type": [
      "Sensitive",
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Skin Aqua UV Moisture Gold Gel SPF50+ PA++++",
    "price_size": "Php550 for 110g",
    "effects": "finally found a sunscreen that works on my super arteng skin!! Very lightweight, easy to spread and doesn’t sting my eyes. I usually get closed comedones and pimples when using sunscreen pero sa product na ‘to wala. Very hiyang talaga ako dito and ganda din ng lapat nya sa make up. Fresh buong araw. Di ako mukang dugyot while using this sunscreen.",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "Skin Type: Sensitive, Oily & Acne Prone\nProduct Name: Skin Aqua UV Moisture Gold Gel SPF50+ PA++++\nPrice: Php550 for 110g\nEffects/Experience: finally found a sunscreen that works on my super arteng skin!! Very lightweight, easy to spread and doesn’t sting my eyes. I usually get closed comedones and pimples when using sunscreen pero sa product na ‘to wala. Very hiyang talaga ako dito and ganda din ng lapat nya sa make up. Fresh buong araw. Di ako mukang dugyot while using this sunscreen.\nStatus: HG & WR 💖💖💖💖",
    "comment_id": "jbdf3lw",
    "comment_score": 12,
    "comment_created_utc": 1678255935.0,
    "comment_author": "Muffinlooove",
    "match_confidence": 0.6588235294117647,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold Sunscreen"
  },
  {
    "skin_type": [
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Skin Aqua UV Super Moisture Gel",
    "price_size": "140g",
    "effects": "Really wanted to like this one pero unfortunately nagka-comedones ako dito. It's very dewy/shiny on my skin even when it sets. Mabilis din mag-oil up skin ko pag gamit ko to kahit lagyan ko ng setting powder.",
    "status": "WNR (Will Not Repurchase)",
    "availability": null,
    "comment": "Skin Type: Snesitive, Oily, Acne-prone\nProduct Name: Skin Aqua UV Super Moisture Gel\nPrice and Size: 140g\nEffects and Experience: Really wanted to like this one pero unfortunately nagka-comedones ako dito. It's very dewy/shiny on my skin even when it sets. Mabilis din mag-oil up skin ko pag gamit ko to kahit lagyan ko ng setting powder.\nStatus: WNR",
    "comment_id": "jpzvj9n",
    "comment_score": 12,
    "comment_created_utc": 1688048358.0,
    "comment_author": "lanwangjisus",
    "match_confidence": 0.8051948051948052,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold Sunscreen"
  },
  {
    "skin_type": [
      "Combination",
      "Dry",
      "Oily"
    ],
    "product_name": "Belo SunExpert Dewy Essence Sunscreen SPF50 PA++++",
    "price_size": "50ml, Php430.00",
    "effects": "I love this stuff. This is the most lightweight sunscreen I've ever used, though I prefer emollient sunscreens so take this with a grain of salt. For reference, the original SunExpert Face with SPF40 was lightweight for me, and Dewy Essence feels even more comfortable than that. Some people find that pretty heavy. I can layer this and use three fingers' worth of product without a problem, and it doesn't break me out. I don't really find this dewy or shiny. I tend to get oily throughout the day but this doesn't add to my usual amount of oiliness. This and the OG are great makeup primers, too.",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "Skin Type: Combination, dry-leaning with a tendency to get oily in the T-zone\nProduct Name: Belo SunExpert Dewy Essence Sunscreen SPF50 PA++++\nPrice and Size: 50ml, Php430.00\nEffects/Experience: I love this stuff. This is the most lightweight sunscreen I've ever used, though I prefer emollient sunscreens so take this with a grain of salt. For reference, the original SunExpert Face with SPF40 was lightweight for me, and Dewy Essence feels even more comfortable than that. Some people find that pretty heavy. I can layer this and use three fingers' worth of product without a problem, and it doesn't break me out. I don't really find this dewy or shiny. I tend to get oily throughout the day but this doesn't add to my usual amount of oiliness. This and the OG are great makeup primers, too.\nStatus: (HG for Holy Grail, WR for Will Repurchase, WNR for Will Not Repurchase) Probably my HG at this point",
    "comment_id": "j9o63mo",
    "comment_score": 11,
    "comment_created_utc": 1677150883.0,
    "comment_author": null,
    "match_confidence": 0.7397260273972602,
    "matched_product": "Belo Dewy Essence Sunscreen"
  },
  {
    "skin_type": [
      "Combination",
      "Acne Prone"
    ],
    "product_name": "** Canmake UV Mermaid Sun Gel Clear/Cica",
    "price_size": "** around ₱500, 40ml",
    "effects": "** HG! No issues with it and I’m too lazy to experiment with other brands at this point haha",
    "status": null,
    "availability": null,
    "comment": "**Skin Type:** Combination, acne-prone\n**Product Name:** Canmake UV Mermaid Sun Gel Clear/Cica\n**Price and Size:** around ₱500, 40ml\n**Effects/Experience:** I first tried the Clear variant and I really liked it! No white cast, no alcohol/fragrance as well so it’s likely okay for those with sensitive skin like me. Pwede rin siya around the eyes, it doesn’t sting.\nTried the Cica version last month and I think I’ll switch to it permanently hehe. Love the slight green tint as someone who has PIE 🥲\nedit: It also doubles as a primer I believe!\nCon would be that it’s not waterproof - not an issue if for daily use lang sa work or school with minimal sun exposure. Also it has a dewy finish I think so medj kita kapag textured ang skin (like mine lol) but I don’t find this much of a problem.\n**Status:** HG! No issues with it and I’m too lazy to experiment with other brands at this point haha",
    "comment_id": "jbf941x",
    "comment_score": 11,
    "comment_created_utc": 1678294914.0,
    "comment_author": "23fantasy",
    "match_confidence": 0.8461538461538461,
    "matched_product": "Canmake UV Mermaid Sun Gel Clear Sunscreen"
  },
  {
    "skin_type": [
      "Oily",
      "Acne Prone",
      "Sensitive"
    ],
    "product_name": "** Canmake Mermaid Skin Gel UV (Clear)",
    "price_size": "** 500 PHP, 40g on Shopee",
    "effects": "** This is nice! It may be greasy upon initial application but dries down to a more healthy dewy look. Did not break me out, no stinging or any irritation. Maganda gamitin lalo na for cold weather. Yiu can really why it's recommended by many people. Cons lang is that it's not sweat-resistant, which is what I need for the summer season 🥲 My face sweats like crazy and this will immediately melt once I step out of the house.",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "**Skin Type:** Oily, acne-prone, sensitive skin\n**Product Name:** Canmake Mermaid Skin Gel UV (Clear)\n**Price and Size:** 500 PHP, 40g on Shopee\n**Effects/Experience:** This is nice! It may be greasy upon initial application but dries down to a more healthy dewy look. Did not break me out, no stinging or any irritation. Maganda gamitin lalo na for cold weather. Yiu can really why it's recommended by many people. Cons lang is that it's not sweat-resistant, which is what I need for the summer season 🥲 My face sweats like crazy and this will immediately melt once I step out of the house.\n**Status:** HG so far. Sad lang na it's not sweat-resistant.",
    "comment_id": "jertl6r",
    "comment_score": 10,
    "comment_created_utc": 1680520190.0,
    "comment_author": "lanwangjisus",
    "match_confidence": 0.7466666666666667,
    "matched_product": "Canmake UV Mermaid Sun Gel Clear Sunscreen"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "Bioré UV Watery Essence",
    "price_size": "Watsons = 535php, Mercury Drug = I cant remember pero mas cheap sya sa Mercury Drug",
    "effects": "Prescribed by my derma kasi I had Acne Vulgaris. Okay naman sya but pag lumalabas ako and nakamask, pansin ko lang is parang shiny shimmery un face ko lol. tho feel ko okay naman un sun protection nya di ko lang bet un mejo shiny sya hehe. I would like to try other sunscreens but eto un nireseta ng derma, and i‘m scared na magbreakout nanaman",
    "status": "WR (Will Repurchase)",
    "availability": null,
    "comment": "Skin Type: Oily\nProduct Name: Bioré UV Watery Essence\nPrice and Size: Watsons = 535php, Mercury Drug = I cant remember pero mas cheap sya sa Mercury Drug\nEffects/Experience: Prescribed by my derma kasi I had Acne Vulgaris. Okay naman sya but pag lumalabas ako and nakamask, pansin ko lang is parang shiny shimmery un face ko lol. tho feel ko okay naman un sun protection nya di ko lang bet un mejo shiny sya hehe. I would like to try other sunscreens but eto un nireseta ng derma, and i‘m scared na magbreakout nanaman\nStatus: WR, for safety hehe\nedited: added some details",
    "comment_id": "j9nix6m",
    "comment_score": 9,
    "comment_created_utc": 1677132559.0,
    "comment_author": "pessimistHotdog",
    "match_confidence": 0.6666666666666666,
    "matched_product": "Biore UV Aqua Rich Watery Essence Sunscreen"
  },
  {
    "skin_type": [
      "Oily",
      "Sensitive"
    ],
    "product_name": "**",
    "price_size": "**",
    "effects": "** Isntree. No whitecast! Dewy finish. Didnt get breakout or what. Super moisturizing! Kaya I skip na my usual moisturizer in the morning. A little goes a long way pero generous ako mag apply ng sunscreen lol. Downside lang pala nito hindi water resistant. Biore. I have Biore for back up whenever I go swimming or do water activities. But since di naman ako nagbbeach lately, Isntree talaga gamit ko indoor and outdoor. Issue ko lang sa Biore, sobrang oily ko after huhu kaya pang water ko lang talaga sya ginagamit. May strong scent din pala to upon application.",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "**Skin Type:** Oily, sensitive, gets pimple occasionally (puyat, period, stress etc)\n**Product Name:**\nIsntree Hyaluronic Acid Watery Sun Gel\nBiore UV Watery Essence\n**Price and Size:**\nIsntree ~₱500 for 50ml\nBiore ~₱500 for 50g\n**Effects/Experience:**\nIsntree. No whitecast! Dewy finish. Didnt get breakout or what. Super moisturizing! Kaya I skip na my usual moisturizer in the morning. A little goes a long way pero generous ako mag apply ng sunscreen lol. Downside lang pala nito hindi water resistant.\nBiore. I have Biore for back up whenever I go swimming or do water activities. But since di naman ako nagbbeach lately, Isntree talaga gamit ko indoor and outdoor. Issue ko lang sa Biore, sobrang oily ko after huhu kaya pang water ko lang talaga sya ginagamit. May strong scent din pala to upon application.\n**Status:** both HG 🥰",
    "comment_id": "j9nztrk",
    "comment_score": 8,
    "comment_created_utc": 1677145713.0,
    "comment_author": null,
    "match_confidence": 0.8,
    "matched_product": "Nivea Derma Skin Clear Deep Pore Cleanser"
  },
  {
    "skin_type": [
      "Normal",
      "Dry"
    ],
    "product_name": "[Skin Aqua UV Super Moisture Gel SPF50+ PA++++](https://shp.ee/acqfuty)",
    "price_size": "110g for ₱450",
    "effects": "I alternate this with my Skin1004 Hyalu-Cica Water Fit Sun Serum. I use this on days my skin isn't feeling too dry or I'm not too lazy for moisturizer [it's not drying ah, I just really have dry skin most of the time since I use actives too kaya my skin requires the use of moisturizer]. Feels good on the skin, non-greasy, and no white cast! It's absorbed well on my skin + barely any drying time. The 110g lasts me soooo long despite using it every day [I reapply this when I'm at home since I'm barefaced lang naman]. No irritations whatsoever.",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "Skin Type: Normal-Dry\nProduct Name: [Skin Aqua UV Super Moisture Gel SPF50+ PA++++](https://shp.ee/acqfuty)\nPrice & Size: 110g for ₱450\nEffects/Experience: I alternate this with my Skin1004 Hyalu-Cica Water Fit Sun Serum. I use this on days my skin isn't feeling too dry or I'm not too lazy for moisturizer [it's not drying ah, I just really have dry skin most of the time since I use actives too kaya my skin requires the use of moisturizer]. Feels good on the skin, non-greasy, and no white cast! It's absorbed well on my skin + barely any drying time. The 110g lasts me soooo long despite using it every day [I reapply this when I'm at home since I'm barefaced lang naman]. No irritations whatsoever.\nStatus: WR [can't say it's my HG since I've only been using this for a little over 2 months and I think that's too soon for it to be called a holy grail]",
    "comment_id": "jbdfuym",
    "comment_score": 10,
    "comment_created_utc": 1678256471.0,
    "comment_author": "makeupnskincareonly",
    "match_confidence": 0.6990291262135923,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold Sunscreen"
  },
  {
    "skin_type": [
      "Combination"
    ],
    "product_name": "Anessa Perfect UV Sunscreen",
    "price_size": "442 for 40 ml (but there are several promo bundles on this product)",
    "effects": "Not worth it in my opinion. I got the bundle during a payday sale so it was much cheaper but I still think not worth it for me just because I ended up just giving it away. It ruined my makeup after less than 2 hours. Hulas na hulas talaga. It also made my pores feel congested for some reason. I don't think it's for me but if you really want to try it out, get it on a sale. I got my oil cut powder pact + sun base bundle for only ₱231 so I don't think completely nalugi ako.",
    "status": null,
    "availability": null,
    "comment": "Skin Type: Combination\nProduct Name: Anessa Perfect UV Sunscreen\nPrice and Size: 1990 for 60ml on shopee\nEffects/Experience: For me, this is the best best sunscreen I have ever tried. It feels weightless on the skin. It doesn't ruin your makeup. Commuter-friendly din! Medyo pricey pero I feel like worth it naman kasi I have never tried something I liked as much as this!\n____________\nSkin Type: Combination\nProduct Name: I'm Meme I'm Super Light Oil Sun Base\nPrice and Size: 442 for 40 ml (but there are several promo bundles on this product)\nEffects/Experience: Not worth it in my opinion. I got the bundle during a payday sale so it was much cheaper but I still think not worth it for me just because I ended up just giving it away. It ruined my makeup after less than 2 hours. Hulas na hulas talaga. It also made my pores feel congested for some reason. I don't think it's for me but if you really want to try it out, get it on a sale. I got my oil cut powder pact + sun base bundle for only ₱231 so I don't think completely nalugi ako.",
    "comment_id": "j9v20vj",
    "comment_score": 6,
    "comment_created_utc": 1677267426.0,
    "comment_author": "doyeonse",
    "match_confidence": 0.8,
    "matched_product": "Anessa Perfect UV Sunscreen Skin Care Milk"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "Canmake Mermaid Skin Gel",
    "price_size": "30/40g(?) | 600-700",
    "effects": "For me, this sunscreen is a hybrid of sunscreen and primer since it gives you a nice glow when you use it. Its also good for oily skin kasi no sticky feeling din.",
    "status": "WR (Will Repurchase)",
    "availability": null,
    "comment": "Skin Type: Oily\nProduct Name: Canmake Mermaid Skin Gel\nPrice and Size: 30/40g(?) | 600-700\nEffects and Experience: For me, this sunscreen is a hybrid of sunscreen and primer since it gives you a nice glow when you use it. Its also good for oily skin kasi no sticky feeling din.\nStatus: WR - Namamahalan kasi ako saknya for its size so WR lang haha",
    "comment_id": "j9nhg3s",
    "comment_score": 4,
    "comment_created_utc": 1677131591.0,
    "comment_author": "_luna21",
    "match_confidence": 0.6666666666666666,
    "matched_product": "Canmake UV Mermaid Sun Gel Clear Sunscreen"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "Bioré UV Aqua Rich - Watery Essence",
    "price_size": "50g | 450-500",
    "effects": "This is the first Jap sunscreen I feel inlove with. Super suitable for oily skin pips and even tho it has alcohol content, it doesnt bother me that much. However, nagooil up ako dito sometimes so I have to set it with powder. Eto rin gamit na sunscreen ng derma ko so def a must try sunscreen",
    "status": "WR (Will Repurchase)",
    "availability": null,
    "comment": "Skin Type: Oily\nProduct Name: Bioré UV Aqua Rich - Watery Essence\nPrice and Size: 50g | 450-500\nEffects and Experience: This is the first Jap sunscreen I feel inlove with. Super suitable for oily skin pips and even tho it has alcohol content, it doesnt bother me that much. However, nagooil up ako dito sometimes so I have to set it with powder. Eto rin gamit na sunscreen ng derma ko so def a must try sunscreen\nStatus: WR",
    "comment_id": "j9ni6ni",
    "comment_score": 5,
    "comment_created_utc": 1677132079.0,
    "comment_author": "_luna21",
    "match_confidence": 0.8421052631578947,
    "matched_product": "Biore UV Aqua Rich Watery Essence Sunscreen"
  },
  {
    "skin_type": [
      "Normal",
      "Oily",
      "Sensitive",
      "Acne Prone"
    ],
    "product_name": "** Beauty of Joseon Relief Sun: Rice + Probiotics (SPF50+ PA++++)",
    "price_size": "** 145 for 10 ml, bought this from Shopee",
    "effects": "** There was a slight sting after my first initial application, pero after ilang use ulit, wala na. It did not break me out which was great and there was no further irritation. However, it sits on my skin after application and leaves a shine on it. It's a combination of dewy/greasy skin kung susumahin ko hahaha. I think it's a good combo for sunscreen and moisturizer. Yun nga lang, it makes me oily after ilang hours kahit nasa bahay lang ako. I don't think this would be a great sunscreen for me if I'm going out/commuting dahil sure na mas magiging oily yung face ko dito after sweating.",
    "status": "WR (Will Repurchase)",
    "availability": null,
    "comment": "**Skin Type:** Normal to Oily, Sensitive, Acne-prone\n**Product Name:** Beauty of Joseon Relief Sun: Rice + Probiotics (SPF50+ PA++++)\n**Price and Size:** 145 for 10 ml, bought this from Shopee\n**Effects/Experience:** There was a slight sting after my first initial application, pero after ilang use ulit, wala na. It did not break me out which was great and there was no further irritation. However, it sits on my skin after application and leaves a shine on it. It's a combination of dewy/greasy skin kung susumahin ko hahaha. I think it's a good combo for sunscreen and moisturizer. Yun nga lang, it makes me oily after ilang hours kahit nasa bahay lang ako. I don't think this would be a great sunscreen for me if I'm going out/commuting dahil sure na mas magiging oily yung face ko dito after sweating.\n**Status:** WR lang because it works for me but makes my face oily.",
    "comment_id": "jabsqec",
    "comment_score": 5,
    "comment_created_utc": 1677571697.0,
    "comment_author": "lanwangjisus",
    "match_confidence": 0.8080808080808081,
    "matched_product": "Beauty of Joseon Relief Sun Sunscreen: Rice + Probiotics"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "Biorè UV Aqua Rich - Watery Gel",
    "price_size": "90g | 550 - 650",
    "effects": "Tried this once nung nawalan ako ng stock nung Watery Essence. I feel like this is more suitable for dry - combi skin and not for the oily skin. Medyo may whitecast din sya when you first apply it but pag nagset naman, nawawala na. Less fragrance din ito compared sa watery essence.",
    "status": "WNR (Will Not Repurchase)",
    "availability": null,
    "comment": "Skin Type: Oily\nProduct Name: Biorè UV Aqua Rich - Watery Gel\nPrice and Size: 90g | 550 - 650\nEffects and Experience: Tried this once nung nawalan ako ng stock nung Watery Essence. I feel like this is more suitable for dry - combi skin and not for the oily skin. Medyo may whitecast din sya when you first apply it but pag nagset naman, nawawala na. Less fragrance din ito compared sa watery essence.\nStatus: WNR",
    "comment_id": "j9nidvj",
    "comment_score": 4,
    "comment_created_utc": 1677132211.0,
    "comment_author": "_luna21",
    "match_confidence": 0.7222222222222222,
    "matched_product": "Biore UV Aqua Rich Watery Essence Sunscreen"
  },
  {
    "skin_type": [
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Skin Aqua UV Super Moisture Gel Gold SPF 50+ PA++++",
    "price_size": "This has a pretty strong fragrance. This is the new version which have PA++++ instead of 3 pluses. If I can verify that my face if fine with the fragrance and the sunscreen, then I'll definitely choose this over the Benton and Beauty of Joseon suncreens. This is just like them but lighter, faster to spread and goes completely clear on the skin. I heard that the BOJ may have a slight whitecast on deeper skin tones but this one will probably not have one. This is priced very nicely and is not as shiny or dewy as the above two.",
    "effects": "This is similar to the Benton but without essential oil. I would say that this has a pretty different texture, parang kakaiba yung feel niya once you spread it, but the finish remains the same. I can't really say whether the Benton or the Beauty of Joseon is shinier, but both looks very reflective after applying but they do set into an acceptable finish. Same thoughts to Benton really, if you like one of them then you'll like the other. Also almost forgot to mention, both stings my fingers as I apply them though my face feels fine.",
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "Skin Type: Oily, acne-prone that may also be dehydrated. I notice that a lot of products that didn't really suited my skin took awhile to start showing bad effects and these effects were very slow to emerge so medyo pahirapan malaman kung alin ba yung issue sa mga pruoducts na gamit ko.\nI'm quite new to sunscreens so these would all be my \"first impressions\" of the products though I've already used most of these multiple times already.\nProduct Name: Skin Aqua UV Super Moisture Gel Gold SPF 50+ PA++++\nPrice and Size: 500-600 PHP / 110g\nEffects/Experience: Extremely nice, this one is lightweight and very easy to blend. It disappears on your skin and leaves it with a natural finish, maybe ever so slightly more glowy than before you applied but otherwise almost nothing. The feeling it leaves your skin is quite smooth and also pretty natural. It has alcohol but aside from the smell which disappears completely after a few seconds, I did not really experience any bad effects from this. This is neither moisturizing nor drying. Fragrance free and water resistant.\nStatus: HG probably, definitely\nProduct Name: Kose Suncut  UV Perfect Gel SPF 50+ PA++++\nPrice and Size: 500-600 PHP / 100g\nEffects/Experience: I would say that this is quite comparable to the Skin Aqua above but they have their differences. This feels a little silicone-y or idk. It's lightweight and zero whitecast but it dries very quickly on your skin that I'm still not done spreading it but it's already setting on my skin, will does cause it to pill a little, especially on my brows. Like the Skin Aqua, this has alcohol though I will say that my face doesn't look \"as good\" at the end of the day after using this compared to the skin aqua so this may be ever so slightly drying. Also I noticed multiple times that this was making my eyes a bit sensitive and feel cool. Fragrance free and water resistant.\nStatus: MRP\nProduct Name: OMI Menturm VERDIO UV Moisture Gel SPF 50+ PA++++\nPrice and Size: 350-499 PHP / 80g (also in 220g)\nEffects/Experience: This, compared to the other Japanese sunscreens is alcohol-free. Also fragrance-free, water resistant. This one seems to be advertised for those with sensitive skin as this also is advertised for kids. This is very milky/gloopy. Using this, you will notice that it doesn't set as quickly as the Skin Aqua but is still easy to spread and is definitely on the dewy, glowy, shiny side of sunscreens. Whether that is a good thing or a bad thing will depend on you. This is just like the other Korean sunscreens where if you want something moisturizing, dewy, and have other beneficial ingredients then you may want to try this.\nStatus: WRP, maybe HG for the type of sunscreen which has no alcohol and feels a little more like skincare and not just for protection.\nProduct Name: Benton Air Fit UV Defense Sun Cream\nPrice and Size: 500 PHP / 50ml\nEffects/Experience: I bought this together with the Beauty of Joseon and I will say that they are pretty comparable. The Benton has a green tint which doesn't really do anything as it turns watery once you start spreading it. This also have an essential oil which you can definitely smell. Like the Omi Menturm, this is shiny, dewy etc but is not water resistant. This also feels a little thicker on the skin once it dries down and it doesn't really sets or disappear like those really lightweight sunscreens.\nStatus: MRP, maybe not, not quite sure yet.\nProduct Name: Beauty of Joseon Relief Sun Rice + Probiotics SPF50+ PA++++\nPrice and Size: 500-600 PHP / 50ml\nEffects/Experience: This is similar to the Benton but without essential oil. I would say that this has a pretty different texture, parang kakaiba yung feel niya once you spread it, but the finish remains the same. I can't really say whether the Benton or the Beauty of Joseon is shinier, but both looks very reflective after applying but they do set into an acceptable finish. Same thoughts to Benton really, if you like one of them then you'll like the other. Also almost forgot to mention, both stings my fingers as I apply them though my face feels fine.\nStatus: MRP, maybe not, not quite sure yet.\nProduct Name: Etude House Sunprise Mild Watery Light SPF50+ PA++++\nPrice and Size: 400\\~ PHP / 50g\nEffects/Experience: This has a pretty strong fragrance. This is the new version which have PA++++ instead of 3 pluses. If I can verify that my face if fine with the fragrance and the sunscreen, then I'll definitely choose this over the Benton and Beauty of Joseon suncreens. This is just like them but lighter, faster to spread and goes completely clear on the skin. I heard that the BOJ may have a slight whitecast on deeper skin tones but this one will probably not have one. This is priced very nicely and is not as shiny or dewy as the above two.\nStatus: MRP",
    "comment_id": "j9oic0n",
    "comment_score": 5,
    "comment_created_utc": 1677158552.0,
    "comment_author": "hlthnwllnss",
    "match_confidence": 0.8260869565217391,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold Sunscreen"
  },
  {
    "skin_type": [
      "Combination"
    ],
    "product_name": "BEAUTY OF JOSEON RELIEF SUN: RICE AND PROBIOTICS SPF50PA++++",
    "price_size": "35 ML 499PHP",
    "effects": "Dahil I prefer this over BOJ. I know, I know, hindi siya \"sunscreen\" mas skin tint/moisturizer siya accdg sa label pero I use this as my daily base instead of foundation. I prefer this over BOJ kase magaan sya sa skin pero it brightens my complexion. Saks ang effect at size for the price pero I really wish it contains more product. Naka-ilang REBUY na ako nito pero I am willing to buy another product that delivers the same effects with more product in the container. Now that I think about it, parang mas sustainable choice if madaling maubos kase if sawa ka na agad sa product, before you know it, you're already halfway through the bottle lol. Maunti siya talaga. EDIT: ISSY AND CO ay madali ring magtransfer sa face mask eh I dont put a powder on top of it pa man din. Kaya looking for alternative rin ako lol",
    "status": null,
    "availability": null,
    "comment": "SKIN TYPE: Combination\nPRODUCT NAME: BEAUTY OF JOSEON RELIEF SUN: RICE AND PROBIOTICS SPF50PA++++\nPRICE AND SIZE: 50 ML 624PHP\nEFFECTS/EXPERIENCE:\nHad breakouts the first time I used this with Paula's Choice AHA/BHA (basta yung bottle) so I don't recommend using it with toners of the same nature (acidic??) Kapag wala namang ganon before you apply the sunscreen it feels fine. Hindi naman heavy ang feeling pero kinda sticky at may chemical amoy. It doesn't brighten up your skin talagang flat, malagkit (rather than glowy) finish sya. Yes nabudol ako ng viral influencers dito lol\nWILL NOT REBUY ang verdict dahil-\nPRODUCT NAME: Issy and Co Active Skin SPF 35 in SAND\nPRICE AND SIZE: 35 ML 499PHP\nEFFECTS/EXPERIENCE:\nDahil I prefer this over BOJ. I know, I know, hindi siya \"sunscreen\" mas skin tint/moisturizer siya accdg sa label pero I use this as my daily base instead of foundation. I prefer this over BOJ kase magaan sya sa skin pero it brightens my complexion. Saks ang effect at size for the price pero I really wish it contains more product.\nNaka-ilang REBUY na ako nito pero I am willing to buy another product that delivers the same effects with more product in the container. Now that I think about it, parang mas sustainable choice if madaling maubos kase if sawa ka na agad sa product, before you know it, you're already halfway through the bottle lol. Maunti siya talaga.\nEDIT: ISSY AND CO ay madali ring magtransfer sa face mask eh I dont put a powder on top of it pa man din. Kaya looking for alternative rin ako lol",
    "comment_id": "ja1yhuw",
    "comment_score": 5,
    "comment_created_utc": 1677391422.0,
    "comment_author": "eyka07",
    "match_confidence": 0.8163265306122449,
    "matched_product": "Beauty of Joseon Relief Sun Sunscreen: Rice + Probiotics"
  },
  {
    "skin_type": [
      "Normal",
      "Oily"
    ],
    "product_name": "** Belo Sunexpert Dewy Essence Sunscreen SPF50 PA++++",
    "price_size": "** 442 for 50ML but i think there's B1T1 at some stores.",
    "effects": "** it's a decent combo sunscreen, perfect for people starting skincare and on a budget. it has a noticeable white cast, a strong vanilla fragrance, and it doesn't sting the eyes. overall, i think it's comfortable to use, easily accessible, affordable, and perfect for lazy morning skincare routines XD personally, i think there are better sunscreen options out there for even cheaper with no fragrance. it weirdly separates if left alone for awhile so make sure to shake properly. it does the job well but i'm not blown away by it.",
    "status": "WNR (Will Not Repurchase)",
    "availability": null,
    "comment": "**Skin Type:** Normal/Oily Combo\n**Product Name:** Belo Sunexpert Dewy Essence Sunscreen SPF50 PA++++\n**Price and Size:** 442 for 50ML but i think there's B1T1 at some stores.\n**Effects/Experience:** it's a decent combo sunscreen, perfect for people starting skincare and on a budget. it has a noticeable white cast, a strong vanilla fragrance, and it doesn't sting the eyes. overall, i think it's comfortable to use, easily accessible, affordable, and perfect for lazy morning skincare routines XD\npersonally, i think there are better sunscreen options out there for even cheaper with no fragrance. it weirdly separates if left alone for awhile so make sure to shake properly. it does the job well but i'm not blown away by it.\n**Status:** 5/10 WNR",
    "comment_id": "j9nonw3",
    "comment_score": 3,
    "comment_created_utc": 1677136609.0,
    "comment_author": "UnicornPonyPorn",
    "match_confidence": 0.7397260273972602,
    "matched_product": "Belo Dewy Essence Sunscreen"
  },
  {
    "skin_type": [
      "Combination"
    ],
    "product_name": "Missha Waterproof Sun Milk SPF50 PA++++",
    "price_size": "Around P700 for 70ml",
    "effects": "Great for everyday use, I work outdoors sometimes + have oily area on my skin so it's sweatproof and humidity proof; no whitecast. On my 3rd bottle. Slight issue that it's been making my skin a little oily which it didn't before, so while I'm looking for an alternative, I'll be sticking to this.",
    "status": "WR (Will Repurchase)",
    "availability": null,
    "comment": "Skin Type:Combination\nProduct Name: Missha Waterproof Sun Milk SPF50 PA++++\nPrice and Size: Around P700 for 70ml\nEffects/Experience: Great for everyday use, I work outdoors sometimes + have oily area on my skin so it's sweatproof and humidity proof; no whitecast. On my 3rd bottle. Slight issue that it's been making my skin a little oily which it didn't before, so while I'm looking for an alternative, I'll be sticking to this.\nStatus: WR",
    "comment_id": "j9ndwub",
    "comment_score": 2,
    "comment_created_utc": 1677129415.0,
    "comment_author": "waveitdowninside",
    "match_confidence": 0.6829268292682927,
    "matched_product": "Missha Safe Block Waterproof Sun Milk Sunscreen"
  },
  {
    "skin_type": [],
    "product_name": "Beauty of Joseon Relief Sun SPF50 PA++++",
    "price_size": "50ml, around Php600.00",
    "effects": null,
    "status": "HG (Holy Grail)",
    "availability": null,
    "comment": "Skin Type:  Combination, dry-leaning with a tendency to get oily in the T-zone\nProduct Name:  Beauty of Joseon Relief Sun SPF50 PA++++\nPrice and Size:  50ml, around Php600.00\nEffects/Experience:  I like the finish of this sunscreen. It reminds me of Cosrx Aloe Soothing Sun Cream, but this feels a little heavier and \"harder\" to spread. It's thick but like I said in another comment, I really dig moisturizing sunscreens so it's not an issue for me. It just might feel too much for oiler skin types. It's a nice makeup primer as well because it has that almost gripping finish.\nI really wanted to love this but it irritated my skin. It didn't break me out in visible acne, just gave me rougher skin texture and tiny, under-the-skin bumps. I suspect it's the fermented ingredient as this is also what the Cosrx Galactomyces Essence did to my face.\nStatus: (HG for Holy Grail, WR for Will Repurchase, WNR for Will Not Repurchase) WNR",
    "comment_id": "j9o6ytf",
    "comment_score": 2,
    "comment_created_utc": 1677151528.0,
    "comment_author": null,
    "match_confidence": 0.6746987951807228,
    "matched_product": "Beauty of Joseon Relief Sun Sunscreen: Rice + Probiotics"
  }
]