[
  {
    "skin_type": [
      "Oily",
      "Combination"
    ],
    "product_name": "Cosrx Salicylic Acid Daily Gentle Cleanser",
    "price_size": null,
    "effects": "Have been using this for around 4-5 years and this helped remove excess sebum talaga. Controlled my oil, helped with breakouts, gentle and very low % of salicylic so for everyday talaga. This is a very well known product that I assume has been tried by many, but still want to recommend it because it’s that effective. My first korean product and I still love it to this day! Disclaimer: this is more for oily/combi skin. Dry skin is not hiyang with this I think.",
    "status": "HG",
    "comment": "Skin Type: Oily / Combi\nProduct Name: Cosrx Salicylic Acid Daily Gentle Cleanser\nType: Foam\nPrice/Quantity: Varies but less than ₱300 for 150ml when you get it on discount (online)!\nEffect/experience: Have been using this for around 4-5 years and this helped remove excess sebum talaga. Controlled my oil, helped with breakouts, gentle and very low % of salicylic so for everyday talaga. This is a very well known product that I assume has been tried by many, but still want to recommend it because it’s that effective. My first korean product and I still love it to this day! Disclaimer: this is more for oily/combi skin. Dry skin is not hiyang with this I think.\nStatus: HG!!!!! 🩷🩷🩷",
    "comment_id": "l7o5i1r",
    "comment_score": 13,
    "comment_created_utc": 1717851801.0,
    "comment_author": "toorusgf",
    "match_confidence": 1.0,
    "matched_product": "Cosrx Salicylic Acid Daily Gentle Cleanser"
  },
  {
    "skin_type": [
      "Combination",
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Pyunkang Yul Acne Facial Cleanser",
    "price_size": null,
    "effects": "My mistake buying the 10% right off the bat 💀💀. I borrowed my mom’s 10% panoxyl benzoyl p. wash before and now that I moved out i ordered my own and bought the 10% na agad figuring that i can tolerate it naman na. When it arrived, that’s when i realized na fake pala gamit ng nanay ko and damn this stings so muchhh. I tried applying it every other day the first few weeks and minsan parang spot treatment lang, like ibababad ko one thick layer of wash sa active pimple ko for 1-3 mins bc i felt like the rest of my face couldn’t take the whole product. It works SO FAST. Literal parang kusa na lang nagpupush out yung pus palabas as i’m washing it off. Then I slap a pimple patch pag di pa completely natanggal yung pus. Perfect combination. Now I use it once a day and apply it to the T-zone since dun lang naman ako tinitigyawat at pansin ko ang galing din niya magexfoliate. Even more effective than the two salicylic products i bought from Cosrx and Skintific. So now I don’t use them anymore, just this panoxyl wash na lang. So yeah siguro advice ko na lang na stick to the 4% concentration if mild-mod acne lang naman and it would work just as well. Otherwise, this product is so good, it killed all my active pimples, prevented future breakouts and works as an exfoliator for me din. HG MATERIAL 👑👑👑",
    "status": "HG",
    "comment": "Skin Type: combination, oily and acne-prone\nProduct Name: Pyunkang Yul Acne Facial Cleanser\nOrder: First\nType: gel\nPrice/Quantity: 250 pesos/one 120 mL\nEffect/experience: I think this is my fave gentle cleanser na pasok sa budget ko. It’s not stripping and i still feel my natural oils retained after washing with it. It’s best used lalo na after oil cleansing and right before using tretinoin because safe siya sa barrier ko. I love it lol.\nStatus: WR\n———————————————\nProduct Name: PanOxyl 10% Benzoyl Peroxide Acne foaming wash\nOrder: First\nType: cream\nPrice/Quantity: 950 pesos/156 mL\nEffect/experience: My mistake buying the 10% right off the bat 💀💀. I borrowed my mom’s 10% panoxyl benzoyl p. wash before and now that I moved out i ordered my own and bought the 10% na agad figuring that i can tolerate it naman na. When it arrived, that’s when i realized na fake pala gamit ng nanay ko and damn this stings so muchhh.\nI tried applying it every other day the first few weeks and minsan parang spot treatment lang, like ibababad ko one thick layer of wash sa active pimple ko for 1-3 mins bc i felt like the rest of my face couldn’t take the whole product. It works SO FAST. Literal parang kusa na lang nagpupush out yung pus palabas as i’m washing it off. Then I slap a pimple patch pag di pa completely natanggal yung pus. Perfect combination.\nNow I use it once a day and apply it to the T-zone since dun lang naman ako tinitigyawat at pansin ko ang galing din niya magexfoliate. Even more effective than the two salicylic products i bought from Cosrx and Skintific. So now I don’t use them anymore, just this panoxyl wash na lang.\nSo yeah siguro advice ko na lang na stick to the 4% concentration if mild-mod acne lang naman and it would work just as well. Otherwise, this product is so good, it killed all my active pimples, prevented future breakouts and works as an exfoliator for me din. HG MATERIAL 👑👑👑\nStatus: HG 👑😩😩",
    "comment_id": "l7s1tl2",
    "comment_score": 13,
    "comment_created_utc": 1717912133.0,
    "comment_author": null,
    "match_confidence": 1.0,
    "matched_product": "Pyunkang Yul Acne Facial Cleanser"
  },
  {
    "skin_type": [
      "Dry",
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Cetaphil Gentle Skin cleanser (blue cap)",
    "price_size": null,
    "effects": "i used to only use Cerave but it's hard to source. Found Cetaphil and it suits me just fine plus it's way cheaper. This cleanser is mild and inoffensive. Perfect especially if like me you use actives in other parts of your routine (vit c, acids, retinol). This doesn't overwhelm my skin, not drying.",
    "status": "HG",
    "comment": "Skin Type: oily combo sa pinas. Dry combo colder climates. No acne / clear skin, occasional pimples lang once in a blue moon.\nProduct Name: Cetaphil Gentle Skin cleanser (blue cap)\nOrder: Second if I use an oil cleanser. OK sya as only cleanser if you don't wear makeup.\nType: liquid\nPrice/Quantity: smallest is around 300 for 118mls, or around 500 for 250 mls.\nEffect/experience: i used to only use Cerave but it's hard to source. Found Cetaphil and it suits me just fine plus it's way cheaper. This cleanser is mild and inoffensive. Perfect especially if like me you use actives in other parts of your routine (vit c, acids, retinol). This doesn't overwhelm my skin, not drying.\nStatus: WR, HG",
    "comment_id": "l7obmt9",
    "comment_score": 4,
    "comment_created_utc": 1717854582.0,
    "comment_author": "smpllivingthrowaway",
    "match_confidence": 0.8656716417910447,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  },
  {
    "skin_type": [
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Cosrx Salicylic Acid Daily Gentle Cleanser",
    "price_size": null,
    "effects": "Unfortunately, this did not work for me. Too drying for my face and may stinging sensation whenever I use this. Hindi lang talaga siguro ako hiyang.",
    "status": null,
    "comment": "Skin Type: Oily/ Acne Prone\nProduct name: Cosrx Salicylic Acid Daily Gentle Cleanser\nOrder: Second\nType: Liquid\nPrice: 220 (small)\nEffect: Unfortunately, this did not work for me. Too drying for my face and may stinging sensation whenever I use this. Hindi lang talaga siguro ako hiyang.\nStatus: Will not repurchase",
    "comment_id": "l7ogmiu",
    "comment_score": 3,
    "comment_created_utc": 1717856668.0,
    "comment_author": "Kz_Mafuyu",
    "match_confidence": 1.0,
    "matched_product": "Cosrx Salicylic Acid Daily Gentle Cleanser"
  },
  {
    "skin_type": [
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Cetaphil Gentle Skin Cleanser",
    "price_size": null,
    "effects": "Super mild on face and hindi nakaka-trigger ng acne. Medyo pricey lang pero worth it.",
    "status": "HG",
    "comment": "Skin Type: Oily/ Acne Prone\nProduct name: Cetaphil Gentle Skin Cleanser\nOrder: Second\nType: Liquid\nPrice: 170 (60 ml)\nEffect: Super mild on face and hindi nakaka-trigger ng acne. Medyo pricey lang pero worth it.\nStatus: HG",
    "comment_id": "l7ohlcw",
    "comment_score": 3,
    "comment_created_utc": 1717857059.0,
    "comment_author": "Kz_Mafuyu",
    "match_confidence": 1.0,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  },
  {
    "skin_type": [
      "Normal"
    ],
    "product_name": "Cetaphil Gentle Skin Cleanser",
    "price_size": null,
    "effects": "Soft ang feeling sa skin at di nakaka dry. Bihira lang ako magka acne so di ko alam if okay pa rin to gamitin.",
    "status": "HG",
    "comment": "Skin Type: Normal skin\nProduct name: Cetaphil Gentle Skin Cleanser\nOrder: Third\nType: Liquid\nPrice: 500+ (250 ml)\nEffect: Soft ang feeling sa skin at di nakaka dry. Bihira lang ako magka acne so di ko alam if okay pa rin to gamitin.\nStatus: HG, WR",
    "comment_id": "l7omiho",
    "comment_score": 3,
    "comment_created_utc": 1717859019.0,
    "comment_author": "sullenaya1",
    "match_confidence": 1.0,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  },
  {
    "skin_type": [],
    "product_name": "Luxe Organix's Aqua Lock hydrogel cleanser",
    "price_size": null,
    "effects": "just a bit of context. i tried to search up on youtube some anti-aging regimen recommendations and ito yung narecommend ni Jan Angelo from YT. so far I've used a 20mL variant and it's been great. It's gentle on the skin and has a nice soothing effect. very relaxing and its reminiscent of the milk cleanser from DermaBlend i used to use.",
    "status": "WR",
    "comment": "Skintype: combination\nProduct name: Luxe Organix's Aqua Lock hydrogel cleanser\nOrder: 1st\nType: Gel\nPrice: 122php for 20mL (repackaged yung naorder ko cause it seems to be discontinued. details below)\nEffect: just a bit of context. i tried to search up on youtube some anti-aging regimen recommendations and ito yung narecommend ni Jan Angelo from YT. so far I've used a 20mL variant and it's been great. It's gentle on the skin and has a nice soothing effect. very relaxing and its reminiscent of the milk cleanser from DermaBlend i used to use.\nStatus: WR\nps.\nmuch appreciated if anyone can chime in for alternative recommendations cause this product seems obscure nowadays (in 2024). with same anti aging properties, gel-type, low pH and has NO sodium lauryl sulfate)",
    "comment_id": "lenxmpo",
    "comment_score": 2,
    "comment_created_utc": 1721798265.0,
    "comment_author": "Acceptable_Winner628",
    "match_confidence": 1.0,
    "matched_product": "Luxe Organix's Aqua Lock hydrogel cleanser"
  },
  {
    "skin_type": [],
    "product_name": "Luxe Organix's Aqua Lock hydrogel cleanser",
    "price_size": null,
    "effects": "just a bit of context. i tried to search up on youtube some anti-aging regimen recommendations and ito yung narecommend ni Jan Angelo from YT. so far I've used a 20mL variant and it's been great. It's gentle on the skin and has a nice soothing effect. very relaxing and its reminiscent of the milk cleanser from DermaBlend i used to use.",
    "status": "WR",
    "comment": "Skintype: combination\nProduct name: Luxe Organix's Aqua Lock hydrogel cleanser\nOrder: 1st\nType: Gel\nPrice: 122php for 20mL (repackaged yung naorder ko cause it seems to be discontinued. details below)\nEffect: just a bit of context. i tried to search up on youtube some anti-aging regimen recommendations and ito yung narecommend ni Jan Angelo from YT. so far I've used a 20mL variant and it's been great. It's gentle on the skin and has a nice soothing effect. very relaxing and its reminiscent of the milk cleanser from DermaBlend i used to use.\nStatus: WR\nps.\nAnyone here who uses this product?\nI was scouring the internet and even tried to post here sa sub and ask for its whereabouts cause it seems to be obscure nowadays. looking for alternative recommendations (anti aging properties and same specs as it na gel-type, low pH and has NO sodium lauryl sulfate)\nTIA",
    "comment_id": "lentdzd",
    "comment_score": 1,
    "comment_created_utc": 1721795987.0,
    "comment_author": "Acceptable_Winner628",
    "match_confidence": 1.0,
    "matched_product": "Luxe Organix's Aqua Lock hydrogel cleanser"
  },
  {
    "skin_type": [
      "Normal",
      "Dry",
      "Combination"
    ],
    "product_name": "Cerave Hydrating Cream-to-Foam Cleanser",
    "price_size": "Available in different sizes but I prefer buying the biggest size which is 19floz kasi madami kami gumagamit sa house.",
    "effects": "Hydrating and hindi drying sa face. Not sure if it removes makeup since I always double cleanse if I’m wearing makeup or anything with spf. Everyone in the house uses this cleanser kahit yung tita ko na oily/combination skin at yung tita ko na may rosacea. And it works for them, too.",
    "status": "HG",
    "comment": "Skin Type: Normal/Dry Combination\nProduct Name: Cerave Hydrating Cream-to-Foam Cleanser\nPrice and Size: Available in different sizes but I prefer buying the biggest size which is 19floz kasi madami kami gumagamit sa house.\nWhere to buy: Nagpapasabuy lang me sa family sa US. Pero madami naman legit na resellers sa Shopee.\nEffects/Experience: Hydrating and hindi drying sa face. Not sure if it removes makeup since I always double cleanse if I’m wearing makeup or anything with spf. Everyone in the house uses this cleanser kahit yung tita ko na oily/combination skin at yung tita ko na may rosacea. And it works for them, too.\nStatus: HG!!! ❤️ 3 years ko na tong ginagamit. I can’t imagine using another cleanser.",
    "comment_id": "k8v3za7",
    "comment_score": 9,
    "comment_created_utc": 1699748654.0,
    "comment_author": "Impossible_Ad421",
    "match_confidence": 1.0,
    "matched_product": "Cerave Hydrating Cream-to-Foam Cleanser"
  },
  {
    "skin_type": [
      "Combination",
      "Oily",
      "Sensitive",
      "Acne Prone"
    ],
    "product_name": "CosRX Low ph Good Morning Cleanser",
    "price_size": "150ml, 284",
    "effects": "doesnt feel like it’s stripping my face with oil and it doesnt make my skin feel taut after. Just enough na i feel it’s clean",
    "status": "HG",
    "comment": "Skin Type: combination, oily. Sensitive, prone to acne breakouts pag hindi hiyang\nProduct Name: CosRX Low ph Good Morning Cleanser\nPrice and Size: 150ml, 284\nWhere to buy: shopee/lazada. I buy mine from Some More KBeauty store\nEffects/Experience: doesnt feel like it’s stripping my face with oil and it doesnt make my skin feel taut after. Just enough na i feel it’s clean\nStatus: HG / WR. This is my 2nd tube already and i’m either getting this one or if i find my favorite favorite facial wash from Face Republic. Baka kasi phased out na sya",
    "comment_id": "k8sjhm9",
    "comment_score": 11,
    "comment_created_utc": 1699715771.0,
    "comment_author": "Hot_Foundation_448",
    "match_confidence": 0.9444444444444444,
    "matched_product": "COSRX Low pH Good Morning Gel Cleanser"
  },
  {
    "skin_type": [
      "Oily",
      "Acne Prone"
    ],
    "product_name": "** pyunkang yul acne facial cleanser",
    "price_size": "** 301 for 120ml",
    "effects": "** it's probably the mildest cleanser i've tried so far and it's also scent-free. ig the only downside is hindi siya ganon kabula.",
    "status": "WR",
    "comment": "**Skin Type:** oily, acne prone\n**Product Name:** pyunkang yul acne facial cleanser\n**Price and Size:** 301 for 120ml\n**Where to buy:** bought mine from mybeautystory during the time it was out of stock in their official store but there are stocks again\n**Effects/Experience:** it's probably the mildest cleanser i've tried so far and it's also scent-free. ig the only downside is hindi siya ganon kabula.\n**Status:** WR",
    "comment_id": "k8y3r9l",
    "comment_score": 5,
    "comment_created_utc": 1699808273.0,
    "comment_author": "xiaodaze",
    "match_confidence": 1.0,
    "matched_product": "Pyunkang Yul Acne Facial Cleanser"
  },
  {
    "skin_type": [
      "Dry",
      "Sensitive"
    ],
    "product_name": "cetaphil gentle cleanser",
    "price_size": "₱1, 700 ata yung 1L, idk kung magkano kasi pinapadalhan lang ako ng sister ko from Canada",
    "effects": "I've been using cetaphil since 2019 and I could say na eto talaga holy grail ko kasi ang lala ng pimps ko before like meron sa pisngi ganon pero dahil sa cetaphil kahit papano di na ko nagkakaron masyado ng pimps, siguro pag before, during or after na ng mens ko ako nagkakapimps tas paisa isa na lang. Yung boyfriend ko rin cetaphil na rin gamit nya, ganon din umokay din yung mukha nya hehe",
    "status": "HG",
    "comment": "skin type: sensitive & dry\nproduct name: cetaphil gentle cleanser\nprice and size: ₱1, 700 ata yung 1L, idk kung magkano kasi pinapadalhan lang ako ng sister ko from Canada\nwhere to buy: watsons, supermarkets\neffects and experience: I've been using cetaphil since 2019 and I could say na eto talaga holy grail ko kasi ang lala ng pimps ko before like meron sa pisngi ganon pero dahil sa cetaphil kahit papano di na ko nagkakaron masyado ng pimps, siguro pag before, during or after na ng mens ko ako nagkakapimps tas paisa isa na lang. Yung boyfriend ko rin cetaphil na rin gamit nya, ganon din umokay din yung mukha nya hehe\nstatus: HG & WR 💯",
    "comment_id": "k8wfktp",
    "comment_score": 3,
    "comment_created_utc": 1699772634.0,
    "comment_author": "kikayisthename",
    "match_confidence": 0.9056603773584906,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "Skin Aqua UV Super Moisture Gel",
    "price_size": "110g | 450-550",
    "effects": "Been a Bioré girl ever since but nagoioil up ako sa biore so tried this one out and I’m currently on my 3 bottle na. Its suitable for oily gals since it is easily absorbed by the skin. No sticky feeling as well",
    "status": "HG",
    "comment": "Skin Type: Oily\nProduct Name: Skin Aqua UV Super Moisture Gel\nPrice and Size: 110g | 450-550\nEffects and Experience: Been a Bioré girl ever since but nagoioil up ako sa biore so tried this one out and I’m currently on my 3 bottle na. Its suitable for oily gals since it is easily absorbed by the skin. No sticky feeling as well\nStatus: HG",
    "comment_id": "j9nh55r",
    "comment_score": 20,
    "comment_created_utc": 1677131396.0,
    "comment_author": "_luna21",
    "match_confidence": 0.9253731343283582,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [
      "Normal"
    ],
    "product_name": "Belo Dewy Essence Sunscreen",
    "price_size": "₱400/ 50ml *[they also sell a 10ml version for ₱100 in their online stores]",
    "effects": "I was trying to find this item for a while as it became viral online at some point. I got lucky spotting one in SM’s beauty section and bought it right away. Super lightweight and it absorbs into the skin quickly. Definitely is a dewy finish on me, but you can powder it down if you don’t want the dewy effect. No white cast, and if doesn’t sting your eyes even when you sweat a lot like I do. Reapplies nicely as well, suits our weather perfectly and is a great option for a beach trip sunscreen (Brought this to a 4D3N trip to LU). For its price, it’s one of the best local ones you can try!",
    "status": "HG",
    "comment": "SKIN TYPE: Normal (But sweats quickly)\nPRODUCT NAME: Belo Dewy Essence Sunscreen\nPRICE AND SIZE: ₱400/ 50ml *[they also sell a 10ml version for ₱100 in their online stores]\nEFFECTS AND EXPERIENCE: I was trying to find this item for a while as it became viral online at some point. I got lucky spotting one in SM’s beauty section and bought it right away. Super lightweight and it absorbs into the skin quickly. Definitely is a dewy finish on me, but you can powder it down if you don’t want the dewy effect. No white cast, and if doesn’t sting your eyes even when you sweat a lot like I do. Reapplies nicely as well, suits our weather perfectly and is a great option for a beach trip sunscreen (Brought this to a 4D3N trip to LU). For its price, it’s one of the best local ones you can try!\nSTATUS: HG ❤️",
    "comment_id": "j9s46wy",
    "comment_score": 16,
    "comment_created_utc": 1677211059.0,
    "comment_author": "alienbanana0902",
    "match_confidence": 1.0,
    "matched_product": "Belo Dewy Essence Sunscreen"
  },
  {
    "skin_type": [
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Skin Aqua UV Super Moisture Gel",
    "price_size": "140g",
    "effects": "Really wanted to like this one pero unfortunately nagka-comedones ako dito. It's very dewy/shiny on my skin even when it sets. Mabilis din mag-oil up skin ko pag gamit ko to kahit lagyan ko ng setting powder.",
    "status": "WNR",
    "comment": "Skin Type: Snesitive, Oily, Acne-prone\nProduct Name: Skin Aqua UV Super Moisture Gel\nPrice and Size: 140g\nEffects and Experience: Really wanted to like this one pero unfortunately nagka-comedones ako dito. It's very dewy/shiny on my skin even when it sets. Mabilis din mag-oil up skin ko pag gamit ko to kahit lagyan ko ng setting powder.\nStatus: WNR",
    "comment_id": "jpzvj9n",
    "comment_score": 12,
    "comment_created_utc": 1688048358.0,
    "comment_author": "lanwangjisus",
    "match_confidence": 0.9253731343283582,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [
      "Oily",
      "Acne Prone"
    ],
    "product_name": "Skin Aqua UV Super Moisture Gel Gold SPF 50+ PA++++",
    "price_size": "400\\~ PHP / 50g",
    "effects": "This has a pretty strong fragrance. This is the new version which have PA++++ instead of 3 pluses. If I can verify that my face if fine with the fragrance and the sunscreen, then I'll definitely choose this over the Benton and Beauty of Joseon suncreens. This is just like them but lighter, faster to spread and goes completely clear on the skin. I heard that the BOJ may have a slight whitecast on deeper skin tones but this one will probably not have one. This is priced very nicely and is not as shiny or dewy as the above two.",
    "status": "HG",
    "comment": "Skin Type: Oily, acne-prone that may also be dehydrated. I notice that a lot of products that didn't really suited my skin took awhile to start showing bad effects and these effects were very slow to emerge so medyo pahirapan malaman kung alin ba yung issue sa mga pruoducts na gamit ko.\nI'm quite new to sunscreens so these would all be my \"first impressions\" of the products though I've already used most of these multiple times already.\nProduct Name: Skin Aqua UV Super Moisture Gel Gold SPF 50+ PA++++\nPrice and Size: 500-600 PHP / 110g\nEffects/Experience: Extremely nice, this one is lightweight and very easy to blend. It disappears on your skin and leaves it with a natural finish, maybe ever so slightly more glowy than before you applied but otherwise almost nothing. The feeling it leaves your skin is quite smooth and also pretty natural. It has alcohol but aside from the smell which disappears completely after a few seconds, I did not really experience any bad effects from this. This is neither moisturizing nor drying. Fragrance free and water resistant.\nStatus: HG probably, definitely\nProduct Name: Kose Suncut  UV Perfect Gel SPF 50+ PA++++\nPrice and Size: 500-600 PHP / 100g\nEffects/Experience: I would say that this is quite comparable to the Skin Aqua above but they have their differences. This feels a little silicone-y or idk. It's lightweight and zero whitecast but it dries very quickly on your skin that I'm still not done spreading it but it's already setting on my skin, will does cause it to pill a little, especially on my brows. Like the Skin Aqua, this has alcohol though I will say that my face doesn't look \"as good\" at the end of the day after using this compared to the skin aqua so this may be ever so slightly drying. Also I noticed multiple times that this was making my eyes a bit sensitive and feel cool. Fragrance free and water resistant.\nStatus: MRP\nProduct Name: OMI Menturm VERDIO UV Moisture Gel SPF 50+ PA++++\nPrice and Size: 350-499 PHP / 80g (also in 220g)\nEffects/Experience: This, compared to the other Japanese sunscreens is alcohol-free. Also fragrance-free, water resistant. This one seems to be advertised for those with sensitive skin as this also is advertised for kids. This is very milky/gloopy. Using this, you will notice that it doesn't set as quickly as the Skin Aqua but is still easy to spread and is definitely on the dewy, glowy, shiny side of sunscreens. Whether that is a good thing or a bad thing will depend on you. This is just like the other Korean sunscreens where if you want something moisturizing, dewy, and have other beneficial ingredients then you may want to try this.\nStatus: WRP, maybe HG for the type of sunscreen which has no alcohol and feels a little more like skincare and not just for protection.\nProduct Name: Benton Air Fit UV Defense Sun Cream\nPrice and Size: 500 PHP / 50ml\nEffects/Experience: I bought this together with the Beauty of Joseon and I will say that they are pretty comparable. The Benton has a green tint which doesn't really do anything as it turns watery once you start spreading it. This also have an essential oil which you can definitely smell. Like the Omi Menturm, this is shiny, dewy etc but is not water resistant. This also feels a little thicker on the skin once it dries down and it doesn't really sets or disappear like those really lightweight sunscreens.\nStatus: MRP, maybe not, not quite sure yet.\nProduct Name: Beauty of Joseon Relief Sun Rice + Probiotics SPF50+ PA++++\nPrice and Size: 500-600 PHP / 50ml\nEffects/Experience: This is similar to the Benton but without essential oil. I would say that this has a pretty different texture, parang kakaiba yung feel niya once you spread it, but the finish remains the same. I can't really say whether the Benton or the Beauty of Joseon is shinier, but both looks very reflective after applying but they do set into an acceptable finish. Same thoughts to Benton really, if you like one of them then you'll like the other. Also almost forgot to mention, both stings my fingers as I apply them though my face feels fine.\nStatus: MRP, maybe not, not quite sure yet.\nProduct Name: Etude House Sunprise Mild Watery Light SPF50+ PA++++\nPrice and Size: 400\\~ PHP / 50g\nEffects/Experience: This has a pretty strong fragrance. This is the new version which have PA++++ instead of 3 pluses. If I can verify that my face if fine with the fragrance and the sunscreen, then I'll definitely choose this over the Benton and Beauty of Joseon suncreens. This is just like them but lighter, faster to spread and goes completely clear on the skin. I heard that the BOJ may have a slight whitecast on deeper skin tones but this one will probably not have one. This is priced very nicely and is not as shiny or dewy as the above two.\nStatus: MRP",
    "comment_id": "j9oic0n",
    "comment_score": 5,
    "comment_created_utc": 1677158552.0,
    "comment_author": "hlthnwllnss",
    "match_confidence": 0.8780487804878049,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [
      "Normal",
      "Oily"
    ],
    "product_name": "Anessa Perfect UV Sunscreen Skincare Gel",
    "price_size": "\\~1400PHP for 90g",
    "effects": "No white cast on moreno skin, kind of dewy finish but not super glowy. Reapplies okay, but the scent (while not strong and not unpleasant but def smells perfumey) isn't one I like smelling first thing in the morning. Kinda stings my eyes if it migrates into my eye but nothing crazy. Kinda expensive but it's a good sunscreen.",
    "status": null,
    "comment": "Skin Type: Normal/Oily (but very sweaty)\nProduct Name: Anessa Perfect UV Sunscreen Skincare Gel\nPrice and size: \\~1400PHP for 90g\nEffects/Experience: No white cast on moreno skin, kind of dewy finish but not super glowy. Reapplies okay, but the scent (while not strong and not unpleasant but def smells perfumey) isn't one I like smelling first thing in the morning. Kinda stings my eyes if it migrates into my eye but nothing crazy. Kinda expensive but it's a good sunscreen.\nStatus: Would repurchase (with reservations lol)",
    "comment_id": "j9smghp",
    "comment_score": 1,
    "comment_created_utc": 1677221951.0,
    "comment_author": "thatonesaddude",
    "match_confidence": 0.926829268292683,
    "matched_product": "Anessa Perfect UV Sunscreen Skin Care Milk"
  },
  {
    "skin_type": [
      "Normal",
      "Dry"
    ],
    "product_name": "belo dewy essence sunscreen",
    "price_size": "₱450 for 50ml of product (NOTE: since belo always offer b1t1, you can get 2 50ml bottles of sunscreen for ₱450)",
    "effects": "Highly moisturizing and zero white cast. I never felt the need to add in extra moisturizer and it is also great under make up.",
    "status": "HG",
    "comment": "Skin Type: normal to dry\nProduct Name: belo dewy essence sunscreen\nPrice and Size: ₱450 for 50ml of product (NOTE: since belo always offer b1t1, you can get 2 50ml bottles of sunscreen for ₱450)\nEffects/Experience: Highly moisturizing and zero white cast. I never felt the need to add in extra moisturizer and it is also great under make up.\nStatus: HG",
    "comment_id": "kvq0dlz",
    "comment_score": 25,
    "comment_created_utc": 1710937340.0,
    "comment_author": "Rationaly_tea",
    "match_confidence": 1.0,
    "matched_product": "Belo Dewy Essence Sunscreen"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "ANESSA Perfect UV Sunscreen Skincare Gel",
    "price_size": "P1490 in Shopee 90g (I bought this much cheaper in yen)",
    "effects": "Fave! It’s in the top with La Roche Posay in terms of formulation, but this one has better and more sustainable packaging so this wins. Yung tip ng LRP got easily damaged in my experience unfortunately.",
    "status": null,
    "comment": "Skin Type: Oily\nProduct Name: ANESSA Perfect UV Sunscreen Skincare Gel\nPrice and Size: P1490 in Shopee 90g (I bought this much cheaper in yen)\nEffects/Experience: It has been my fave sunscreen so far! There’s no whitecast and it acts as a makeup primer. My skin instantly brigtens up whenever I put this, so I can just use this and wear lipstick if I go somewhere where I don’t need to use full make-up. Bought this last October and have yet to finish it.\nI love that there’s no sticky feeling unlike Biore, and I can layer it up when I know I’ll go somewhere with prolonged sun exposure. Also tried applying it over makeup, so long as I tap it unto my skin there’s no trace of reapplication.\nI’ve tried the UV milk and I like them both, but the Gel one just sits better on my oily skin imo. I also love that there’s a smaller sized pack, so I just refill the bottle when I’m traveling.\nBtw I’m using the old formula.\nStatus: Fave! It’s in the top with La Roche Posay in terms of formulation, but this one has better and more sustainable packaging so this wins. Yung tip ng LRP got easily damaged in my experience unfortunately.",
    "comment_id": "kvn58bh",
    "comment_score": 6,
    "comment_created_utc": 1710884761.0,
    "comment_author": "fritterest",
    "match_confidence": 0.926829268292683,
    "matched_product": "Anessa Perfect UV Sunscreen Skin Care Milk"
  },
  {
    "skin_type": [
      "Combination"
    ],
    "product_name": "Skin Aqua UV Super Moisture Gel",
    "price_size": null,
    "effects": "This is hands down my favorite sunscreen of all time it blends easily and sinks into the skin fast, even though chemical sunscreen siya it doesnt sting my eyes im just so sad that the 2024 version didnt work for me ;( off to hunt a similar sunscreen ig",
    "status": "HG",
    "comment": "Skin Type: combination\nProduct Name: Skin Aqua UV Super Moisture Gel\nPrice: 400-600 php 110g - 165g\nEffects/Experience: This is hands down my favorite sunscreen of all time it blends easily and sinks into the skin fast, even though chemical sunscreen siya it doesnt sting my eyes im just so sad that the 2024 version didnt work for me ;( off to hunt a similar sunscreen ig\nStatus: HG !",
    "comment_id": "l7vzgj2",
    "comment_score": 3,
    "comment_created_utc": 1717976413.0,
    "comment_author": "Effective-Love-4025",
    "match_confidence": 0.9253731343283582,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [
      "Combination",
      "Oily"
    ],
    "product_name": "Skin Aqua UV Super Moisture Gel",
    "price_size": "380-400 for a 110g bottle (shopee)",
    "effects": "I've been using this for two weeks now (mostly outdoors) and this has to be one of my favorite sunscreens, yet. I have tanned skin and this leaves absolutely no whitecast on me. Also really easy to re-apply because of how easily it melts into my skin and feels like a light moisturizer. I'm often outdoors and with combination/oily skin, this does leave a bit of a dewy shine. It doesn't look greasy though. I used this on a hike and as someone who sweats a lot, the waterproof rating did seem to hold its ground. It smells strongly of alcohol on first application, but the scent goes away minutes after. It didn't sting my eyes even on hot, sweaty days.",
    "status": "HG",
    "comment": "Skin Type: Combination/Oily\nProduct Name: Skin Aqua UV Super Moisture Gel\nPrice and Size: 380-400 for a 110g bottle (shopee)\nEffects and Experience:\nI've been using this for two weeks now (mostly outdoors) and this has to be one of my favorite sunscreens, yet. I have tanned skin and this leaves absolutely no whitecast on me. Also really easy to re-apply because of how easily it melts into my skin and feels like a light moisturizer.\nI'm often outdoors and with combination/oily skin, this does leave a bit of a dewy shine. It doesn't look greasy though. I used this on a hike and as someone who sweats a lot, the waterproof rating did seem to hold its ground. It smells strongly of alcohol on first application, but the scent goes away minutes after. It didn't sting my eyes even on hot, sweaty days.\nStatus: Potential HG. Will definitely repurchase!",
    "comment_id": "mt8kjf4",
    "comment_score": 14,
    "comment_created_utc": 1747711534.0,
    "comment_author": "RambVines",
    "match_confidence": 0.9253731343283582,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "Belo Dewy Essence Sunscreen",
    "price_size": null,
    "effects": null,
    "status": "HG",
    "comment": "Skin Type : Combo skin, oily around nose\nProduct name: Belo Dewy Essence Sunscreen\nPrice: 500php for Buy1Take1\nExp:\nHaven't tried that many sunscreens in my life but this is my HG!!! No white cast, very smooth finish and super dewy looking. Lays amazing under makeup, there are times where I've skipped moisturizer before makeup and just used this. I prefer this one more over the regular whitening Belo sunscreen, that one is thicker, this one is thinner and truly makes ur skin look naturally dewy\nStatus: HG",
    "comment_id": "mrvq3ze",
    "comment_score": 12,
    "comment_created_utc": 1747037826.0,
    "comment_author": "kyliefever2002",
    "match_confidence": 1.0,
    "matched_product": "Belo Dewy Essence Sunscreen"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "Skin Aqua UV Super Moisture Gel",
    "price_size": "400+ Php, 50g",
    "effects": "it has thick & creamy consistency but feels lightweight once applied. Very moisturizing din siya at the same time kaya I don’t need to use a separate moisturizer na. Although it makes my face very shiny but I just dab some powder to remove shine. It doesn’t pill as well kaya winner siya for me.",
    "status": "HG",
    "comment": "Skin Type: Oily\nProduct Name: Skin Aqua UV Super Moisture Gel\nPrice & Size: 400+ Php, 50g\nEffects / Experience: it has thick & creamy consistency but feels lightweight once applied. Very moisturizing din siya at the same time kaya I don’t need to use a separate moisturizer na. Although it makes my face very shiny but I just dab some powder to remove shine. It doesn’t pill as well kaya winner siya for me.\nStatus: HG & WR",
    "comment_id": "mrvkpdc",
    "comment_score": 6,
    "comment_created_utc": 1747034356.0,
    "comment_author": "Kiwi_pieeee",
    "match_confidence": 0.9253731343283582,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [
      "Dry"
    ],
    "product_name": "Skin Aqua Uv Super Moisture Gel Gold",
    "price_size": "Php 650 110g",
    "effects": "Creamy and watery. Easily blends under my makeup. I didn't get any outbreak when I use this. No whitecast but slightly greasy",
    "status": "WR",
    "comment": "Skin Type: Dry\nProduct Name: Skin Aqua Uv Super Moisture Gel Gold\nPrice and Size: Php 650 110g\nEffects and Experience: Creamy and watery. Easily blends under my makeup. I didn't get any outbreak when I use this. No whitecast but slightly greasy\nStatus: WR",
    "comment_id": "mrw2kt6",
    "comment_score": 5,
    "comment_created_utc": 1747045688.0,
    "comment_author": "somecityhermit",
    "match_confidence": 1.0,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  },
  {
    "skin_type": [
      "Dry"
    ],
    "product_name": "Anessa Perfect UV Sunscreen Skin Care Milk SPF 50+",
    "price_size": "1,407.04",
    "effects": "easy to apply, no white cast, not sticky, and no heavy feeling on the skin. Goes well with my moisturizer and cushion. I don't need to reapply during the day. Very wearable during the summer.",
    "status": "HG",
    "comment": "Skin Type: Dry\nProduct Name: Anessa Perfect UV Sunscreen Skin Care Milk SPF 50+\nPrice and Size: 1,407.04\nEffects and Experience: easy to apply, no white cast, not sticky, and no heavy feeling on the skin. Goes well with my moisturizer and cushion. I don't need to reapply during the day. Very wearable during the summer.\nStatus: HG, will definitely repurchase again and again and again😅",
    "comment_id": "mrw34z0",
    "comment_score": 5,
    "comment_created_utc": 1747045999.0,
    "comment_author": "princesselphie28",
    "match_confidence": 0.9230769230769231,
    "matched_product": "Anessa Perfect UV Sunscreen Skin Care Milk"
  }
]