[
  {
    "skin_type": [
      "Oily",
      "Acne Prone",
      "Sensitive"
    ],
    "product_name": "Cetaphil Cleanser",
    "price_size": null,
    "effects": "Dito lang ako nahiyang kasi walang hapdi. Before I use The Face Shop B1T1 cleanser pero mas nahiyang talaga ako kay Cetaphil. Nag-ooil pa rin naman face ko pero hindi dugyot tignan. Plus hindi na ako nagbbreakout.",
    "status": "HG",
    "comment": "Skin Type: Oily and Sensitive (Acne-Prone)\nProduct Name: Cetaphil Cleanser\nI usually use it after cleaning with Micellar Water\nType: Liquid\nPrice: 990 for 591 ML (I always buy sa S&R kapag B1T1 sila so parang 445 each)\nEffect: Dito lang ako nahiyang kasi walang hapdi. Before I use The Face Shop B1T1 cleanser pero mas nahiyang talaga ako kay Cetaphil. Nag-ooil pa rin naman face ko pero hindi dugyot tignan. Plus hindi na ako nagbbreakout.\nStatus: HG",
    "comment_id": "l7oombn",
    "comment_score": 5,
    "comment_created_utc": 1717859838.0,
    "comment_author": "telejubbies",
    "match_confidence": 0.7391304347826086,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  },
  {
    "skin_type": [
      "Combination"
    ],
    "product_name": "COSRC Salicylic Acid Cleanser",
    "price_size": null,
    "effects": "Maganda sya for me. Got laid off and no work for 6 months so wala talagang budget for skincare. Textured skin, acne prone pa, sabayan pa ng stress so ayun ang dumi talaga ng mukha ko. Until I came across this product and has been using it for 1 week now and promising ang results; pimples nag dry na, dark spots starting to lighten.",
    "status": null,
    "comment": "Skin Type: Combination\nProduct Name: COSRC Salicylic Acid Cleanser\nPrice: 350\nType: Creamy\nEffect: Maganda sya for me. Got laid off and no work for 6 months so wala talagang budget for skincare. Textured skin, acne prone pa, sabayan pa ng stress so ayun ang dumi talaga ng mukha ko. Until I came across this product and has been using it for 1 week now and promising ang results; pimples nag dry na, dark spots starting to lighten.",
    "comment_id": "l7nxm4y",
    "comment_score": 4,
    "comment_created_utc": 1717847740.0,
    "comment_author": "salty_mamimo",
    "match_confidence": 0.7887323943661971,
    "matched_product": "Cosrx Salicylic Acid Daily Gentle Cleanser"
  },
  {
    "skin_type": [
      "Combination",
      "Oily",
      "Acne Prone",
      "Sensitive"
    ],
    "product_name": "Cetaphil Cleanser",
    "price_size": null,
    "effects": "Tried this kasi nag dry yung skin ko. Ever since ginamit ko to, nabawasan din yung pimples ko and little bumps sa buong mukha ko. I also noticed na lumambot din yung balat ko sa mukha. Every morning ko lang to ginagamit kasi nag a-acne soap ako sa gabi",
    "status": "HG",
    "comment": "Skin Type: Combination / Oily and Sensitive (Acne-Prone)\nProduct Name: Cetaphil Cleanser\nType: Gel type\nPrice: 300+ for 118 ml\nEffect: Tried this kasi nag dry yung skin ko. Ever since ginamit ko to, nabawasan din yung pimples ko and little bumps sa buong mukha ko. I also noticed na lumambot din yung balat ko sa mukha.\nEvery morning ko lang to ginagamit kasi nag a-acne soap ako sa gabi\nStatus: HG ✨",
    "comment_id": "l7x3l7o",
    "comment_score": 3,
    "comment_created_utc": 1717994286.0,
    "comment_author": "minianing",
    "match_confidence": 0.7391304347826086,
    "matched_product": "Cetaphil Gentle Skin Cleanser"
  }
]