[
  {
    "skin_type": [
      "Normal",
      "Dry"
    ],
    "product_name": "belo dewy essence sunscreen",
    "price_size": "₱450 for 50ml of product (NOTE: since belo always offer b1t1, you can get 2 50ml bottles of sunscreen for ₱450)",
    "effects": "Highly moisturizing and zero white cast. I never felt the need to add in extra moisturizer and it is also great under make up.",
    "status": "HG",
    "comment": "Skin Type: normal to dry\nProduct Name: belo dewy essence sunscreen\nPrice and Size: ₱450 for 50ml of product (NOTE: since belo always offer b1t1, you can get 2 50ml bottles of sunscreen for ₱450)\nEffects/Experience: Highly moisturizing and zero white cast. I never felt the need to add in extra moisturizer and it is also great under make up.\nStatus: HG",
    "comment_id": "kvq0dlz",
    "comment_score": 25,
    "comment_created_utc": 1710937340.0,
    "comment_author": "Rationaly_tea",
    "match_confidence": 1.0,
    "matched_product": "Belo Dewy Essence Sunscreen"
  },
  {
    "skin_type": [
      "Oily"
    ],
    "product_name": "ANESSA Perfect UV Sunscreen Skincare Gel",
    "price_size": "P1490 in Shopee 90g (I bought this much cheaper in yen)",
    "effects": "Fave! It’s in the top with La Roche Posay in terms of formulation, but this one has better and more sustainable packaging so this wins. Yung tip ng LRP got easily damaged in my experience unfortunately.",
    "status": null,
    "comment": "Skin Type: Oily\nProduct Name: ANESSA Perfect UV Sunscreen Skincare Gel\nPrice and Size: P1490 in Shopee 90g (I bought this much cheaper in yen)\nEffects/Experience: It has been my fave sunscreen so far! There’s no whitecast and it acts as a makeup primer. My skin instantly brigtens up whenever I put this, so I can just use this and wear lipstick if I go somewhere where I don’t need to use full make-up. Bought this last October and have yet to finish it.\nI love that there’s no sticky feeling unlike Biore, and I can layer it up when I know I’ll go somewhere with prolonged sun exposure. Also tried applying it over makeup, so long as I tap it unto my skin there’s no trace of reapplication.\nI’ve tried the UV milk and I like them both, but the Gel one just sits better on my oily skin imo. I also love that there’s a smaller sized pack, so I just refill the bottle when I’m traveling.\nBtw I’m using the old formula.\nStatus: Fave! It’s in the top with La Roche Posay in terms of formulation, but this one has better and more sustainable packaging so this wins. Yung tip ng LRP got easily damaged in my experience unfortunately.",
    "comment_id": "kvn58bh",
    "comment_score": 6,
    "comment_created_utc": 1710884761.0,
    "comment_author": "fritterest",
    "match_confidence": 0.926829268292683,
    "matched_product": "Anessa Perfect UV Sunscreen Skin Care Milk"
  },
  {
    "skin_type": [
      "Combination"
    ],
    "product_name": "Skin Aqua UV Super Moisture Gel",
    "price_size": null,
    "effects": "This is hands down my favorite sunscreen of all time it blends easily and sinks into the skin fast, even though chemical sunscreen siya it doesnt sting my eyes im just so sad that the 2024 version didnt work for me ;( off to hunt a similar sunscreen ig",
    "status": "HG",
    "comment": "Skin Type: combination\nProduct Name: Skin Aqua UV Super Moisture Gel\nPrice: 400-600 php 110g - 165g\nEffects/Experience: This is hands down my favorite sunscreen of all time it blends easily and sinks into the skin fast, even though chemical sunscreen siya it doesnt sting my eyes im just so sad that the 2024 version didnt work for me ;( off to hunt a similar sunscreen ig\nStatus: HG !",
    "comment_id": "l7vzgj2",
    "comment_score": 3,
    "comment_created_utc": 1717976413.0,
    "comment_author": "Effective-Love-4025",
    "match_confidence": 0.9253731343283582,
    "matched_product": "Skin Aqua UV Super Moisture Gel Gold"
  }
]